// A. Жираф путешествует и кушает
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мебибайт

// Дано прямоугольное поле размера m × n. В левой верхней клетке с координатами (1, 1)
// — стартовой — стоит жираф. Он хочет попасть в правую нижнюю клетку с координатами
// (m, n) — финишную. Каждой клетке поля соответствует целое число — количество деревьев
// в ней.

// Жираф умеет делать ходы двух видов: на k клеток вниз и 1 клетку вправо; или на k
// клеток вправо и 1 вниз. Жираф хочет пройти по полю из стартовой клетки в финишную,
// в конце каждого хода поедая листья на деревьях в клетке, в которую он пришёл.
// В стартовой клетке он ничего не ест. При этом каждый чётный ход жираф чувствует
// себя голодным, поэтому съедает 3t листьев, а каждый нечётный ход чувствует себя
// объевшимся, поэтому съедает только t листьев, где t — количество деревьев на клетке.
// Ходы нумеруются с единицы.

// Выясните, какое наибольшее количество листьев жираф может съесть в своём путешествии.

// Входные данные
// В первой строке заданы через пробел два целых числа: m и n (1 ≤ m, n ≤ 100).

// Во второй строке задано целое число k (1 ≤ k ≤ min(m, n)).

// В следующих m строках записано по n чисел в каждой; j-е число i-й из этих строк
// соответствует количеству деревьев в клетке (i, j), это целое число в диапазоне
// от 0 до 100, включительно.

// Выходные данные
// Выведите одно число — наибольшее количество листьев, которое может съесть жираф
// по пути из стартовой клетки в финишную. Если таких путей нет, выведите −1.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 2 2
// 1
// 1 1
// 1 1
// ======================================================================
// Выходные данные
// ======================================================================
// 1

// ======================================================================
// Входные данные
// ======================================================================
// 3 5
// 2
// 1 2 0 3 1
// 2 4 5 7 8
// 3 0 7 1 0
// ======================================================================
// Выходные данные
// ======================================================================
// 5

// ======================================================================
// Входные данные
// ======================================================================
// 3 2
// 1
// 1 3
// 2 4
// 1 2
// ======================================================================
// Выходные данные
// ======================================================================
// -1
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

struct node
{
    int i, val;
};

void solve()
{
    int m, n, k;
    cin >> m >> n >> k;
    vector<vector<int>> a(m, vector<int>(n));
    for (auto &i : a)
        for (auto &j : i)
            cin >> j;
    vector<vector<node>> dp(m, vector<node>(n, {0, -1}));
    dp[0][0].i = 0;
    dp[0][0].val = 0;
    for (int i = 0; i < m; i++)
    {
        for (int j = 0; j < n; j++)
        {
            if (i >= k && j > 0 && dp[i - k][j - 1].val != -1)
            {
                if (dp[i - k][j - 1].i % 2 != 0)
                    dp[i][j].val = max(dp[i][j].val, dp[i - k][j - 1].val + a[i][j] * 3);
                else
                    dp[i][j].val = max(dp[i][j].val, dp[i - k][j - 1].val + a[i][j]);

                dp[i][j].i = dp[i - k][j - 1].i + 1;
            }

            if (i > 0 && j >= k && dp[i - 1][j - k].val != -1)
            {
                if (dp[i - 1][j - k].i % 2 != 0)
                    dp[i][j].val = max(dp[i][j].val, dp[i - 1][j - k].val + a[i][j] * 3);
                else
                    dp[i][j].val = max(dp[i][j].val, dp[i - 1][j - k].val + a[i][j]);

                dp[i][j].i = dp[i - 1][j - k].i + 1;
            }
        }
    }
    // for (auto &i : dp)
    // {
    //     for (auto &j : i)
    //         cout << j.val << ' ';
    //     cout << '\n';
    // }
    cout << dp[m - 1][n - 1].val;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
