// B. Подпоследовательность с заданными разностями
// ограничение по времени на тест4 секунды
// ограничение по памяти на тест256 мебибайт

// Даны последовательность различных целых чисел и множество разрешённых разностей.
// Необходимо найти длину самой длинной возрастающей подпоследовательности, в которой
// разность между любыми двумя соседними элементами — разрешённая. Например, если
// разрешённые разности равны 1 и 3, то подпоследовательность 1, 4, 5, 8 будет
// удовлетворять условию, а последовательность 1, 2, 4 — нет, так как разность
// второго и третьего элемента равна 2.

// Входные данные
// Первая строка содержит два целых числа n и k (1 ≤ n ≤ 10^6 и 1 ≤ k ≤ 10) —
// количество элементов в последовательности и количество разрешённых разностей
// соответственно. Вторая строка содержит n различных целых чисел s_i (1 ≤ s_i ≤ 10^9) —
// элементы последовательности. Третья строка содержит k различных целых чисел d_i
// (1 ≤ d_i ≤ 10^9) — разрешённые разности.

// Выходные данные
// Одно целое положительное число — длина самой длинной возрастающей подпоследовательности
// с разрешёнными разностями.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 7 2
// 2 5 6 3 8 10 9
// 3 1
// ======================================================================
// Выходные данные
// ======================================================================
// 4

// ======================================================================
// Входные данные
// ======================================================================
// 9 2
// 2 5 6 3 8 10 9 7 12
// 1 3
// ======================================================================
// Выходные данные
// ======================================================================
// 5
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, k;
    cin >> n >> k;
    vector<int> a(n), ak(k);
    for (auto &i : a)
        cin >> i;
    unordered_map<int, int> dp;
    for (auto &i : ak)
        cin >> i;
    int res = 0;
    for (int i = 0; i < n; i++)
    {
        int cur_val = a[i];
        for (int j = 0; j < k; j++)
        {

            if (dp[cur_val - ak[j]] == 0)
                dp[cur_val] = max(dp[cur_val], (int)1);
            else
                dp[cur_val] = max(dp[cur_val], dp[cur_val - ak[j]] + 1);

            res = max(res, dp[cur_val]);
        }
    }

    cout << res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
