// C. Сумма длин путей
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест512 мебибайт

// Дано неориентированное дерево из n вершин. Найдите сумму длин всех простых путей в нём.

// Длина простого пути между вершинами u и v — это минимальное количество рёбер,
// по которым нужно пройти, чтобы попасть из u в v.

// Входные данные
// В первой строке задано целое число n (1 ≤ n ≤ 300000).

// В следующей строке записано n − 1 целое число p2, p3, …, p_n (1 ≤ p_i < i).
// Они означают, что в дереве есть ребро между 2 и p2, ребро между 3 и p3, …,
// ребро между n и p_n. Гарантируется, что заданные рёбра образуют дерево.

// Выходные данные
// Выведите одно целое число: сумму по всем (u, v), где 1 ≤ u ≤ v ≤ n, длин простых
// путей между u и v.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 1 1 3 1
// ======================================================================
// Выходные данные
// ======================================================================
// 18
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, res = 0;
    cin >> n;
    vector<int> a(n + 1, 1), data(n - 1);
    for (auto &i : data)
        cin >> i;

    for (int i = n; i >= 2; i--)
    {
        int p = data[i - 2];
        a[p] += a[i];
        res += a[i] * (n - a[i]);
    }
    cout << res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
