// E. Космическая экспедиция
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест512 мебибайт

// Космический исследователь планирует отправиться в экспедицию к удалённой планете.
// На его пути в заданном порядке есть несколько космических объектов, каждый из которых
// обладает своей уникальной ценностью для исследования. При этом каждый объект требует
// определённого количества энергии (в единицах) и времени (в днях) для его изучения.

// Однако у исследователя есть ограничение на количество доступной энергии K и времени M,
// чтобы завершить миссию. Необходимо составить оптимальную последовательность посещения
// объектов, которая максимизирует научную ценность экспедиции, учитывая ограничения
// на энергию и время.

// Входные данные
// В первой строке через пробел заданы число 1 ≤ N ≤ 100 — количество космических
// объектов, а также ограничения по энергии 1 ≤ K ≤ 100 и времени 1 ≤ M ≤ 100.

// В последующих N строках для каждого объекта через пробел заданы его научная ценность
// 0 ≤ V ≤ 150, количество энергии 1 ≤ F ≤ 50 и время в днях 1 ≤ T ≤ 20, необходимые
// для исследования.

// Выходные данные
// В первой строке выведите число — максимальную научную ценность исследования.
// Во второй строке — последовательность посещения объектов.

// Предполагается, что объекты нумеруются последовательно, начиная с единицы.
// Исследователь может их посещать только в заданном порядке.

// Если не получится исследовать ни один объект, выведите 0.

// Если возможных решений несколько, выведите любое из них.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5 60 10
// 100 20 3
// 80 17 2
// 50 10 4
// 120 25 4
// 60 12 2
// ======================================================================
// Выходные данные
// ======================================================================
// 280
// 1 4 5

// ======================================================================
// Входные данные
// ======================================================================
// 2 12 10
// 67 15 9
// 120 4 15
// ======================================================================
// Выходные данные
// ======================================================================
// 0

// ======================================================================
// Входные данные
// ======================================================================
// 4 40 30
// 30 7 10
// 50 16 12
// 80 12 20
// 15 5 7
// ======================================================================
// Выходные данные
// ======================================================================
// 110
// 1 3
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

struct Object
{
    int v, f, t, id;
};

void solve()
{
    int n, k, m;
    cin >> n >> k >> m;
    vector<Object> a(n);
    for (int i = 0; i < n; i++)
    {
        cin >> a[i].v >> a[i].f >> a[i].t;
        a[i].id = i + 1;
    }
    vector<vector<vector<int>>> dp(n + 1, vector<vector<int>>(k + 1, vector<int>(m + 1, 0)));
    for (int i = 1; i <= n; i++)
    {
        int v = a[i - 1].v, f = a[i - 1].f, t = a[i - 1].t;
        for (int e = 0; e <= k; e++)
        {
            for (int time = 0; time <= m; time++)
            {
                dp[i][e][time] = dp[i - 1][e][time];
                if (e >= f && time >= t)
                    dp[i][e][time] = max(dp[i][e][time], dp[i - 1][e - f][time - t] + v);
            }
        }
    }
    auto &res = dp[n][k][m];
    cout << res << '\n';
    if (res == 0)
        return;

    vector<int> resPath;
    int cur_e = k, cur_t = m;
    for (int i = n; i > 0; i--)
    {
        if (dp[i][cur_e][cur_t] != dp[i - 1][cur_e][cur_t])
        {
            resPath.push_back(a[i - 1].id);
            cur_e -= a[i - 1].f;
            cur_t -= a[i - 1].t;
        }
    }

    for (auto i = resPath.rbegin(); i != resPath.rend(); i++)
        cout << *i << ' ';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
