// F. Лотерея
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мебибайт

// Лёлик любит играть в лотерею, а также жульничать. И недавно он нашёл лазейку
// в системе принятия лотерейных билетов! Существует задержка между оглашением
// выигрышной комбинации номеров и завершением принятия билетов.

// Правила лотереи, как всегда, просты. Участник покупает лотерейный билет, на котором
// написаны n положительных целых чисел. Затем в определённый день оглашаются n
// положительных целых чисел — выигрышные номера. Все участники их увидят как массив
// целых чисел b. Также заранее оглашаются призы: если i-й элемент билета участника
// совпадает с i-м элементом выигрышного билета, участник получает c_i монет.

// Лёлик решил использовать лазейку в системе для своего обогащения. У него есть
// официальный шаблон лотерейного билета, который представляет собой массив a
// размера n, заполненный единицами. Также у Лёлика есть аппарат для изменения цифр
// на билете.

// К сожалению, аппарат самодельный, и работает следующим образом. Лёлик может выбрать
// два целых числа i (1 ≤ i ≤ n) и z (z > 0) и увеличить a_i на ⌊a_i / z⌋
// (частное от деления a_i на z, округлённое вниз). Лёлик может выбирать одно и то же i
// для операций сколько угодно раз.

// Но этот процесс не быстрый, а время лазейки ограничено. Всего Лёлик сможет совершить
// не более k операций. Поэтому он попросил вас максимизировать свой выигрыш.

// Ваша задача — определить максимальное количество монет, которое может получить
// Лёлик за не более чем k операций.

// Входные данные
// Первая строка содержит одно целое число n (1 ≤ n ≤ 10^3) — количество чисел
// в лотерейном билете.

// Вторая строка содержит одно целое число k (0 ≤ k ≤ 10^6) — максимальное число
// операций.

// Третья строка содержит n целых чисел b_i (1 ≤ b_i ≤ 10^3) — выигрышный лотерейный
// билет.

// Четвёртая строка содержит n целых чисел c_i (0 ≤ c_i ≤ 10^6) — количества монет,
// получаемые за совпадения.

// Выходные данные
// Единственное число — максимальное количество монет, которое можно получить,
// совершив не более k операций.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 3
// 3
// 1 2 3
// 3 2 1
// ======================================================================
// Выходные данные
// ======================================================================
// 6

// ======================================================================
// Входные данные
// ======================================================================
// 3
// 0
// 2 3 4
// 1 1 1
// ======================================================================
// Выходные данные
// ======================================================================
// 0

// ======================================================================
// Входные данные
// ======================================================================
// 5
// 9
// 7 5 3 5 3
// 2 5 3 2 5
// ======================================================================
// Выходные данные
// ======================================================================
// 13
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, k;
    cin >> n >> k;
    vector<int> b(n), c(n), dp(k + 1, -1);
    dp[0] = 0;

    for (auto &i : b)
        cin >> i;
    for (auto &i : c)
        cin >> i;

    const int max_b = 1e3 + 1;
    vector<int> dp_b(max_b + 1, 1e9);
    dp_b[1] = 0;

    for (int ai = 1; ai < max_b; ai++)
    {
        if (dp_b[ai] == 1e9)
            continue;
        for (int z = 1; z <= ai; z++)
        {
            int y = ai + (ai / z);
            if (y <= max_b)
                dp_b[y] = min(dp_b[y], dp_b[ai] + 1);
        }
    }

    int res = 0;
    for (int i = 0; i < n; i++)
    {
        int cost = dp_b[b[i]];
        if (!cost)
        {
            res += c[i];
            continue;
        }
        for (int s = k; s >= cost; s--)
        {
            if (dp[s - cost] != -1)
                dp[s] = max(dp[s], c[i] + dp[s - cost]);
        }
    }

    // for (auto &i : b)
    //     cout << dp_b[i] << ' ';
    // for (auto &i : dp)
    //     cout << i << ' ';
    cout << *max_element(dp.begin(), dp.end()) + res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
