// D. Палиндромный префикс
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест512 мегабайт

// Решите эту задачу с использованием z-функции строки. Существует много способов
// решить её, но в качестве упражнения на использование z-функции попробуйте
// придумать и реализовать именно такое решение.

// Задана строка s. Найдите длину её наидлиннейшего префикса, который является палиндромом.

// Входные данные
// Входные данные состоят из строки s, которая содержит только строчные буквы
// латинского алфавита. Длина строки не превосходит 4·10^5.

// Выходные данные
// Выведите единственное число — длину наиболее длинного префикса s, который является
// палиндромом.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// aaab
// ======================================================================
// Выходные данные
// ======================================================================
// 3

// ======================================================================
// Входные данные
// ======================================================================
// abab // 0 0 2 0
// ======================================================================
// Выходные данные
// ======================================================================
// 3
// ======================================================================

#include <bits/stdc++.h> // Подключает сразу все библиотеки C++
using namespace std;

#define int long long // Защита от переполнения int (из-за этого часто горят баллы)

std::vector<int> zfoo(std::string s)
{
    int n = s.length(); // длина строки всей
    std::vector<int> z(n, 0);
    int l = 0, r = 0;
    for (int i = 1; i < n; i++)
    {
        if (i <= r)
        {
            z[i] = min(r - i + 1, z[i - l]);
        }

        while (i + z[i] < n && s[z[i] + i] == s[z[i]])
        {
            ++z[i];
        }
        if (r < z[i] + i - 1)
        {
            l = i;
            r = z[i] + i - 1;
        }
    }
    return z;
}

int32_t main()
{
    // Включаем супер-быстрый ввод-вывод для C++
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    string s, sc;
    cin >> s;
    int n = s.length();
    sc = s;
    reverse(sc.begin(), sc.end());
    s.push_back('&');
    s.append(sc);

    vector<int> res = zfoo(s);

    for (int i = n + 1; i < s.length(); i++)
    {
        if (res[i] == s.length() - i)
        {
            cout << res[i];
            break;
        }
    }

    return 0;
}
