// E. Уравнение
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Найдите такое число x, что x^2 + sqrt(x) = c.

// Входные данные
// В единственной строке содержится вещественное число C (1.0 ≤ c ≤ 10^10).

// Выходные данные
// Выведите одно число — искомый x. Ответ будет признан верным, если относительная
// или абсолютная погрешность не более 10^{-6}.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 2.0
// ======================================================================
// Выходные данные
// ======================================================================
// 1.0

// ======================================================================
// Входные данные
// ======================================================================
// 15.6
// ======================================================================
// Выходные данные
// ======================================================================
// 3.698232168829691
// ======================================================================

#include <bits/stdc++.h> // Подключает сразу все библиотеки C++
using namespace std;

void solve()
{
    double c, l = 0, r;
    cin >> c;
    r = c;

    for (int i = 0; i < 100; i++)
    {
        double mid = (l + r) * .5;
        if (pow(mid, 2) + sqrt(mid) >= c)
            r = mid;
        else
            l = mid;
    }
    cout << setprecision(20) << r;
}

int32_t main()
{
    // Включаем супер-быстрый ввод-вывод для C++
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
