// G. Студенческие советы
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Задано число k. Каждый студенческий совет должен состоять из k студентов.
// Важное правило — каждый совет состоит из студентов из разных групп. То есть
// никакие два студента из одной группы не могут оказаться в одном совете.

// Конечно, каждый студент должен входить не более чем в один совет (возможно,
// что некоторые студенты не входят ни в один).

// Задан массив a[1..n], где a[i] — количество студентов в i-й группе.
// Какое максимальное число советов может быть образовано?

// Входные данные
// В первой строке задано k (2 ≤ k ≤ 20).
// Во второй строке задано n (k ≤ n ≤ 50).
// Затем заданы элементы a[1], a[2], …, a[n] (1 ≤ a[i] ≤ 10^9).

// Выходные данные
// Выведите искомое значение.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 3
// 5
// 4
// 4
// 4
// 4
// 4
// ======================================================================
// Выходные данные
// ======================================================================
// 6

// ======================================================================
// Входные данные
// ======================================================================
// 4
// 6
// 1
// 2
// 3
// 4
// 5
// 6
// ======================================================================
// Выходные данные
// ======================================================================
// 5
// ======================================================================

#include <bits/stdc++.h> // Подключает сразу все библиотеки C++
using namespace std;

#define int long long // Защита от переполнения int (из-за этого часто горят баллы)

bool check(int m, vector<int> &a, int k)
{
    int target = m * k, s = 0;
    for (int x : a)
        s += min(x, m);
    return target <= s;
}

void solve()
{
    int k, n, l = 0, r = 1e14;
    cin >> k >> n;
    vector<int> a(n, 0);
    for (size_t i = 0; i < n; i++)
        cin >> a[i];

    while (r > l + 1)
    {
        int mid = (l + r) / 2;
        if (check(mid, a, k))
            l = mid;
        else
            r = mid;
    }
    cout << l;
}

int32_t main()
{
    // Включаем супер-быстрый ввод-вывод для C++
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
