// B. Дождь
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мебибайт

// В волшебном королевстве Эквилибрия после могущественного заклинания случилась
// непредвиденная буря, которая затопила земли между Великой библиотекой Эквилибрии
// и торговым кварталом. Ваш герой, юный маг, должен пройти от библиотеки к рынку,
// чтобы доставить важные свитки с заклинаниями. Затопленные поля королевства
// представляют собой сетку размером n × m, и каждая ячейка сетки содержит воду
// определённой глубины. Маг может перемещаться только вправо, влево и вниз по сетке
// ((row, col+1), (row, col−1) и (row+1, col)), начиная своё путешествие из верхнего
// левого угла ((1, 1), библиотека) и заканчивая в нижнем правом ((n, m), рынок).
// Ваша задача — найти путь, при проходе по которому максимальная глубина воды будет
// минимальной, чтобы ваш герой оставался как можно более сухим.

// Входные данные
// В первой строке даны два целых числа n и m (2 ≤ n, m ≤ 500) — размеры Эквилибрии.
// В следующих n строках даны по m целых чисел d_{i,j} (0 ≤ d_{i,j} ≤ 10^9, d_{1,1} = d_{n,m} = 0),
// обозначающих глубину воды в каждой ячейке.

// Выходные данные
// Выведите максимальную глубину воды на найденном пути.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 3 3
// 0 1 9
// 9 1 9
// 9 1 0
// ======================================================================
// Выходные данные
// ======================================================================
// 1

// ======================================================================
// Входные данные
// ======================================================================
// 5 3
// 0 1 1
// 9 9 2
// 1 1 1
// 2 9 9
// 1 1 0
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, m;
    cin >> n >> m;
    vector<vector<int>> a(n, vector<int>(m)), dp(n, vector<int>(m, 0));
    for (auto &i : a)
        for (auto &j : i)
            cin >> j;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
