// C. Выбор пар
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест512 мегабайт

// Заданы n пар положительных целых чисел (a1, b1), (a2, b2), …, (an, bn).
// Выберите k (1 ≤ k ≤ n) из них i1, i2, …, ik, чтобы отношение

// (a_{i1} + a_{i2} + … + a_{ik}) / (b_{i1} + b_{i2} + … + b_{ik})

// было максимальным возможным.

// Входные данные
// В первой строке записаны целые числа n и k (1 ≤ k ≤ n ≤ 10^5). Следующие n строк
// содержат пары целых чисел a_i, b_i (1 ≤ a_i, b_i ≤ 10^5).

// Выходные данные
// Выведите искомое максимальное отношение. Ответ будет считаться верным, если
// относительная или абсолютная погрешность не превышает 10^{-6}.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 3 2
// 10 3
// 9 5
// 7 4
// ======================================================================
// Выходные данные
// ======================================================================
// 2.4285714286

// ======================================================================
// Входные данные
// ======================================================================
// 8 3
// 4 2
// 4 2
// 2 2
// 1 5
// 5 3
// 3 5
// 2 2
// 5 3
// ======================================================================
// Выходные данные
// ======================================================================
// 1.8571428571
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long
bool check(double mid, vector<double> &a, vector<double> &b, int k, int n)
{
    vector<double> p(n, 0);
    for (int i = 0; i < n; i++)
        p[i] = (a[i] - mid * b[i]);

    sort(p.rbegin(), p.rend());

    double sum = 0;

    for (int i = 0; i < k; i++)
        sum += p[i];

    return sum >= 0;
}

void solve()
{
    int n, k;
    cin >> n >> k;
    vector<double> a(n), b(n);
    for (int i = 0; i < n; i++)
        cin >> a[i] >> b[i];

    double l = 0, r = 1e6;
    for (int i = 0; i < 100; i++)
    {
        double mid = (l + r) * 0.5;
        if (check(mid, a, b, k, n))
            l = mid;
        else
            r = mid;
    }
    cout << setprecision(20) << l;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
