// B. Лестница
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Перед вами находится лестница, состоящая из N ступенек. За один шаг вы можете
// подняться либо на одну, либо на две ступеньки вверх.

// Сколько существует различных способов подняться по этой лестнице? Два способа
// считаются различными, если они состоят из разного количества шагов или какой-то
// из шагов отличается.

// К примеру, если лестница состоит из 3 ступенек, то существует 3 способа подняться
// наверх:

// - Подняться на одну ступеньку вверх, снова на одну, и снова на одну.
// - Подняться на две ступеньки вверх за один шаг, потом на одну.
// - Подняться на одну ступеньку вверх, потом на две ступеньки вверх за один шаг.

// Входные данные
// Дано одно число – N (1 ≤ N ≤ 45) — количество ступенек в лестнице.

// Выходные данные
// Выведите одно число – количество различных способов подняться по ней.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 1
// ======================================================================
// Выходные данные
// ======================================================================
// 1

// ======================================================================
// Входные данные
// ======================================================================
// 2
// ======================================================================
// Выходные данные
// ======================================================================
// 2

// ======================================================================
// Входные данные
// ======================================================================
// 3
// ======================================================================
// Выходные данные
// ======================================================================
// 3

// ======================================================================
// Входные данные
// ======================================================================
// 4
// ======================================================================
// Выходные данные
// ======================================================================
// 5
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> dp(n + 1);
    dp[0] = 1;
    dp[1] = 1;
    for (int i = 2; i <= n; i++)
        dp[i] = dp[i - 2] + dp[i - 1];
    cout << dp[n];
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
