// C. Рюкзак
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Найдите максимальный вес золота, который можно унести в рюкзаке вместимостью S,
// если есть N золотых слитков с заданными весами.

// Входные данные
// В первой строке входного файла заданы два числа – S и N (1 ≤ S ≤ 10^4, 1 ≤ N ≤ 300).

// Далее следует N чисел w_i, разделённых пробелами – веса слитков (1 ≤ w_i ≤ 10^5).

// Выходные данные
// Выведите искомый максимальный вес слитков, которые уместятся в рюкзаке.
// Брать слитки можно только целиком.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 10 4
// 3 4 5 9
// ======================================================================
// Выходные данные
// ======================================================================
// 9

// ======================================================================
// Входные данные
// ======================================================================
// 10 3
// 1 4 8
// ======================================================================
// Выходные данные
// ======================================================================
// 9

// ======================================================================
// Входные данные
// ======================================================================
// 20 4
// 5 7 12 18
// ======================================================================
// Выходные данные
// ======================================================================
// 19
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int s, n;
    cin >> s >> n;
    vector<int> a(n), dp(s + 1, 0);
    for (auto &i : a)
        cin >> i;

    dp[0] = 1;
    for (int i = 0; i < n; i++)
    {
        int cur_gold_w = a[i];
        for (int j = s; j >= cur_gold_w; --j)
        {
            if (dp[j - cur_gold_w])
                dp[j] = 1;
        }
    }
    for (int i = s; i >= 0; --i)
        if (dp[i])
        {
            cout << i;
            return;
        }

    // for (auto &i : dp)
    //     cout << i << ' ';
}

int32_t
main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}