// D. Подмассив с максимальной суммой
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Дан массив A[1..N], состоящий из целых чисел. Найдите его непрерывный подмассив A[L..R],
// сумма чисел на котором максимальна.

// Входные данные
// Первая строка содержит число N (1 ≤ N ≤ 10^5) – размер массива.

// Вторая строка содержит N чисел – элементы массива (−10^4 ≤ A_i ≤ 10^4).

// Выходные данные
// Выведите два числа L и R – номер начального и конечного элемента искомого подмассива
// (элементы в данной задаче нумеруются с единицы).

// Если существует несколько возможных ответов, выведите любой из них.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 3
// 1 2 3
// ======================================================================
// Выходные данные
// ======================================================================
// 1 3

// ======================================================================
// Входные данные
// ======================================================================
// 4
// 1 2 -3 4
// ======================================================================
// Выходные данные
// ======================================================================
// 4 4

// ======================================================================
// Входные данные
// ======================================================================
// 4
// 1 2 -1 2
// ======================================================================
// Выходные данные
// ======================================================================
// 1 4

// ======================================================================
// Входные данные
// ======================================================================
// 1
// -1
// ======================================================================
// Выходные данные
// ======================================================================
// 1 1
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n), pref(n + 1, 0);
    for (int i = 1; i <= n; i++)
    {
        cin >> a[i - 1];
        pref[i] = pref[i - 1] + a[i - 1];
    }
    int res = -1e18, min_p_l = 0, res_l = 0, res_r = 1;
    for (int r = 1; r <= n; r++)
    {
        int c_s = pref[r] - pref[min_p_l];
        if (c_s > res)
        {
            res = c_s;
            res_l = min_p_l;
            res_r = r;
        }
        if (pref[min_p_l] >= pref[r])
            min_p_l = r;
    }

    // for (auto i : pref)
    //     cout << i << ' ';
    // cout << '\n';
    cout << res_l + 1 << ' ' << res_r;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
