// E. Путь с максимальной суммой
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Дана матрица из N строк и M столбцов, состоящая из N·M целых чисел.

// Изначально указатель находится в левом верхнем углу матрицы, за один шаг его можно
// переместить вниз (если он находится не в последней строке) или вправо (если он
// находится не в правом столбце).

// Переместите указатель из левого верхнего в правый нижний угол так, чтобы сумма чисел
// на пути была максимально возможной среди таких путей.

// Входные данные
// В первой строке заданы два числа N (1 ≤ N ≤ 10^3) и M (1 ≤ M ≤ 10^3).

// Далее следует N строк вида A_{i,1} A_{i,2} ... A_{i,M}, где −10^4 ≤ A_{i,j} ≤ 10^4.
// A_{i,j} – число, находящееся в j-м столбце i-й строки.

// Выходные данные
// В первой строке выведите S – максимальную сумму чисел на пути из (1,1) в (N,M).

// Во второй строке выведите получившийся путь в виде строки, состоящей из N + M − 2
// символов. Символ "D" соответствует перемещению указателя на строку вниз, символ "R"
// соответствует перемещению указателя вправо.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 1 1
// 1
// ======================================================================
// Выходные данные
// ======================================================================
// 1

// ======================================================================
// Входные данные
// ======================================================================
// 2 2
// 5 4
// 6 1
// ======================================================================
// Выходные данные
// ======================================================================
// 12
// DR

// ======================================================================
// Входные данные
// ======================================================================
// 3 3
// 1 2 3
// -10 5 4
// 7 8 9
// ======================================================================
// Выходные данные
// ======================================================================
// 25
// RDDR

// ======================================================================
// Входные данные
// ======================================================================
// 3 3
// -1 -2 -3
// -4 -5 -6
// -7 -8 -9
// ======================================================================
// Выходные данные
// ======================================================================
// -21
// RRDD
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    const int INF = 1e18;
    int n, m;
    cin >> n >> m;
    vector<vector<int>> a(n, vector<int>(m)), dp(n, vector<int>(m, {-INF}));
    for (auto &i : a)
        for (auto &j : i)
            cin >> j;

    dp[0][0] = a[0][0];
    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < m; j++)
        {
            if (i == 0 && j == 0)
                continue;
            if (j > 0 && dp[i][j - 1] + a[i][j] > dp[i][j])
                dp[i][j] = dp[i][j - 1] + a[i][j];
            if (i > 0 && dp[i - 1][j] + a[i][j] > dp[i][j])
                dp[i][j] = dp[i - 1][j] + a[i][j];
        }
    }

    // for (auto &i : dp)
    // {
    //     for (auto &j : i)
    //         cout << j << ' ';
    //     cout << '\n';
    // }
    int i = n - 1, r = m - 1;
    stack<char> res;
    while (i > 0 || r > 0)
    {
        if (i > 0 && r > 0)
        {
            if (dp[i - 1][r] > dp[i][r - 1])
            {
                res.push('D');
                i--;
            }
            else
            {
                res.push('R');
                r--;
            }
        }
        else if (i > 0)
        {
            res.push('D');
            i--;
        }
        else if (r > 0)
        {
            res.push('R');
            r--;
        }
    }

    cout << dp[n - 1][m - 1] << '\n';
    while (!res.empty())
    {
        char v = res.top();
        res.pop();
        cout << v;
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
