// F. Квазидвоичная сумма
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Число назовём квазидвоичным, если в его десятичной записи присутствуют только
// цифры 0 или 1. Например, числа 0, 1, 101, 110011 — квазидвоичные, а числа 2, 12, 900 — нет.

// Вам дано положительное целое число n. Представьте его в виде суммы минимального
// количества квазидвоичных чисел.

// Входные данные
// В первой строке записано единственное целое число n (1 ≤ n ≤ 10^6).

// Выходные данные
// В первой строке выведите одно целое число k — минимальное количество чисел
// в представлении числа n в виде суммы квазидвоичных.

// Во второй строке выведите k чисел — элементы суммы. Все эти числа должны быть
// квазидвоичными согласно определению выше, их сумма должна равняться n. Ведущие нули
// в числах выводить не нужно. Порядок чисел не имеет значения. Если существует
// несколько возможных представлений, разрешается вывести любое.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 9
// ======================================================================
// Выходные данные
// ======================================================================
// 9
// 1 1 1 1 1 1 1 1 1

// ======================================================================
// Входные данные
// ======================================================================
// 32
// ======================================================================
// Выходные данные
// ======================================================================
// 3
// 10 11 11
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    list<int> res;
    while (n > 0)
    {
        int temp = n, s = 0, power = 1;
        while (temp > 0)
        {
            int last = temp % 10;
            if (last > 0)
                s += power;
            power *= 10;
            temp /= 10;
        }
        res.push_back(s);
        n -= s;
    }
    cout << res.size() << '\n';
    for (auto &i : res)
        cout << i << ' ';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
