// A. Рамбу нужна рука
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Мистер Рамб обращается к протезисту, потому что его руки онемели. Протезист может
// собрать замену, но пронумерованные детали перепутаны. По всей видимости, даже руку
// помощи ещё нужно собрать.

// Формально, метки на деталях образуют перестановку* p длины n. Мистер Рамб может
// запрограммировать машину выполнить следующую операцию ровно один раз:

// - выбрать целое число m (1 ≤ m ≤ n) и индексы i1 < i2 < … < im;
// - развернуть элементы p на выбранных индексах. Более формально, для каждого j от 1
//   до m элемент с индексом ij перемещается на индекс i_{m−j+1}. Все остальные элементы
//   остаются неизменными.

// Выбранные индексы не обязаны идти подряд. Например, пусть p = [1, 6, 3, 4, 5, 2].
// Если выбрать индексы 2, 4 и 6, выделенные красным элементы развернутся, и p станет
// равна [1, 2, 3, 4, 5, 6].

// Определите, может ли мистер Рамб отсортировать p по возрастанию.

// * Перестановкой длины n является массив, состоящий из n различных целых чисел от 1
// до n в произвольном порядке. Например, [2, 3, 1, 5, 4] — перестановка, но [1, 2, 2]
// не перестановка (2 встречается в массиве дважды) и [1, 3, 4] тоже не перестановка
// (n = 3, но в массиве встречается 4).

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 500) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// Первая строка каждого набора входных данных содержит одно целое число n (1 ≤ n ≤ 100).

// Вторая строка содержит перестановку p1, p2, …, pn целых чисел от 1 до n.

// Выходные данные
// Для каждого набора входных данных выведите YES, если можно отсортировать p
// по возрастанию, выполнив ровно одну операцию. В противном случае выведите NO.

// Ответ можно выводить в любом регистре (верхнем или нижнем). Например, строки yEs,
// yes, Yes и YES будут распознаны как положительные ответы.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 1
// 1
// 4
// 4 2 3 1
// 4
// 3 4 1 2
// 5
// 2 1 3 5 4
// 6
// 1 6 3 4 5 2
// ======================================================================
// Выходные данные
// ======================================================================
// YES
// YES
// NO
// NO
// YES
// ======================================================================

// Примечание
// В первом наборе входных данных выберите единственный индекс. Разворот одного элемента
// не меняет перестановку, поэтому требование выполнить ровно одну операцию соблюдается.

// Во втором наборе входных данных выберите индексы 1 и 4. Получится перестановка
// [1, 2, 3, 4].

// В пятом наборе входных данных выберите индексы 2, 4 и 6. Обратите внимание, что
// выбранные индексы не идут подряд.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n + 1, 0), bad;
    for (int i = 1; i <= n; i++)
    {
        cin >> a[i];
        if (a[i] != i)
            bad.push_back(i);
    }

    int l = 0, r = bad.size() - 1;
    while (r >= l)
    {
        swap(a[bad[l]], a[bad[r]]);
        l++;
        r--;
    }

    cout << (is_sorted(a.begin(), a.end()) ? "YES\n" : "NO\n");
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}