// B. Ферма пилюль Найфа
// ограничение по времени на тест1.5 секунд
// ограничение по памяти на тест256 мегабайт

// Мистер Найф подготовил n абсурдных постов для канала в одном мессенджере.
// Он хочет собрать как можно больше реакций с эмодзи пилюли под постами.
// К сожалению, бот использует излишне сложное правило подсчёта счёта.

// У заготовок есть рейтинги абсурдности a1, a2, …, a_n, которые могут быть
// отрицательными. Мистер Найф должен опубликовать ровно m заготовок в их исходном
// порядке. Их рейтинги образуют подпоследовательность* b массива a длины m.

// Его счёт пилюль изначально равен 0. Когда он публикует i-ю выбранную заготовку,
// бот изменяет его счёт на i·(b_i − b_{i−1}), где b_0 = 0. Отрицательное изменение
// уменьшает счёт, и счёт может становиться отрицательным. Таким образом, итоговый
// счёт пилюль равен

//     ∑_{i=1}^{m} i·(b_i − b_{i−1}).

// Какой максимальный счёт пилюль может получить мистер Найф, выбирая заготовки
// для публикации?

// * Последовательность a является подпоследовательностью b, если a может быть
// получена из b удалением нескольких (возможно, ни одного или всех) элементов
// на произвольных позициях.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 10^4) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// Первая строка каждого набора входных данных содержит два целых числа n и m
// (1 ≤ m ≤ n ≤ 2·10^5) — количество заготовок и количество постов, которые должен
// опубликовать мистер Найф.

// Вторая строка содержит n целых чисел a1, a2, …, a_n (−10^7 ≤ a_i ≤ 10^7) —
// рейтинги абсурдности заготовок.

// Гарантируется, что сумма n по всем наборам входных данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — максимальный счёт
// пилюль, который может получить мистер Найф, опубликовав ровно m заготовок
// в их исходном порядке.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 5 3
// 0 8 1 7 3
// 4 3
// 0 -4 10 -2
// 4 2
// 0 5 -2 4
// 6 3
// 0 9 8 7 6 5
// 1 1
// 7
// 3 2
// 5 -100 4
// ======================================================================
// Выходные данные
// ======================================================================
// 20
// 34
// 10
// 15
// 7
// 108
// ======================================================================

// Примечание
// В первом наборе входных данных мистер Найф может опубликовать заготовки
// с рейтингами [0, 1, 7]. Его итоговый счёт пилюль равен
// 1·(0 − 0) + 2·(1 − 0) + 3·(7 − 1) = 20.

// Во втором наборе входных данных он может опубликовать заготовки с рейтингами
// [0, −4, 10]. Второй пост уменьшает счёт, но третий пост с лихвой это компенсирует.
// Его итоговый счёт пилюль равен
// 1·(0 − 0) + 2·(−4 − 0) + 3·(10 − (−4)) = 34.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, m;
    cin >> n >> m;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;

    if (m == 1)
    {
        cout << *max_element(a.begin(), a.end()) << '\n';
        return;
    }

    priority_queue<int> mx;
    int cur_s = 0, total = -1e18;

    for (int i = 0; i < n; i++)
    {
        if (mx.size() + 1 == m)
            total = max(total, a[i] * m - cur_s);
        mx.push(a[i]);
        cur_s += a[i];

        if (mx.size() >= m)
        {
            cur_s -= mx.top();
            mx.pop();
        }
    }
    cout << total << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
