// C. Династия фигуристов Мадамант
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Мадам Мадамант ждёт ребёнка и уже планирует династию фигуристов, в которой каждый
// родитель катается лучше своих детей.

// Формально, у Мадамант есть n пронумерованных фигуристов. У фигуриста v есть
// целочисленный рейтинг a_v, и все рейтинги попарно различны. Возможная династия
// представляется корневым деревом на этих фигуристах.

// Пусть r — корень дерева. Для каждого фигуриста v ≠ r пусть p_v — родитель v.
// Династия называется корректной, если a_v < a_{p_v} для каждого v ≠ r.

// Счёт корректной династии равен

//     ∑_{v ≠ r} (a_{p_v} − a_v).

// Две династии различны, если различаются их корни или родитель хотя бы одного
// фигуриста.

// Найдите сумму счетов всех корректных династий, которые может образовать Мадамант,
// по модулю 998244353.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 10^4) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// Первая строка каждого набора входных данных содержит одно целое число n
// (1 ≤ n ≤ 2·10^5) — количество фигуристов.

// Вторая строка содержит n целых чисел a1, a2, …, a_n (1 ≤ a_i ≤ 10^9) — их рейтинги.

// Гарантируется, что все a_i попарно различны.

// Гарантируется, что сумма n по всем наборам входных данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — сумму счетов всех
// корректных династий по модулю 998244353.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 1
// 10
// 3
// 1 2 3
// 4
// 4 1 3 2
// 2
// 1 1000000000
// 5
// 2 7 1 10 4
// ======================================================================
// Выходные данные
// ======================================================================
// 0
// 5
// 27
// 1755646
// 414
// ======================================================================

// Примечание
// Во втором наборе входных данных фигурист с рейтингом 3 должен быть корнем.
// Родителем фигуриста с рейтингом 2 должен быть фигурист с рейтингом 3, а фигурист
// с рейтингом 1 может выбрать своим родителем любого из двух других фигуристов.
// Счета двух корректных династий равны 2 и 3, поэтому ответ равен 5.

// В четвёртом наборе входных данных существует лишь одна корректная династия.
// Её счёт равен 10^9 − 1 = 999999999, а остаток от деления этого числа на 998244353
// равен 1755646.

#include <bits/stdc++.h>
using namespace std;

#define int long long

const int MOD = 998244353;

int power(int base, int step)
{
    int res = 1;
    base %= MOD;
    while (step > 0)
    {
        if (step % 2 == 1)
            res = (res * base) % MOD;
        base = (base * base) % MOD;
        step /= 2;
    }
    return res;
}

int fermamalaya(int x) { return power(x, MOD - 2); }

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;

    sort(a.rbegin(), a.rend());

    if (n <= 1)
    {
        cout << "0\n";
        return;
    }

    int nfacto1 = 1;
    for (int i = 2; i <= n - 1; i++)
        nfacto1 = (nfacto1 * i) % MOD;

    int prfs = a[0] % MOD, res = 0;
    for (int i = 1; i < n; i++)
    {
        int t = (((nfacto1 * fermamalaya(i)) % MOD) * prfs) % MOD;
        res = (res + ((t - ((nfacto1 * (a[i] % MOD)) % MOD) + MOD) % MOD)) % MOD;
        prfs = (prfs + a[i]) % MOD;
    }
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
