// A. Система неперескающихся множеств
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Реализуйте систему непересекающихся множеств. На структуре данных нужно выполнить
// набор запросов двух типов:

// - union u v — объединить два множества, содержащие u и v, соответственно;
// - get u v — проверить, лежат ли элементы u и v в одном множестве.

// Входные данные
// Первая строка входного файла содержит два числа n и m (1 ≤ n, m ≤ 10^5) —
// число элементов и число запросов. Далее идут m строк запросов, по одному на строке.
// Для запросов union строка выглядит как union u v (1 ≤ u, v ≤ n).
// Для запросов get строка выглядит как get u v (1 ≤ u, v ≤ n).

// Выходные данные
// Выведите результат каждой операции get по одной на строке в соответствующем порядке:
// «YES», если элементы лежат в одном множестве, и «NO», в противном случае.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4 4
// union 1 2
// union 1 3
// get 1 4
// get 2 3
// ======================================================================
// Выходные данные
// ======================================================================
// NO
// YES
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

struct DSU
{
    vector<int> p;

    DSU(int n)
    {
        p.resize(n);
        for (int i = 0; i < n; i++)
            p[i] = i;
    }

    int get(int x) { return p[x] = (x == p[x] ? x : get(p[x])); }

    void unite(int a, int b)
    {
        int pa = get(a), pb = get(b);
        p[pa] = pb;
    }
};

void solve()
{
    int n, m;
    cin >> n >> m;
    DSU d(n);
    while (m--)
    {
        string cmd;
        int a, b;
        cin >> cmd >> a >> b;
        a--;
        b--;
        if (cmd == "union")
            d.unite(a, b);
        else
            cout << (d.get(a) == d.get(b) ? "YES\n" : "NO\n");
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
