// B. Система непересекающихся множеств 2
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Реализуйте систему непересекающихся множеств. На структуре данных нужно выполнить
// набор запросов двух типов:

// - union u v — объединить два множества, содержащие u и v, соответственно;
// - get v — найти множество, которому принадлежит v, найти минимальный и максимальный
//   элемент, а также число элементов в множестве.

// Входные данные
// Первая строка входного файла содержит два числа n и m (1 ≤ n, m ≤ 3·10^5) —
// число элементов и число запросов. Далее идут m строк запросов, по одному на строке.
// Для запросов union строка выглядит как union u v (1 ≤ u, v ≤ n).
// Для запросов get строка выглядит как get v (1 ≤ v ≤ n).

// Выходные данные
// Выведите результат каждой операции get по одной на строке в соответствующем порядке.
// Каждый результат состоит из трёх чисел: минимальный элемент, максимальный элемент
// и число элементов.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5 11
// union 1 2
// get 3
// get 2
// union 2 3
// get 2
// union 1 3
// get 5
// union 4 5
// get 5
// union 4 1
// get 5
// ======================================================================
// Выходные данные
// ======================================================================
// 3 3 1
// 1 2 2
// 1 3 3
// 5 5 1
// 4 5 2
// 1 5 5
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

struct object
{
    int mn, mx, count;

    void update(object a)
    {
        mn = min(mn, a.mn);
        mx = max(mx, a.mx);
        count += a.count;
    }
};

struct DSU
{
    vector<object> rs;
    vector<int> p;

    DSU(int n)
    {
        p.resize(n);
        rs.resize(n);
        for (int i = 0; i < n; i++)
        {
            p[i] = i;
            rs[i] = {i + 1, i + 1, 1};
        }
    }

    int get(int x) { return p[x] = (x == p[x] ? x : get(p[x])); }

    void unite(int a, int b)
    {
        int pa = get(a), pb = get(b);
        if (pa != pb)
        {
            p[pa] = pb;
            rs[pb].update(rs[pa]);
        }
    }
};

void solve()
{
    int n, m;
    cin >> n >> m;
    DSU d(n);
    while (m--)
    {
        string cmd;
        cin >> cmd;
        if (cmd == "union")
        {
            int a, b;
            cin >> a >> b;
            a--;
            b--;
            d.unite(a, b);
        }
        else
        {
            int a;
            cin >> a;
            a--;
            auto res = d.rs[d.get(a)];
            cout << res.mn << ' ' << res.mx << ' ' << res.count << '\n';
        }
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
