// C. Подсчет опыта
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест64 мегабайта

// В очередной онлайн игре игроки, как обычно, сражаются с монстрами и набирают опыт.
// Для того чтобы сражаться с монстрами, они объединяются в кланы. После победы над
// монстром всем участникам клана, победившего его, добавляется одинаковое число единиц
// опыта. Особенностью этой игры является то, что кланы никогда не распадаются и из клана
// нельзя выйти. Единственная доступная операция — объединение двух кланов в один.

// Поскольку игроков стало уже много, вам поручили написать систему учёта текущего опыта
// игроков.

// Входные данные
// В первой строке входного файла содержатся числа n и m (1 ≤ n, m ≤ 2·10^5) —
// число зарегистрированных игроков и число запросов.

// В следующих m строках содержатся описания запросов. Запросы бывают трёх типов:

// - join X Y — объединить кланы, в которые входят игроки X и Y (если они уже в одном
//   клане, то ничего не меняется).
// - add X V — добавить V единиц опыта всем участникам клана, в который входит игрок X
//   (1 ≤ V ≤ 100).
// - get X — вывести текущий опыт игрока X.

// Изначально у всех игроков 0 опыта и каждый из них состоит в клане, состоящем из него
// одного.

// Выходные данные
// Для каждого запроса get X выведите текущий опыт игрока X на отдельной строке.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 3 6
// add 1 100
// join 1 3
// add 1 50
// get 1
// get 2
// get 3
// ======================================================================
// Выходные данные
// ======================================================================
// 150
// 0
// 50
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

struct DSU
{
    vector<int> parents, points, r;

    DSU(int n)
    {
        parents.resize(n);
        points.assign(n, 0);
        r.assign(n, 0);
        for (int i = 0; i < n; i++)
            parents[i] = i;
    }

    int get(int x)
    {
        while (x != parents[x])
            x = parents[x];
        return x;
    }

    void add(int x, int val)
    {
        int px = get(x);
        points[px] += val;
    }

    int getexp(int x)
    {
        int total = 0;
        while (1)
        {
            total += points[x];
            if (x == parents[x])
                break;
            x = parents[x];
        }
        return total;
    }

    void united(int a, int b)
    {
        int pa = get(a), pb = get(b);
        if (pa != pb)
        {
            if (r[pa] > r[pb])
                swap(pa, pb);
            parents[pa] = pb;
            points[pa] -= points[pb];
            if (r[pa] == r[pb])
                r[pb]++;
        }
    }
};

void solve()
{
    int n, m;
    cin >> n >> m;
    DSU d(n);
    while (m--)
    {
        string c;
        cin >> c;
        if (c == "add")
        {
            int x, v;
            cin >> x >> v;
            x--;
            d.add(x, v);
        }
        else if (c == "join")
        {
            int x, y;
            cin >> x >> y;
            x--;
            y--;
            d.united(x, y);
        }
        else
        {
            int x;
            cin >> x;
            x--;
            cout << d.getexp(x) << '\n';
        }
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
