// D. Разрезание графа
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Дан неориентированный граф. Над ним в заданном порядке производят операции следующих
// двух типов:

// - cut u v — удалить из графа ребро u - v;
// - ask u v — проверить, лежат ли две вершины u и v в одной компоненте связности.

// Известно, что после выполнения всех операций типа cut рёбер в графе не осталось.
// Найдите результат выполнения каждой из операций типа ask.

// Входные данные
// Первая строка входного файла содержит три целых числа, разделённых пробелами n, m и k
// (1 ≤ n ≤ 50 000, 0 ≤ m ≤ 100 000, m ≤ k ≤ 150 000) — количество вершин графа,
// количество рёбер и количество операций соответственно.

// Следующие m строк задают рёбра графа; i-я из этих строк содержит два числа u_i и v_i
// (1 ≤ u_i, v_i ≤ n), разделённые пробелами — номера концов i-го ребра. Вершины
// нумеруются с единицы; граф не содержит петель и кратных рёбер.

// Далее следуют k строк, описывающих операции. Операция типа cut задаётся строкой
// «cut u v» (1 ≤ u, v ≤ n), которая означает, что из графа удаляют ребро между
// вершинами u и v. Операция типа ask задаётся строкой «ask u v» (1 ≤ u, v ≤ n),
// которая означает, что необходимо узнать, лежат ли в данный момент вершины u и v
// в одной компоненте связности. Гарантируется, что каждое ребро графа встретится
// в операциях типа cut ровно один раз.

// Выходные данные
// Для каждой операции ask во входном файле выведите на отдельной строке слово «YES»,
// если две указанные вершины лежат в одной компоненте связности, и «NO» в противном
// случае. Порядок ответов должен соответствовать порядку операций ask во входном файле.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 3 3 7
// 1 2
// 2 3
// 3 1
// ask 3 3
// cut 1 2
// ask 1 2
// cut 1 3
// ask 2 1
// cut 2 3
// ask 3 1
// ======================================================================
// Выходные данные
// ======================================================================
// YES
// YES
// NO
// NO
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long
#define abe(a) a.begin(), a.end()

struct DSU
{
    vector<int> p, s;
    DSU(int n)
    {
        p.resize(n);
        s.assign(n, 1);
        for (int i = 0; i < n; i++)
            p[i] = i;
    }

    int get(int a) { return p[a] = (a == p[a] ? a : get(p[a])); }

    void united(int a, int b)
    {
        a = get(a), b = get(b);
        if (a != b)
        {
            if (s[a] > s[b])
                swap(a, b);
            p[a] = b;
            s[b] += s[a];
        }
    }
};

void solve()
{
    int n, m, k;
    cin >> n >> m >> k;
    DSU d(n);
    for (int i = 0; i < m; i++)
    {
        int x, y;
        cin >> x >> y;
    }
    vector<pair<string, pair<int, int>>> a(k);
    for (auto &q : a)
    {
        cin >> q.first >> q.second.first >> q.second.second;
        q.second.first--;
        q.second.second--;
    }
    reverse(abe(a));
    vector<string> res;
    for (auto &q : a)
    {
        if (q.first == "ask")
            res.push_back(d.get(q.second.first) == d.get(q.second.second) ? "YES\n" : "NO\n");
        else
            d.united(q.second.first, q.second.second);
    }
    for (auto i = res.rbegin(); i != res.rend(); i++)
        cout << *i;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
