// E. Обезьяны
// ограничение по времени на тест4 seconds
// ограничение по памяти на тест256 megabytes

// На высоком-высоком дереве висят n обезьян. Обезьяны пронумерованы от 1 до n.
// Первая из них (вожак) держится хвостом за прочную ветку. Каждая обезьяна может
// использовать свои руки, чтобы держаться за хвост (или держать за хвост) другую
// обезьяну. Известно, что в настоящий момент все обезьяны держатся прямо или
// опосредованно за вожака и, таким образом, не падают вниз. Рука обезьяны может
// держать не более одного хвоста (держаться не более чем за один хвост), но за хвост
// обезьяны может держаться произвольное число рук.

// Каждую секунду, начиная с нулевой, одна из обезьян разжимает одну из своих рук,
// что приводит к изменению подвешенной конфигурации. Более того, это может привести
// к тому, что одна или несколько обезьян падают вниз. Так как дерево очень высокое,
// то падение вниз занимает продолжительное время, в течение которого обезьяны могут
// продолжить разжимать свои руки.

// Вам задана начальная конфигурация и расписание того, как обезьяны разжимают свои
// руки. Ваша задача — написать программу, которая для каждой обезьяны выводит номер
// секунды, на которой она начала своё падение вниз.

// Входные данные
// В первой строке записаны целые числа n и m (1 ≤ n ≤ 2·10^5, 0 ≤ m ≤ 4·10^5),
// где n — количество обезьян, а m — количество секунд в рассматриваемом интервале
// времени.

// Далее следует n строк, описывающих конфигурацию обезьян: i-я строка содержит пару
// чисел l_i, r_i, где l_i равно -1 или номеру обезьяны, хвост которой находится
// в левой руке i-й обезьяны. Аналогично, r_i равно -1 или номеру обезьяны, хвост
// которой находится в правой руке i-й обезьяны. Значение -1 обозначает, что рука
// обезьяны пуста. Первая обезьяна — вожак и держится хвостом за дерево.

// Потом следует m строк, которые описывают события размыкания рук в течение m секунд:
// от нулевой до (m − 1)-й. Каждая строка состоит из пары чисел p_j, h_j, где p_j —
// это номер той обезьяны, что разомкнула руку в очередную секунду, а h_j — равно 1
// или 2, где 1 обозначает, что она разомкнула левую руку, а 2 — правую.

// Гарантируется, что входные данные корректны (например, обезьяны не размыкают пустые
// руки). Обезьяна может обеими руками как за хвосты разных обезьян, так и за хвост
// одной и той же. За свой хвост обезьяна тоже может держаться.

// Выходные данные
// Выведите n строк, где i-я из них должна содержать номер секунды, когда i-я обезьяна
// начнёт падение. Выводите -1, если к концу рассматриваемого интервала обезьяна
// не упадёт.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 3 2
// -1 3
// 3 -1
// 1 2
// 1 2
// 3 1
// ======================================================================
// Выходные данные
// ======================================================================
// -1
// 1
// 1

// ======================================================================
// Входные данные
// ======================================================================
// 4 5
// 2 2
// 3 -1
// 4 -1
// -1 2
// 1 1
// 2 1
// 3 1
// 1 2
// 4 2
// ======================================================================
// Выходные данные
// ======================================================================
// -1
// 3
// 2
// 3
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

struct DSU
{
    vector<int> p;
    vector<vector<int>> comp;
    DSU(int n)
    {
        p.resize(n);
        comp.resize(n);
        for (int i = 0; i < n; i++)
        {
            p[i] = i;
            comp[i].push_back(i);
        }
    }

    int get(int x) { return p[x] = (x == p[x] ? x : get(p[x])); }

    void united(int a, int b, int time, vector<int> &res)
    {
        a = get(a), b = get(b);
        int lead = get(0);
        if (a != b)
        {
            if (lead == a && lead != b)
                for (auto &m : comp[b])
                    res[m] = time;
            else if (lead == b && lead != a)
                for (auto &m : comp[a])
                    res[m] = time;

            if (comp[a].size() < comp[b].size())
                swap(a, b);
            p[b] = a;
            for (auto &m : comp[b])
                comp[a].push_back(m);
            comp[b].clear();
        }
    }
};

void solve()
{
    int n, m;
    cin >> n >> m;
    DSU d(n);
    vector<pair<int, int>> inp(n);
    vector<pair<bool, bool>> ok(n, {1, 1});
    vector<pair<int, int>> q(m);
    for (auto &[l, r] : inp)
    {
        cin >> l >> r;
        l -= l != -1;
        r -= r != -1;
    }
    for (auto &[j, side] : q)
    {
        cin >> j >> side;
        j--;
        if (side == 1)
            ok[j].first = 0;
        else
            ok[j].second = 0;
    }
    vector<int> res(n, -1);
    for (int i = 0; i < n; i++)
    {
        if (ok[i].first && inp[i].first != -1)
            d.united(i, inp[i].first, -1, res);
        if (ok[i].second && inp[i].second != -1)
            d.united(i, inp[i].second, -1, res);
    }

    for (int i = m - 1; i >= 0; i--)
    {
        int j = q[i].first, side = q[i].second;
        if (side == 1 && inp[j].first != -1)
            d.united(j, inp[j].first, i, res);
        else if (side == 2 && inp[j].second != -1)
            d.united(j, inp[j].second, i, res);
    }
    for (auto &i : res)
        cout << i << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
