// B. Монокарп и проекты
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест512 мегабайт

// Монокарп руководит компанией. Рассмотрим работу его компании в течение ближайших
// k месяцев. В первом месяце в компании работают x сотрудников, не считая самого
// Монокарпа, и нужно выполнить y проектов. В каждом следующем месяце и число
// сотрудников, и число проектов увеличивается на 1.

// Иными словами, в месяце с номером i (0 ≤ i < k) в компании работают x + i
// сотрудников и нужно выполнить y + i проектов.

// В каждом месяце Монокарп распределяет проекты между сотрудниками. Каждый сотрудник
// должен получить одинаковое число проектов, а каждый проект можно назначить не более
// чем одному сотруднику. Все неназначенные проекты Монокарп выполняет сам. Он всегда
// выбирает распределение, при котором ему приходится выполнить как можно меньше
// проектов.

// В частности, если в некотором месяце имеется a сотрудников и b проектов, то
// Монокарп назначает каждому сотруднику ровно ⌊b/a⌋ проектов, а сам выполняет
// b mod a проектов.

// Найдите суммарное количество проектов, которые Монокарп выполнит сам за ближайшие
// k месяцев.

// Входные данные
// В первой строке дано целое число t — число наборов входных данных (1 ≤ t ≤ 10^4).

// Каждый набор входных данных состоит из одной строки, содержащей три целых числа
// x, y и k (1 ≤ x ≤ y ≤ 10^6; 1 ≤ k ≤ 10^12).

// Дополнительное ограничение на входные данные:

// - сумма значений y по всем наборам входных данных не превосходит 10^6.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — суммарное количество
// проектов, которые Монокарп выполнит сам за k месяцев.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 7
// 1 1 1
// 3 10 2
// 3 8 6
// 7 20 1
// 10 25 100
// 8 36 17
// 1 999900 1000000000000
// ======================================================================
// Выходные данные
// ======================================================================
// 0
// 4
// 18
// 6
// 1425
// 110
// 999898177699820694
// ======================================================================

// Примечание
// В первом наборе единственный сотрудник выполняет единственный проект, поэтому
// Монокарпу не остаётся ни одного проекта.

// Во втором наборе в первом месяце 10 проектов распределяются между 3 сотрудниками:
// каждый получает по 3 проекта, а Монокарп выполняет 1 проект. Во втором месяце
// 11 проектов распределяются между 4 сотрудниками: каждый получает по 2 проекта,
// а Монокарп выполняет 3 проекта. Ответ равен 1 + 3 = 4.

// В третьем наборе число проектов, выполняемых Монокарпом в шести месяцах, равно 2,
// 1, 0, 5, 5 и 5 соответственно. Их сумма равна 2 + 1 + 0 + 5 + 5 + 5 = 18.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int x, y, k;
    cin >> x >> y >> k;
    if (y - x == 0)
    {
        cout << "0\n";
        return;
    }
    int d = y - x;
    int res = 0;
    for (int i = 0; i < k; i++)
    {
        int cur = x + i;
        if (cur <= d)
            res += d % cur;
        else
        {
            int rm = k - i;
            res += rm * d;
            break;
        }
    }
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
