// C. Максимизируй XOR, минимизируй операции
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест512 мегабайт

// Даны два целых неотрицательных числа x и y. За одну операцию можно уменьшить x на 1
// и одновременно увеличить y на 1. Операцию нельзя выполнять, если x = 0.

// Для каждой исходной пары выполните некоторое количество операций, возможно нулевое,
// так, чтобы значение x ⊕ y, где ⊕ обозначает операцию побитового исключающего ИЛИ (XOR),
// стало максимально возможным. Среди всех способов получить максимальное значение
// выберите тот, в котором выполнено минимальное количество операций.

// Выведите максимальное значение x ⊕ y и минимальное необходимое количество операций.

// Входные данные
// В первой строке дано целое число t (1 ≤ t ≤ 10^4) — количество наборов входных данных.

// В каждой из следующих t строк даны два целых числа x и y (0 ≤ x, y < 2^29) —
// исходные значения чисел в очередном наборе входных данных.

// Выходные данные
// Для каждого набора входных данных выведите два целых числа — максимально возможное
// значение x ⊕ y и минимальное количество операций, необходимое для его получения.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 3
// 3 1
// 0 5
// 6 4
// ======================================================================
// Выходные данные
// ======================================================================
// 4 3
// 5 0
// 10 4
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long
#define ull unsigned long long
void solve()
{
    int x, y;
    cin >> x >> y;
    int S = x + y;
    int a = 0;
    bool t = 1;
    for (int i = 30; i >= 0; i--)
    {
        ull suka = (S >> i) & 1, bts = (x >> i) & 1;
        if (t)
        {
            if (suka)
            {
                if (bts)
                    a |= (1LL << i);
            }
            else if (bts)
                t = 0;
        }
        else
        {
            if (suka)
                a |= (1LL << i);
        }
    }
    cout << S << ' ' << (x - a) << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
