// A. Матрица смежности
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вам задан неориентированный граф списком своих рёбер. Постройте матрицу смежности
// заданного графа.

// Входные данные
// В первой строке находится целое число t (1 ≤ t ≤ 500) — количество наборов
// входных данных в тесте. Далее следуют t наборов входных данных. Перед каждым
// набором входных данных записана пустая строка.

// В первой строке каждого набора содержатся два целых числа n и m (1 ≤ n ≤ 500,
// 0 ≤ m ≤ n·(n−1)/2), где n — количество вершин в графе, m — количество рёбер в графе.

// В следующих m строках записаны рёбра, по одному ребру в строке. Каждое ребро
// характеризуется двумя целыми числами u и v (1 ≤ u, v ≤ n), где u — начало ребра,
// а v — конец ребра.

// В графе отсутствуют петли и кратные рёбра.

// Сумма n по всем наборам входных данных в одном тесте не превосходит 500.

// Выходные данные
// Для каждого набора входных данных выведите n строк по n чисел в каждой —
// матрицу смежности заданного графа.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 2

// 3 3
// 1 2
// 2 3
// 1 3

// 4 1
// 1 3
// ======================================================================
// Выходные данные
// ======================================================================
// 0 1 1
// 1 0 1
// 1 1 0

// 0 0 1 0
// 0 0 0 0
// 1 0 0 0
// 0 0 0 0
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, m;
    cin >> n >> m;
    vector<vector<int>> a(n, vector<int>(n, 0));
    while (m--)
    {
        int x, y;
        cin >> x >> y;
        x--;
        y--;
        a[x][y] = 1;
        a[y][x] = 1;
    }
    for (auto &i : a)
    {
        for (auto &j : i)
            cout << j << ' ';
        cout << '\n';
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
