// B. Матрица смежности?
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Вам заданы число n и бинарная (состоящая из нулей и единиц) матрица размера n × n.
// Проверьте, является ли заданная матрица матрицей смежности некоторого неориентированного
// графа, и если это так, то выведите степени вершин этого графа.

// Входные данные
// В первой строке находится целое число t (1 ≤ t ≤ 500) — количество наборов
// входных данных в тесте. Далее следуют t наборов входных данных.

// В первой строке каждого набора содержится одно целое число n (1 ≤ n ≤ 500) —
// размер матрицы.

// В следующих n строках записаны по n чисел a[i][j], разделённых через пробел —
// бинарная матрица. Каждое число является либо единицей, либо нулём.

// Сумма n по всем наборам входных данных в одном тесте не превосходит 500.

// Выходные данные
// Для каждого набора входных данных в отдельной строке выведите:

// - «YES» — если заданная бинарная матрица является матрицей смежности некоторого
//   неориентированного графа.
//   В следующей строке выведите n чисел, разделённых через пробел. i-е число означает
//   степень i-й вершины;
// - «NO» — в противном случае.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 2
// 2
// 0 1
// 1 0
// 3
// 0 0 1
// 1 0 0
// 0 0 0
// ======================================================================
// Выходные данные
// ======================================================================
// YES
// 1 1
// NO
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<vector<int>> a(n, vector<int>(n, 0));
    for (auto &i : a)
        for (auto &j : i)
            cin >> j;

    vector<int> res(n);
    for (int i = 0; i < n; i++)
    {
        int s = 0;
        for (int j = 0; j < n; j++)
        {
            if (a[i][j] != a[j][i] || (i == j && a[i][j] != 0))
            {
                cout << "NO\n";
                return;
            }
            s += a[i][j];
        }
        res[i] = s;
    }
    cout << "YES\n";
    for (auto &i : res)
        cout << i << ' ';
    cout << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
