// C. Списки смежности
// ограничение по времени на тест3 секунды
// ограничение по памяти на тест256 мегабайт

// Вам задана матрица смежности некоторого неориентированного графа. Постройте по
// заданной матрице списки смежности.

// Входные данные
// В первой строке находится целое число t (1 ≤ t ≤ 500) — количество наборов
// входных данных в тесте. Далее следуют t наборов входных данных.

// В первой строке каждого набора содержится одно целое число n (1 ≤ n ≤ 500) —
// размер матрицы.

// В следующих n строках записаны по n чисел a[i][j], разделённых через пробел —
// бинарная матрица. Каждое число является либо единицей, либо нулём.

// Сумма n по всем наборам входных данных в одном тесте не превосходит 500.

// Выходные данные
// Для каждого набора входных данных выведите n строк. В i-й строке выведите все
// смежные с i-й вершины в порядке возрастания номеров. Вершины нумеруются с единицы.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 2
// 2
// 0 1
// 1 0
// 3
// 0 0 1
// 0 0 1
// 1 1 0
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// 1
// 3
// 3
// 1 2
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<vector<int>> a(n);
    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < n; j++)
        {
            int x;
            cin >> x;
            if (x)
                a[i].push_back(j + 1);
        }
    }
    for (auto &i : a)
    {
        for (auto &j : i)
            cout << j << ' ';
        cout << '\n';
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
