// D. Два ребра
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вам задан неориентированный граф списком его рёбер. Найдите количество пар рёбер
// в графе, которые имеют один общий конец, а расстояние между другими двумя концами
// ровно 2.

// Два варианта считаются разными, если существует такое ребро, которое присутствует
// в первом варианте, но не присутствует во втором.

// Входные данные
// В первой строке находится целое число t (1 ≤ t ≤ 10^5) — количество наборов
// входных данных в тесте. Далее следуют t наборов входных данных. Перед каждым
// набором входных данных записана пустая строка.

// В первой строке каждого набора содержатся два целых числа n и m (1 ≤ n ≤ 10^5,
// 0 ≤ m ≤ 10^5), где n — количество вершин в графе, m — количество рёбер в графе.

// В следующих m строках записаны рёбра, по одному ребру в строке. Каждое ребро
// характеризуется двумя целыми числами u и v (1 ≤ u, v ≤ n), где u — начало ребра,
// а v — конец ребра.

// В графе отсутствуют петли и кратные рёбра.

// Суммы n и m по всем наборам входных данных в одном тесте не превосходят 10^5.

// Выходные данные
// Для каждого набора входных данных на отдельной строке выведите количество пар рёбер
// в графе, которые имеют один общий конец, а расстояние между другими двумя концами
// ровно 2.

// Два варианта считаются разными, если существует такое ребро, которое присутствует
// в первом варианте, но не присутствует во втором.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4

// 4 4
// 1 2
// 2 3
// 3 4
// 4 1

// 8 10
// 1 2
// 1 4
// 2 3
// 3 4
// 3 6
// 4 5
// 5 6
// 6 7
// 5 8
// 7 8

// 5 4
// 1 3
// 2 3
// 3 4
// 3 5

// 5 6
// 1 2
// 1 3
// 1 4
// 2 4
// 3 4
// 3 5
// ======================================================================
// Выходные данные
// ======================================================================
// 4
// 16
// 6
// 4
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, m, res = 0;
    cin >> n >> m;
    vector<vector<bool>> a(n, vector<bool>(n, 0));
    while (m--)
    {
        int u, v;
        cin >> u >> v;
        a[u][v] = 1;
        a[v][u] = 1;
    }

    // for (int i = 0; i < count; i++)
    // {
    //     /* code */
    // }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
