// A. Z-функция (простая версия)
// ограничение по времени на тест3 секунды
// ограничение по памяти на тест512 мегабайт

// В этой задаче вам достаточно реализовать квадратичный алгоритм нахождения z-функции,
// основанный на её определении.

// Напишите программу, которая выведет z-функцию заданной строки s.

// Входные данные
// Входные данные содержат единственную строку s длины от 1 до 3000.
// Она содержит только строчные и прописные буквы латинского алфавита и цифры.

// Выходные данные
// Выведите z-функцию строки — последовательность целых чисел z0,z1,…,zn−1,
// где z0=0 и zi — это длина наидлиннейшего общего префикса строки s и s[i…n−1]
// для i>0 (считайте, что символы в строке пронумерованы от 0 до n−1).

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// abacaba
// ======================================================================
// Выходные данные
// ======================================================================
// 0 0 1 0 3 0 1

// ======================================================================
// Входные данные
// ======================================================================
// a
// ======================================================================
// Выходные данные
// ======================================================================
// 0

// ======================================================================
// Входные данные
// ======================================================================
// aabbb
// ======================================================================
// Выходные данные
// ======================================================================
// 0 1 0 0 0

// ======================================================================
// Входные данные
// ======================================================================
// babaabbb
// ======================================================================
// Выходные данные
// ======================================================================
// 0 0 2 0 0 1 1 1
// ======================================================================

#include <iostream>
#include <vector>
#include <string>

std::vector<int> zFoo(std::string s)
{
    int n = s.length();
    std::vector<int> result(n, 0);
    for (int i = 1; i < n; ++i)
    {
        int len = 0;
        while (i + len < n && s[len] == s[i + len])
        {
            ++len;
        }
        result[i] = len;
    }
    return result;
}

int main()
{
    // Ускорение ввода-вывода
    std::ios_base::sync_with_stdio(false);
    std::cin.tie(NULL);

    std::string str;
    std::cin >> str;
    std::vector<int> data = zFoo(str);
    for (auto i = data.begin(); i != data.end(); i++)
    {
        std::cout << *i << " ";
    }
    std::cout << std::endl;

    return 0;
}