// A. Прилив
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Алиса, Боб и Чарли играют в игру с жетонами. Изначально у них соответственно a, b и c жетонов.

// Игра проходит раундами. Перед началом каждого раунда они проверяют, сколько жетонов у каждого:

// - Если у каких-либо двух игроков одинаковое число жетонов, игра немедленно заканчивается.
// - Иначе начинается раунд: у всех трёх игроков строго разное число жетонов. Игрок с наибольшим числом жетонов отдаёт ровно 1 жетон игроку с наименьшим числом жетонов.

// Даны начальные значения a, b и c. Определите точно, сколько раундов продлится игра до её окончания.

// Входные данные
// В первой строке содержится одно целое число t (1 ≤ t ≤ 10^3) — количество наборов входных данных.

// Каждый набор входных данных состоит из одной строки, содержащей три целых числа a, b и c (1 ≤ a, b, c ≤ 10).

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — количество раундов, которое продлится игра.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 1 2 3
// 4 6 1
// 3 3 7
// 1 7 10
// 6 1 9
// 1 1 1
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 2
// 0
// 3
// 3
// 0
// ======================================================================

// Примечание
// В первом наборе входных данных:

// - Ни у каких двух игроков нет одинакового числа жетонов.
// - У Чарли больше всего жетонов (3 жетона), а у Алисы меньше всего (1 жетон). Поэтому Чарли отдаёт жетон Алисе.
// - Теперь у Алисы 2 жетона, у Боба 2 жетона, а у Чарли 2 жетона. Поскольку у двух или более игроков одинаковое число жетонов, игра заканчивается.
// - Игра закончилась после 1 раунда, значит ответ равен 1.

// Во втором наборе входных данных игра проходит так:

// - Боб отдаёт жетон Чарли, теперь у Алисы 4 жетона, у Боба 5 жетонов, а у Чарли 2 жетона.
// - Боб отдаёт жетон Чарли, теперь у Алисы 4 жетона, у Боба 4 жетона, а у Чарли 3 жетона. Поскольку у двух игроков одинаковое число жетонов, игра заканчивается.
// - Игра длилась 2 раунда.

// В третьем наборе входных данных у двух игроков уже одинаковое число жетонов. Поэтому ответ равен 0, так как не было сыграно ни одного раунда.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    vector<int> a(3);
    for (auto &i : a)
        cin >> i;
    sort(a.begin(), a.end());
    cout << min((a[2] - a[1]), a[1] - a[0]) << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
