// B. Сокращение
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Пусть f(s) — это сжатая версия строки s, полученная заменой каждого максимального
// непрерывного блока одинаковых символов одной копией этого символа. Например,
// f(«aabbcc») = «abc».

// Пусть |s| обозначает длину строки s. Тогда |f(s)| обозначает длину сжатой строки.
// Например:

// - |f(«aabbcc»)| = |«abc»| = 3.

// Если строка пустая, её длина равна 0.

// Юсеф дал вам строку s, состоящую из n строчных латинских букв. Вы должны удалить
// ровно один символ s_i (2 ≤ i ≤ n − 1), чтобы получить новую строку s′, а затем
// найти минимально возможное значение |f(s′)|.

// Обратите внимание, что вы не можете удалить s1 или s_n.

// Входные данные
// Первая строка содержит целое число t (1 ≤ t ≤ 10^4) — количество наборов
// входных данных.

// Первая строка каждого набора входных данных содержит целое число n (3 ≤ n ≤ 2·10^5) —
// длину строки.

// Вторая строка каждого набора входных данных содержит строку s (|s| = n),
// состоящую из строчных латинских букв.

// Гарантируется, что сумма n по всем наборам входных данных не превышает 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — минимально возможную
// длину результирующей сжатой строки после удаления одного символа.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 9
// 3
// abb
// 3
// aab
// 3
// abc
// 4
// abaa
// 4
// abba
// 5
// eeeee
// 6
// yyssee
// 7
// abacaba
// 18
// goodluckandhavefun
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// 2
// 2
// 1
// 3
// 1
// 3
// 5
// 16
// ======================================================================

// Примечание
// В первом наборе входных данных мы можем удалить только символ s2 = 'b', получив
// строку s′ = «ab», для которой |f(s′)| = 2. Следовательно, 2 — минимально возможная
// длина.

// В четвёртом наборе входных данных мы можем удалить символ s2 = 'b'. Полученная
// строка s′ = «aaa», для которой f(s′) = «a», поэтому |f(s′)| = 1.

// В шестом наборе входных данных удаление любого допустимого символа приводит к
// f(s′) = «e» и |f(s′)| = 1.

// В восьмом наборе входных данных мы можем удалить символ s4 = 'b'. Полученная
// строка s′ = «abaaba», для которой f(s′) = «ababa» и |f(s′)| = 5.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    string s;
    cin >> n >> s;
    char last_ch = s[0];
    int k = 1;
    for (int i = 1; i < n; i++)
    {
        if (s[i] != last_ch)
        {
            last_ch = s[i];
            k++;
        }
    }
    int best_res = k;
    for (int i = 1; i < n - 1; i++)
    {
        if (s[i - 1] == s[i + 1] && s[i] != s[i + 1])
            best_res = min(best_res, k - 2);
        if (s[i - 1] != s[i] && s[i] != s[i + 1])
            best_res = min(best_res, k - 1);
    }

    cout << best_res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
