// C1. Marenol (простая версия)
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Это простая версия задачи. В этой версии требуется только определить, можно ли
// преобразовать строку a в строку b.

// Юсеф дал вам две двоичные строки, a и b, одинаковой длины n.

// Вам разрешено выполнять любые из следующих операций:

// - Выбрать подстроку* в a, равную 001, и заменить её на 100 или наоборот
//   (то есть 001 → 100 или 100 → 001).
// - Выбрать подстроку в a, равную 110, и заменить её на 011 или наоборот
//   (то есть 011 → 110 или 110 → 011).

// Ваша задача — определить, можно ли преобразовать строку a в строку b, выполнив
// конечное число операций.

// * Строка a является подстрокой строки b, если a можно получить из b удалением
// нескольких (возможно, нуля или всех) символов с начала и нескольких (возможно,
// нуля или всех) символов с конца.

// Входные данные
// Первая строка содержит одно целое число t (1 ≤ t ≤ 10^4) — количество наборов
// входных данных.

// Первая строка каждого набора входных данных содержит одно целое число n
// (1 ≤ n ≤ 2·10^5) — длину каждой строки.

// Вторая строка каждого набора входных данных содержит двоичную строку a (|a| = n),
// состоящую только из символов 0 и/или 1.

// Третья строка каждого набора входных данных содержит двоичную строку b (|b| = n),
// состоящую только из символов 0 и/или 1.

// Гарантируется, что сумма n по всем наборам входных данных не превышает 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите «YES», если строку a можно преобразовать
// в строку b, выполнив конечное число операций, и «NO» в противном случае.

// Ответ можно выводить в любом регистре (верхнем или нижнем). Например, строки «yEs»,
// «yes», «Yes» и «YES» будут распознаны как положительные ответы.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 9
// 1
// 0
// 0
// 2
// 01
// 10
// 3
// 001
// 100
// 4
// 1010
// 0101
// 4
// 1100
// 1000
// 5
// 01001
// 10010
// 6
// 110000
// 000011
// 6
// 111000
// 000111
// 7
// 1001100
// 0000111
// ======================================================================
// Выходные данные
// ======================================================================
// YES
// NO
// YES
// NO
// NO
// YES
// YES
// NO
// YES
// ======================================================================

// Примечание
// В первом наборе входных данных уже выполняется a = b. Поэтому ответ — YES.

// Во втором наборе входных данных нельзя выполнить ни одной операции. Поскольку a ≠ b,
// ответ — NO.

// В третьем наборе входных данных можно выбрать подстроку a[1,3] = 001 и заменить её
// на 100, получив a = b. Поэтому ответ — YES.

// В седьмом наборе входных данных можно последовательно сделать следующее:

// 1 100 00 → 1 001 00 → 100 100 → 100 001 → 100 001 → 00 100 1 → 00 001 1.

// Следовательно, ответ — YES.
#include <bits/stdc++.h>
using namespace std;

#define int long long

int f(string &a, string &b, int start)
{
    int res = 0, p = 0;
    for (int i = start; i < a.size(); i += 2)
    {
        p += (a[i] - '0') - (b[i] - '0');
        res += abs(p);
    }

    return res;
}

void solve()
{
    int n;
    cin >> n;
    string a, b;
    cin >> a >> b;

    int cnt_a = count(a.begin(), a.end(), '1');
    int cnt_b = count(b.begin(), b.end(), '1');
    if (cnt_a != cnt_b)
    {
        cout << -1 << '\n';
        return;
    }
    int even_a = 0, even_b = 0;
    for (int i = 0; i < n; i += 2)
    {
        even_a += (a[i] == '1');
        even_b += (b[i] == '1');
    }
    if (even_a != even_b)
    {
        cout << -1 << '\n';
        return;
    }
    int res = 0;
    res += f(a, b, 0);
    res += f(a, b, 1);
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
