// D. Силуэт
// ограничение по времени на тест2.5 секунд
// ограничение по памяти на тест256 мегабайт

// У Юсефа есть секретный массив a из n строго положительных целых чисел.

// Для каждого элемента a_i его тень b_i — это сумма всех элементов массива a,
// которые строго меньше a_i. Формально:

// b_i = ∑_{1 ≤ j ≤ n, a_j < a_i} a_j.

// Вам дан массив теней b. Ваша задача — восстановить лексикографически минимальный
// корректный массив a, состоящий из строго положительных целых чисел, который
// удовлетворяет условию выше. Если такого массива не существует, выведите -1.

// Входные данные
// Первая строка содержит целое число t (1 ≤ t ≤ 10^4) — количество наборов
// входных данных.

// Первая строка каждого набора входных данных содержит целое число n (1 ≤ n ≤ 2·10^5) —
// размер массива.

// Вторая строка каждого набора входных данных содержит n целых чисел b1, b2, …, b_n
// (0 ≤ b_i ≤ 2·10^14) — массив теней.

// Гарантируется, что сумма n по всем наборам входных данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите n целых чисел a1, a2, …, a_n
// (1 ≤ a_i ≤ 10^18) — лексикографически минимальный корректный массив a,
// удовлетворяющий условию. Если корректного массива не существует, вместо этого
// выведите -1.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 8
// 1
// 0
// 5
// 0 4 0 4 14
// 3
// 4 0 0
// 3
// 0 0 0
// 3
// 0 1 1
// 4
// 1 1 1 1
// 7
// 0 4 4 4 4 4 9
// 5
// 0 0 0 3 3
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 2 5 2 5 6
// 3 2 2
// 1 1 1
// 1 2 2
// -1
// -1
// 1 1 1 2 2
// ======================================================================

// Примечание
// В первом наборе входных данных ответ — a = [1]. Поскольку в массиве только один
// элемент, строго меньших элементов нет, поэтому его тень равна 0. Следовательно,
// a = [1] корректен. Он также лексикографически минимален, потому что допустимы
// только положительные целые числа, а 1 — наименьшее возможное значение.

// Во втором наборе входных данных ответ — a = [2, 5, 2, 5, 6]:

// - Для каждого 2 в массиве нет меньших элементов, поэтому тень равна 0.
// - Для каждого 5 строго меньшими элементами являются два числа 2, поэтому тень
//   равна 2 + 2 = 4.
// - Для 6 строго меньшими элементами являются два числа 2 и два числа 5, поэтому
//   тень равна 2 + 2 + 5 + 5 = 14.

// Таким образом, массив теней в точности равен b = [0, 4, 0, 4, 14].

// В третьем наборе входных данных массив теней для a = [3, 2, 2] вычисляется
// следующим образом:

// - Для a1 = 3 строго меньшими элементами в массиве являются два 2. Их сумма
//   равна 2 + 2 = 4. Значит, b1 = 4.
// - Для a2 = 2 строго меньших элементов в массиве нет. Значит, b2 = 0.
// - Для a3 = 2 строго меньших элементов в массиве нет. Значит, b3 = 0.

// Получившийся массив теней равен b = [4, 0, 0], что совпадает с входными данными.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n), t(n);
    map<int, int> m, r;
    for (int i = 0; i < n; i++)
    {
        cin >> a[i];
        t[i] = a[i];
        m[a[i]]++;
    }
    if (n == 1)
    {
        cout << "1\n";
        return;
    }
    sort(t.rbegin(), t.rend());
    t.erase(unique(t.begin(), t.end()), t.end());
    if (t[t.size() - 1] != 0)
    {
        cout << "-1\n";
        return;
    }
    if (t.size() >= 2)
    {
        int prev_a = -1;
        for (int i = 1; i < t.size(); i++)
        {
            if ((t[i - 1] - t[i]) % m[t[i]] == 0)
            {
                int cur_a = (t[i - 1] - t[i]) / m[t[i]];
                if (prev_a != -1 && cur_a >= prev_a)
                {
                    cout << "-1\n";
                    return;
                }
                r[t[i]] = cur_a;
                prev_a = cur_a;
            }
            else
            {
                cout << "-1\n";
                return;
            }
        }
        int sum = 0;
        for (int i = 1; i < t.size(); i++)
        {
            sum += r[t[i]] * m[t[i]];
        }
        if (sum != t[0])
        {
            cout << "-1\n";
            return;
        }
        r[t[0]] = r[t[1]] + 1;
    }
    else
    {
        for (int i = 0; i < n; i++)
            cout << 1 << ' ';
        cout << '\n';
        return;
    }
    for (int i = 0; i < n; i++)
        cout << r[a[i]] << ' ';
    cout << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
