// C. Кратчайшие пути
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// В Мемляндии n городов, перемещаться между ними можно на самолёте. Всего существует
// m рейсов между этими городами, каждый из них характеризуется стартовым городом a,
// конечным городом b, а также ценой c. Все рейсы являются односторонними. Ваша задача
// для каждого города определить минимальную цену перелёта, если начинать из города 1.

// Входные данные
// Первая строка содержит два целых числа n (1 ≤ n ≤ 10^5) и m (1 ≤ m ≤ 2·10^5).

// Далее идут m строк с описанием очередного рейса a b c, (1 ≤ a, b ≤ n),
// (1 ≤ c ≤ 10^9).

// Гарантируется, что из города 1 можно добраться до любого другого.

// Выходные данные
// Выведите n целых чисел, минимальную цену перелёта для городов 1, 2, …, n.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 3 4
// 1 2 6
// 1 3 2
// 3 2 3
// 1 3 4
// ======================================================================
// Выходные данные
// ======================================================================
// 0 5 2
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

const int INF = 1e18;

struct Edge
{
    int to, w;
};

void solve()
{
    int v, e;
    cin >> v >> e;
    vector<vector<Edge>> graph(v);
    for (int i = 0; i < e; i++)
    {
        int a, b, c;
        cin >> a >> b >> c;
        a--;
        b--;
        graph[a].push_back({b, c});
    }

    vector<int> dist(v, INF), vis(v, 0);
    auto cmp = [](pair<int, int> &l, pair<int, int> &r)
    { return l.first > r.first; };
    priority_queue<pair<int, int>, vector<pair<int, int>>, decltype(cmp)> q;
    dist[0] = 0;
    q.push({0, 0});

    while (!q.empty())
    {
        auto cur = q.top();
        q.pop();
        // vis[cur.second] = 1;

        if (cur.first > dist[cur.second])
            continue;

        vis[cur.second] = 1;

        for (auto &ed : graph[cur.second])
        {
            if (dist[ed.to] > cur.first + ed.w)
            {
                dist[ed.to] = cur.first + ed.w;
                q.push({dist[ed.to], ed.to});
            }
        }
    }
    for (auto &i : dist)
        cout << i << ' ';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
