// E. Кратчайшие пути 2
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// В Мемляндии n городов и m дорог между ними. Также есть q запросов на нахождение
// кратчайшего пути между городом u и v. Ваша задача — быстро ответить на эти запросы.

// Входные данные
// Первая строка содержит три целых числа n (1 ≤ n ≤ 500), m (1 ≤ m ≤ n²),
// q (1 ≤ q ≤ 10^5).

// Следующие m строк описывают очередную дорогу. Каждая из них содержит три целых числа
// a, b (1 ≤ a, b ≤ n), c (1 ≤ c ≤ 10^9), которые обозначают, что между городами a и b
// существует двусторонняя дорога длиной c.

// Следующие q строк содержат по два целых числа u, v (1 ≤ u, v ≤ n) — города,
// между которыми нужно найти кратчайшее расстояние.

// Выходные данные
// Выведите q целых чисел — ответы на запросы. Если в очередном запросе нет пути
// между u и v, то необходимо вывести −1.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4 3 5
// 1 2 5
// 1 3 9
// 2 3 3
// 1 2
// 2 1
// 1 3
// 1 4
// 3 2
// ======================================================================
// Выходные данные
// ======================================================================
// 5
// 5
// 8
// -1
// 3
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

const int INF = 1e18;

void solve()
{
    int v, e, q;
    cin >> v >> e >> q;
    vector<vector<int>> dist(v, vector<int>(v, INF));
    for (int i = 0; i < v; i++)
        dist[i][i] = 0;

    for (int i = 0; i < e; i++)
    {
        int a, b, c;
        cin >> a >> b >> c;
        a--;
        b--;
        dist[a][b] = min(dist[a][b], c);
        dist[b][a] = min(dist[a][b], c);
    }

    for (int i = 0; i < v; i++)
        for (int u = 0; u < v; u++)
            for (int j = 0; j < v; j++)
            {
                if (dist[u][i] != INF && dist[j][i] != INF)
                {
                    dist[u][j] = min(dist[u][j], dist[i][u] + dist[i][j]);
                    dist[j][u] = dist[u][j];
                }
            }

    while (q--)
    {
        int ql, qr;
        cin >> ql >> qr;
        ql--;
        qr--;
        cout << (dist[ql][qr] == INF ? -1 : dist[ql][qr]) << '\n';
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
