// // A. Школа языка Му
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Фермер Джон пытается повысить уровень грамотности в Соединённых Коровах Фермера
// Джона (UCFJ). UCFJ состоит из n полей и n/k ферм (где n кратно k), причём каждая
// ферма состоит из k подряд идущих полей. Иными словами, i-е поле находится
// в ⌈i/k⌉-й ферме: поля 1, 2, …, k находятся в первой ферме, поля k+1, k+2, …, 2k —
// во второй ферме и т. д.

// Фермер Джон хочет построить школы так, чтобы в каждой ферме была хотя бы одна
// школа. Однако некоторые поля принадлежат Фермеру Ножду, который будет брать
// с Фермера Джона дополнительную плату за строительство школы на своей земле.
// Фермер Джон хочет узнать минимальное число раз, когда ему придётся построить
// школу на земле Фермера Ножда, чтобы гарантировать, что в каждой ферме будет
// хотя бы одна школа.

// Входные данные
// Первая строка каждого набора входных данных содержит целое число t (1 ≤ t ≤ 10^4) —
// количество наборов входных данных.

// Первая строка каждого набора входных данных содержит два целых числа n и k
// (1 ≤ k ≤ n ≤ 20, n кратно k) — количество полей и размер каждой фермы.

// Вторая строка каждого набора входных данных содержит бинарную строку s длины n —
// поля, принадлежащие Фермеру Ножду. Если s_i = 1, то i-е поле принадлежит Фермеру
// Ножду. Если s_i = 0, то i-е поле не принадлежит Фермеру Ножду.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — минимальное число раз,
// когда Фермер Джон должен построить школу на земле Фермера Ножда.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 8 2
// 10011100
// 5 1
// 11111
// 8 4
// 01111110
// 5 1
// 00101
// 4 4
// 1101
// 4 4
// 1111
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 5
// 0
// 2
// 0
// 1
// ======================================================================

// Примечание
// В первом наборе входных данных мы можем построить школу на 2-м, 3-м, 5-м и 7-м полях,
// и из них только 5-е поле принадлежит Фермеру Ножду, значит, наш ответ равен 1.
// Можно показать, что это наилучший возможный ответ.

// Во втором наборе входных данных Фермер Ножд владеет каждым полем, и поскольку нам
// нужно построить 5 школ, мы должны построить на земле Фермера Ножда 5 раз.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, k, res = 0;
    string s;
    cin >> n >> k >> s;
    for (int i = 0; i < n;)
    {
        bool ok = 0;
        for (int j = 0; j < k; j++, i++)
            if (s[i] == '0')
                ok = 1;
        res += !ok;
    }
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
