// B. Minus Two
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вам дан массив a1, a2, …, a_n. Вы можете выполнить следующую операцию:

// - Для всех индексов i (1 ≤ i ≤ n) присвоить a_i = |a_i − 2|.

// Найдите максимальное возможное количество вхождений любого целого числа в a
// после выполнения операции произвольное число раз (возможно, ноль).

// Входные данные
// В первой строке каждого набора входных данных содержится целое число t (1 ≤ t ≤ 10^4) —
// количество наборов входных данных.

// В первой строке каждого набора входных данных содержится целое число n (1 ≤ n ≤ 2·10^5) —
// длина массива a.

// Во второй строке каждого набора входных данных содержится n целых чисел a1, a2, …, a_n
// (1 ≤ a_i ≤ 10^9) — массив a.

// Гарантируется, что сумма n по всем наборам входных данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число, обозначающее максимальное
// возможное количество вхождений любого целого числа в a после выполнения операции
// произвольное число раз.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 2
// 1 3
// 4
// 1 1 1 2
// 3
// 6 7 8
// 4
// 2 2 2 2
// 5
// 1 10 100 1000 100000
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// 3
// 1
// 4
// 3
// ======================================================================

// Примечание
// В первом наборе входных данных мы можем выполнить операцию один раз и получить
// a = [|1 − 2|, |3 − 2|] = [1, 1], что означает, что максимальная возможная частота
// в a равна 2.

// Во втором наборе входных данных максимальная частота некоторого целого числа в a
// равна 3. Можно показать, что, сколько бы операций мы ни выполнили, максимальная
// частота в a никогда не превысит 3.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    int c1 = 0, c21 = 0, c22 = 0;
    for (auto &i : a)
    {
        cin >> i;
        if (i % 2 != 0)
            c1++;
        else
        {
            if (i % 4 == 0)
                c22++;
            else
                c21++;
        }
    }
    cout << max({c1, c21, c22}) << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
