// C. 101
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Оценка массива b длины m определяется как максимальная длина такого подмассива
// массива b, что первый и последний элементы подмассива равны 1, а все остальные
// элементы подмассива равны 0. Формально, оценка массива b равна максимальному
// целому числу k, для которого существует индекс i, такой что:

// - 1 ≤ i ≤ m − k + 1
// - b_i = b_{i+k-1} = 1
// - b_{i+1} = b_{i+2} = … = b_{i+k-2} = 0

// Если не существует подмассива, удовлетворяющего требованиям, оценка массива b
// равна 0.

// Вам дан массив a1, a2, …, a_n, в котором каждый элемент равен одному из −1, 0 или 1.
// Замените каждый −1 на 0 или 1 так, чтобы оценка массива a была максимальной среди
// всех возможных способов замены −1 в массиве a.

// Входные данные
// В первой строке каждого набора входных данных содержится t (1 ≤ t ≤ 10^4) —
// количество наборов входных данных.

// В первой строке каждого набора входных данных содержится n (1 ≤ n ≤ 2·10^5) —
// длина массива a.

// Во второй строке каждого набора входных данных содержатся a1, a2, …, a_n
// (a_i ∈ {−1, 0, 1}) — массив a.

// Гарантируется, что сумма n по всем наборам входных данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите n целых чисел, разделённых пробелами,
// представляющих массив a после замены −1 на 0 или 1. Если существует несколько
// возможных решений, выведите любое.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 10
// 6
// 1 0 -1 0 0 1
// 7
// 0 -1 0 0 1 0 1
// 5
// -1 0 0 -1 0
// 4
// 0 0 0 0
// 1
// -1
// 6
// 1 0 1 0 0 -1
// 7
// 0 1 0 0 0 1 0
// 6
// -1 -1 -1 -1 -1 -1
// 7
// -1 0 1 -1 0 0 1
// 3
// -1 0 0
// ======================================================================
// Выходные данные
// ======================================================================
// 1 0 0 0 0 1
// 0 1 0 0 1 0 1
// 1 0 0 1 0
// 0 0 0 0
// 1
// 1 0 1 0 0 1
// 0 1 0 0 0 1 0
// 1 0 0 0 0 1
// 0 0 1 0 0 0 1
// 1 0 0
// ======================================================================

// Примечание
// В первом наборе входных данных мы можем заменить единственный −1 на 0, получив
// a = [1, 0, 0, 0, 0, 1]. Поскольку первый и последний элементы массива a равны 1,
// а все остальные элементы равны 0, оценка массива a равна 6.

// В третьем наборе входных данных замена обоих −1 на 1 даёт a = [1, 0, 0, 1, 0],
// и наибольший подмассив, удовлетворяющий условиям из условия, — это подмассив
// с 1-го по 4-й индекс.

// В пятом наборе входных данных мы устанавливаем единственный −1 в 1, получая a = [1],
// то есть наибольший подмассив, удовлетворяющий условиям из условия, — это весь массив.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n), res(n, 0);
    for (auto &i : a)
        cin >> i;
    int l = 0, r = n - 1;

    for (int i = 0; i < n; i++)
    {
        if (a[i] == 1 || a[i] == -1)
        {
            res[i] = 1;
            l = i + 1;
            break;
        }
    }
    for (int i = n - 1; i >= 0; i--)
    {
        if (a[i] == 1 || a[i] == -1)
        {
            res[i] = 1;
            r = i;
            break;
        }
    }
    for (int i = l; i < r; i++)
        res[i] = (a[i] == -1 ? 0 : a[i]);

    for (auto &i : res)
        cout << i << ' ';
    cout << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
