// E. Разрушение карты сокровищ (конструктивная версия)
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Бесси-Пиратка десятилетиями грабила шесть или семь морей, но теперь ей нужно найти
// место, где закопать своё сокровище!

// Есть n островов, расположенных в линию, и Бесси закопала своё сокровище на некотором
// количестве островов. Гарантируется, что Бесси закопала сокровище хотя бы на одном
// острове.

// Чтобы помнить, где она закопала сокровище, она создала карту сокровищ. Карту сокровищ
// можно представить как массив из n целых чисел, где a_i обозначает минимальное
// количество островов, через которые Бесси должна пройти, чтобы добраться до острова
// с сокровищем, если она начнёт с острова i, предполагая, что она может перемещаться
// только на соседние острова.

// Однако после того, как Бесси закопала сокровище, Злая Исследовательница Элси
// попыталась украсть карту сокровищ Бесси! К счастью, Элси не удалось это сделать,
// но в суматохе части карты сокровищ Бесси были уничтожены, то есть некоторые
// элементы a были заменены на −1! В панике Бесси даёт вам уничтоженный массив b
// и хочет, чтобы вы нашли любое возможное множество островов, на которых она могла
// закопать своё сокровище. Возможно, Бесси ошиблась при записи карты сокровищ,
// поэтому может не существовать ни одного подходящего множества островов, на которых
// она могла бы закопать сокровище.

// Входные данные
// Первая строка ввода содержит t (1 ≤ t ≤ 10^4) — количество наборов входных данных.

// Первая строка каждого набора входных данных содержит n (1 ≤ n ≤ 2·10^5) —
// количество островов.

// Вторая строка содержит b1, b2, …, b_n (−1 ≤ b_i ≤ n − 1) — уничтоженный массив
// расстояний. Если b_i = −1, элемент был уничтожен.

// Гарантируется, что сумма n по всем наборам входных данных не превышает 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите битовую строку длины n, где i-й символ
// равен 1, если на позиции i есть сокровище, или 0, если его там нет. Если существует
// несколько возможных ответов, выведите любой. Если возможных ответов нет,
// выведите −1. Ваш ответ должен содержать хотя бы одно сокровище.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 12
// 5
// 0 1 -1 -1 0
// 3
// -1 0 2
// 5
// -1 1 -1 1 -1
// 5
// -1 -1 -1 -1 -1
// 5
// -1 2 -1 3 -1
// 7
// 2 1 0 1 0 1 2
// 1
// -1
// 3
// 1 -1 1
// 1
// 0
// 4
// 3 -1 -1 -1
// 6
// -1 -1 0 -1 2 4
// 10
// -1 1 -1 -1 1 1 -1 -1 2 -1
// ======================================================================
// Выходные данные
// ======================================================================
// 10101
// -1
// 10001
// 11010
// -1
// 0010100
// 1
// 010
// 1
// 0001
// -1
// 1001001000
// ======================================================================

// Примечание
// В первом наборе входных данных Бесси могла закопать сокровище на первом, третьем
// и пятом островах, получив a = [0, 1, 0, 1, 0].

// В четвёртом наборе входных данных, поскольку вся карта была уничтожена, подходят
// все 2^5 − 1 = 31 непустых множества островов.
