// A. k-Факторизация
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Дано натуральное число n. Необходимо разложить его ровно на k чисел, таких, что
// все числа строго больше 1, а их произведение равно n, либо сообщить о том,
// что это невозможно.

// Входные данные
// В единственной строке заданы два числа n и k (2 ≤ n ≤ 100000, 1 ≤ k ≤ 20).

// Выходные данные
// Если разложить n на k множителей невозможно, выведите -1.

// Иначе выведите k натуральных чисел, таких, что их произведение в точности равно n.
// Числа можно выводить в любом порядке. Если возможных ответов несколько,
// выведите любой из них.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 100000 2
// ======================================================================
// Выходные данные
// ======================================================================
// 2 50000

// ======================================================================
// Входные данные
// ======================================================================
// 100000 20
// ======================================================================
// Выходные данные
// ======================================================================
// -1

// ======================================================================
// Входные данные
// ======================================================================
// 1024 5
// ======================================================================
// Выходные данные
// ======================================================================
// 2 64 2 2 2
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

vector<int> facto(int x)
{
    vector<int> res;
    int c = 2;
    while (x != 1)
    {
        while (x % c == 0)
        {
            x /= c;
            res.push_back(c);
        }
        c++;
    }

    return res;
}

void solve()
{
    int n, k;
    cin >> n >> k;
    vector<int> a = facto(n);
    if (a.size() < k)
    {
        cout << "-1";
        return;
    }
    if (a.size() == k)
    {
        for (auto &i : a)
            cout << i << ' ';
        return;
    }
    int r = 1;
    for (int i = 0; i < a.size() - k + 1; i++)
        r *= a[i];
    cout << r << ' ';
    for (int i = a.size() - k + 1; i < a.size(); i++)
        cout << a[i] << ' ';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
