// B. Шерлок и его девушка
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// У Шерлока новая девушка (так необычно для него!). Приближается День Святого
// Валентина, и он хочет подарить ей украшения.

// Шерлок купил n украшений. Цена i-го украшения равняется i + 1, то есть цены
// украшений равны 2, 3, 4, …, n + 1.

// Ватсон поставил перед Шерлоком задачу раскрасить эти украшения так, чтобы два
// украшения имели разный цвет, если цена одного из них является простым делителем
// цены другого. Кроме того, Ватсон хочет, чтобы Шерлок использовал как можно меньше
// различных цветов.

// Помогите Шерлоку выполнить эту простейшую задачу.

// Входные данные
// Единственная строка содержит одно целое число n (1 ≤ n ≤ 100000) — количество
// украшений.

// Выходные данные
// В первую строку выведите одно целое число k — минимальное число цветов, которое
// необходимо использовать.

// Во вторую строку выведите n целых чисел (в диапазоне от 1 до k), которые задают
// цвета каждого украшения в порядке увеличения цены.

// Если есть несколько способов раскрасить украшения, используя k цветов, выведите
// любой из них.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 3
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// 1 1 2

// ======================================================================
// Входные данные
// ======================================================================
// 4
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// 2 1 1 2
// ======================================================================

// Примечание
// В первом примере мы раскрасили украшения с ценой 2, 3 и 4 в цвета 1, 1 и 2
// соответственно.

// Так как 2 является простым делителем 4, то цвета украшений с ценами 2 и 4 должны
// быть различными.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<bool> primes(n + 2, true);
    if (n <= 2)
    {
        cout << "1\n";
        for (int i = 0; i < n; i++)
            cout << "1 ";
        return;
    }

    for (int i = 2; i * i <= n + 1; i++)
        if (primes[i])
            for (int j = i * i; j <= n + 1; j += i)
                primes[j] = false;

    cout << "2\n";
    for (int i = 2; i <= n + 1; i++)
    {
        cout << (primes[i] ? 2 : 1) << ' ';
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
