// A. Истоки и стоки
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вам задан ориентированный граф списком его дуг.

// Истоком ориентированного графа называется вершина u, для которой не существует
// вершины v, такой что v смежна с u (нет входящих в u дуг).

// Стоком ориентированного графа называется вершина u, для которой не существует
// вершины v, такой что u смежна с v (нет исходящих из u дуг).

// Посчитайте количество истоков и стоков заданного графа.

// Входные данные
// В первой строке находится целое число t (1 ≤ t ≤ 10^5) — количество наборов
// входных данных в тесте. Далее следуют t наборов входных данных. Перед каждым
// набором входных данных записана пустая строка.

// В первой строке каждого набора содержатся два целых числа n и m (1 ≤ n ≤ 10^5,
// 0 ≤ m ≤ 10^5), где n — количество вершин в графе, m — количество дуг в графе.

// В следующих m строках записаны дуги, по одной дуге в строке. Каждая дуга
// характеризуется двумя целыми числами u и v (1 ≤ u, v ≤ n), где u — начало дуги,
// а v — конец дуги (дуга направлена из u в v).

// В графе отсутствуют кратные дуги.

// Суммы n и m по всем наборам входных данных в одном тесте не превосходят 10^5.

// Выходные данные
// Для каждого набора входных данных в отдельной строке выведите два целых числа,
// разделённых пробелом — количество истоков и стоков графа.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 3

// 2 1
// 1 2

// 2 3
// 1 1
// 1 2
// 2 2

// 5 0
// ======================================================================
// Выходные данные
// ======================================================================
// 1 1
// 0 0
// 5 5
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, m;
    cin >> n >> m;
    vector<pair<int, int>> a(n + 1, pair<int, int>{0, 0});
    // f исток (входящие)
    // s сток (исходящие)
    pair<int, int> res{0, 0};
    for (int i = 0; i < m; i++)
    {
        int x, y;
        cin >> x >> y; // из x -> y // s -> f
        a[y].first++;
        a[x].second++;
    }
    for (int i = 1; i <= n; i++)
    {
        if (!a[i].first)
            res.first++;
        if (!a[i].second)
            res.second++;
    }

    cout << res.first << ' ' << res.second << '\n';
    // for (int i = 1; i < n + 1; i++)
    // {
    //     cout << i << " : ";
    //     for (auto &j : a[i])
    //         cout << j << ' ';
    //     cout << '\n';
    // }
    // cout << "\n";
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
