// B. Функциональный граф
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вам задан ориентированный граф списком его дуг. За один ход можно либо добавить,
// либо удалить любую дугу из графа.

// Граф называется функциональным, если степень исхода каждой вершины равна 1.

// Найдите минимальное количество ходов, которое требуется, чтобы получить из заданного
// графа функциональный.

// Входные данные
// В первой строке находится целое число t (1 ≤ t ≤ 10^5) — количество наборов
// входных данных в тесте. Далее следуют t наборов входных данных. Перед каждым
// набором входных данных записана пустая строка.

// В первой строке каждого набора содержатся два целых числа n и m (1 ≤ n ≤ 10^5,
// 0 ≤ m ≤ 10^5), где n — количество вершин в графе, m — количество дуг в графе.

// В следующих m строках записаны дуги, по одной дуге в строке. Каждая дуга
// характеризуется двумя целыми числами u и v (1 ≤ u, v ≤ n), где u — начало дуги,
// а v — конец дуги (дуга направлена из u в v).

// В графе отсутствуют кратные дуги.

// Суммы n и m по всем наборам входных данных в одном тесте не превосходят 10^5.

// Выходные данные
// Для каждого набора входных данных в отдельной строке выведите одно целое число —
// минимальное количество ходов, которое требуется, чтобы получить из заданного графа
// функциональный.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 2

// 4 4
// 1 2
// 2 3
// 1 4
// 4 3

// 4 2
// 1 2
// 3 4
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// 2
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, m;
    cin >> n >> m;
    vector<int> a(n);
    for (int i = 0; i < m; i++)
    {
        int x, y;
        cin >> x >> y;

        a[--x] += 1;
    }
    int res = 0;
    for (auto &i : a)
    {
        // cout << i << ' ';
        res += abs(1 - i);
    }
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
