// D. Вторые соседи
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Вам задан ориентированный граф списком его дуг. Для каждой вершины v выведите все
// вершины, которые смежны хотя бы с одной вершиной, которая смежна с v, в возрастающем
// порядке.

// Входные данные
// В первой строке находится целое число t (1 ≤ t ≤ 10) — количество наборов входных
// данных в тесте. Далее следуют t наборов входных данных. Перед каждым набором
// входных данных записана пустая строка.

// В первой строке каждого набора содержатся два целых числа n и m (1 ≤ n ≤ 50,
// 0 ≤ m ≤ 200), где n — количество вершин в графе, m — количество дуг в графе.

// В следующих m строках записаны дуги, по одной дуге в строке. Каждая дуга
// характеризуется двумя целыми числами u и v (1 ≤ u, v ≤ n), где u — начало дуги,
// а v — конец дуги (дуга направлена из u в v).

// В графе отсутствуют кратные дуги.

// Выходные данные
// Для каждого набора входных данных выведите n строк. В i-й строке выведите номера
// вершин, которые смежны хотя бы с одной вершиной, которая смежна с i-й,
// в возрастающем порядке.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 1

// 7 8
// 1 2
// 2 3
// 2 6
// 2 7
// 5 2
// 4 2
// 7 4
// 6 5
// ======================================================================
// Выходные данные
// ======================================================================
// 3 6 7
// 4 5

// 3 6 7
// 3 6 7
// 2
// 2
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, m;
    cin >> n >> m;
    vector<vector<int>> a(n);
    for (int i = 0; i < m; i++)
    {
        int x, y;
        cin >> x >> y;
        y--;
        x--;
        a[x].push_back(y);
    }

    for (int i = 0; i < n; i++)
    {
        set<int> res;
        for (auto u : a[i])
            for (auto &v : a[u])
                res.insert(v);
        for (auto &j : res)
            cout << j + 1 << ' ';
        cout << '\n';
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
