// C. GCD сокровищница
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Скупой пират Димаш нашёл сокровищницу. Она представляет собой n кучек монет,
// пронумерованных от 1 до n. В i-й кучке находится ровно a_i монет. У пирата Димаша
// есть число x, с помощью которого он может воровать монеты из сокровищницы.
// Воровство происходит следующим образом:

// - Сначала он выбирает индекс 1 ≤ i ≤ n такой, что a_i > 0 и gcd*(a_i, x) ≠ 1.
//   Если таких индексов нет, пират останавливается.
// - Теперь обозначим gcd(a_i, x) как g. Пират ворует ровно g монет из кучки i,
//   после чего a_i уменьшается на g.
// - Наконец, он приравнивает x к g и продолжает воровать монеты.

// Ваша задача — помочь пирату своровать максимальное количество монет. Найдите
// максимальное количество монет, которое можно своровать из сокровищницы.

// * gcd(a_i, x) обозначает наибольший общий делитель (НОД) чисел a_i и x.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 10^4) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// Первая строка каждого набора входных данных содержит числа n и x
// (1 ≤ n, x ≤ 3·10^5) — количество кучек с монетами в сокровищнице и число пирата.

// Вторая строка каждого набора содержит n целых чисел a1, a2, …, a_n
// (1 ≤ a_i ≤ 3·10^5).

// Гарантируется, что сумма значений n по всем наборам входных данных не превосходит
// 3·10^5.

// Выходные данные
// Для каждого набора входных данных выведите одно число — максимальное количество
// монет, которое можно своровать.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 3 1
// 2 3 5
// 3 4
// 2 3 4
// 4 2
// 2 2 2 2
// 6 6
// 2 3 2 3 2 3
// 7 6
// 9 9 4 4 4 4 4
// ======================================================================
// Выходные данные
// ======================================================================
// 0
// 6
// 8
// 9
// 20
// ======================================================================

// Примечание
// В первом наборе входных данных пират не может ничего своровать.

// Во втором наборе входных данных пират ворует следующим образом.

// - Пират выбирает кучку под номером 3. Он забирает 4 монеты, после чего
//   сокровищница становится [2, 3, 0], а число x равным 4.
// - Пират выбирает кучку под номером 1. Он забирает 2 монеты, после чего
//   сокровищница становится [0, 3, 0], а число x равным 2.
// - Подходящих индексов не осталось, поэтому пират останавливается.

// Пират смог забрать 4 + 2 = 6 монет.
#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, x;
    cin >> n >> x;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;
    vector<int> dtx;
    for (int i = 2; i * i <= x; i++)
    {
        if (x % i == 0)
        {
            dtx.push_back(i);
            x /= i;
        }
    }
    if (x != 1)
        dtx.push_back(x);
    // sort(dtx.begin(), dtx.end());
    int res = 0;
    for (auto &d : dtx)
    {
        int tmp = 0;
        for (auto &i : a)
        {
            if (i % d == 0)
                tmp += i;
            res = max(res, tmp);
        }
    }
    // int k = dtx.size();
    // vector<int> smc(k, 0), totgcd(k, 0);
    // for (auto &num : a)
    // {
    //     for (int i = 0; i < k; i++)
    //     {
    //         if (num % dtx[i] == 0)
    //         {
    //             smc[i] += num;
    //             totgcd[i] = gcd(totgcd[i], num);
    //         }
    //     }
    // }
    // int res = 0;
    // for (int i = 0; i < k; i++)
    // {
    //     int d = dtx[i];
    //     if (d > 1 && totgcd[i] > 0)
    //         if (gcd(x, totgcd[i]) == d)
    //             res = max(res, smc[i]);
    // }
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
