// D. Горка в закулисье
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Среди людей из города GR ходит легенда о горке, которая ведёт в закулисье. Массив b,
// состоящий из m целых чисел, называется горкой, если существует индекс k (1 ≤ k ≤ m)
// такой, что выполняются следующие условия:

// - Первые k элементов возрастают. Формально, для всех i (1 ≤ i < k) выполняется
//   b_i < b_{i+1}.
// - Последние m − k + 1 элементов убывают. Формально, для всех i (k ≤ i < m) выполняется
//   b_i > b_{i+1}.

// Вам дан массив a, состоящий из n различных целых чисел. Вы можете делать следующую
// операцию произвольное количество раз:

// - Выберите любой индекс i (1 ≤ i ≤ n − 2).
// - Поменяйте местами a_i и a_{i+2} в массиве.

// Ваша задача — определить, возможно ли превратить массив a в горку, делая произвольное
// количество операций.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 10^4) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// Первая строка каждого набора входных данных содержит число n (1 ≤ n ≤ 2·10^5) —
// длина массива a.

// Вторая строка каждого набора входных данных содержит n различных целых чисел
// a1, a2, …, a_n (1 ≤ a_i ≤ n).

// Гарантируется, что сумма значений n по всем наборам входных данных не превышает 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите «YES», если массив a возможно сделать
// горкой. Иначе выведите «NO».

// Вы можете выводить каждую букву в любом регистре (строчную или заглавную). Например,
// строки «yEs», «yes», «Yes» и «YES» будут приняты как положительный ответ.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 7
// 3
// 2 1 3
// 4
// 1 2 3 4
// 6
// 5 3 4 6 2 1
// 6
// 1 5 2 3 6 4
// 7
// 1 2 3 4 7 5 6
// 5
// 5 4 1 3 2
// 6
// 4 1 3 2 6 5
// ======================================================================
// Выходные данные
// ======================================================================
// NO
// YES
// YES
// NO
// NO
// YES
// NO
// ======================================================================

// Примечание
// В первом наборе входных данных массив a невозможно превратить в горку.

// Во втором наборе входных данных массив a уже является горкой.

// В третьем наборе входных данных вы можете выполнить операции следующим образом:

// - Поменяйте местами a1 и a3. После этой операции массив a станет [4, 3, 5, 6, 2, 1].
// - Поменяйте местами a2 и a4. После этой операции массив a станет [4, 6, 5, 3, 2, 1].

// И массив [4, 6, 5, 3, 2, 1] является горкой.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> ch, nch;
    for (int i = 0; i < n; i++)
    {
        int x;
        cin >> x;
        if (i % 2 == 0)
            nch.push_back(x);
        else
            ch.push_back(x);
    }
    sort(ch.begin(), ch.end());
    sort(nch.begin(), nch.end());
    int chs = ch.size(), nchs = nch.size();

    int l = 0, r = n - 1, pch = 0, pnch = 0;

    while (l < r)
    {
        int vlch = (pch < chs ? ch[pch] : 1e10);
        int vlnch = (pnch < nchs ? nch[pnch] : 1e10);

        if (vlnch < vlch)
        {
            if (l % 2 == 0)
                l++;
            else if (r % 2 == 0)
                r--;
            else
            {
                cout << "NO\n";
                return;
            }
            pnch++;
        }
        else
        {
            if (l % 2 != 0)
                l++;
            else if (r % 2 != 0)
                r--;
            else
            {
                cout << "NO\n";
                return;
            }
            pch++;
        }
    }
    cout << "YES\n";
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
