// A. Кузнечик собирает монеты
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Кузнечик прыгает по столбикам, расположенным на одной линии на равных расстояниях
// друг от друга. Столбики имеют порядковые номера от 1 до n. В начале Кузнечик сидит
// на столбике с номером 1 и хочет добраться до столбика с номером n. Он может прыгнуть
// вперёд на расстояние от 1 до k столбиков, считая от текущего.

// На каждом столбике Кузнечик может получить или потерять несколько золотых монет
// (для каждого столбика это число известно). Определите, как нужно прыгать Кузнечику,
// чтобы собрать наибольшее количество золотых монет. Учитывайте, что Кузнечик не может
// прыгать назад.

// Входные данные
// В первой строке вводятся два натуральных числа: n и k (3 ≤ n ≤ 10000, 1 ≤ k ≤ 10000),
// разделённые пробелом. Во второй строке записаны через пробел n − 2 целых числа —
// количество монет, которое Кузнечик получает на каждом столбике, от 2-го до (n−1)-го.
// Если это число отрицательное, Кузнечик теряет монеты. Гарантируется, что все числа
// по модулю не превосходят 10000.

// Выходные данные
// В первой строке программа должна вывести наибольшее количество монет, которое может
// собрать Кузнечик. Во второй строке выводится число прыжков Кузнечика, а в третьей
// строке — номера всех столбиков, которые посетил Кузнечик (через пробел в порядке
// возрастания).

// Если правильных ответов несколько, выведите любой из них.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5 3
// 2 -3 5
// ======================================================================
// Выходные данные
// ======================================================================
// 7
// 3
// 1 2 4 5

// ======================================================================
// Входные данные
// ======================================================================
// 10 3
// -13 -2 -14 -124 -9 -6 -5 -7
// ======================================================================
// Выходные данные
// ======================================================================
// -16
// 4
// 1 3 6 8 10

// ======================================================================
// Входные данные
// ======================================================================
// 12 5
// -5 -4 -3 -2 -1 1 2 3 4 5
// ======================================================================
// Выходные данные
// ======================================================================
// 14
// 7
// 1 6 7 8 9 10 11 12
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

void solve()
{
    int n, k;
    cin >> n >> k;
    vector<int> a(n + 1, 0), dp(n + 1, -1e18), p(n + 1, 0);
    for (int i = 2; i < n; i++)
        cin >> a[i];

    dp[1] = 0;
    for (int i = 2; i <= n; i++)
    {
        int best_j = -1;
        for (int j = i - 1; j >= max(1, i - k); j--)
            if (best_j == -1 || dp[j] > dp[best_j])
                best_j = j;
        dp[i] = dp[best_j] + a[i];
        p[i] = best_j;
    }

    vector<int> res;
    int cur = n;
    while (cur != 0)
    {
        res.push_back(cur);
        cur = p[cur];
    }
    reverse(res.begin(), res.end());
    cout << dp[n] << '\n';
    cout << res.size() - 1 << '\n';
    for (auto &i : res)
        cout << i << ' ';
}

int main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
