// B. Черепаха и монеты
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Черепаха хочет переползти из левого верхнего угла поля размером n на m клеток
// (2 ≤ n, m ≤ 1000) в правый нижний. За один шаг она может переместиться на соседнюю
// клетку вправо или на соседнюю клетку вниз. Кроме того, проходя через каждую клетку,
// Черепаха получает (или теряет) несколько золотых монет (это число известно для каждой
// клетки).

// Определите, какое максимальное количество монет может собрать Черепаха по пути
// и как ей нужно идти для этого.

// Входные данные
// В первой строке вводятся два натуральных числа: n и m (2 ≤ n, m ≤ 1000),
// разделённые пробелом. В каждой из следующих n строк записаны через пробел по m чисел
// a_{ij} (|a_{ij}| ≤ 10), которые обозначают количество монет, получаемых Черепашкой
// при проходе через каждую клетку. Если это число отрицательное, Черепашка теряет монеты.

// Выходные данные
// В первой строке программа должна вывести наибольшее количество монет, которое может
// собрать Черепаха. Во второй строке без пробелов выводятся команды, которые нужно
// выполнить Черепахе: буква 'R' (от слова right) обозначает шаг вправо, а буква 'D'
// (от слова down) — шаг вниз.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 3 3
// 0 2 -3
// 2 -5 7
// 1 2 0
// ======================================================================
// Выходные данные
// ======================================================================
// 6
// RRDD

// ======================================================================
// Входные данные
// ======================================================================
// 4 5
// 4 5 3 2 9
// 4 6 7 5 9
// 5 2 5 -3 -10
// 3 5 2 9 3
// ======================================================================
// Выходные данные
// ======================================================================
// 41
// RDRDDRR
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, m;
    cin >> n >> m;
    vector<vector<int>> a(n, vector<int>(m)), dp(n, vector<int>(m, -1e18));
    for (auto &i : a)
        for (auto &j : i)
            cin >> j;

    dp[0][0] = a[0][0];
    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < m; j++)
        {
            if (i > 0)
                dp[i][j] = max(dp[i][j], dp[i - 1][j] + a[i][j]);
            if (j > 0)
                dp[i][j] = max(dp[i][j], dp[i][j - 1] + a[i][j]);
        }
    }
    string res = "";
    int i = n - 1, j = m - 1;
    while (i || j)
    {

        if (j > 0 && dp[i][j - 1] == dp[i][j] - a[i][j])
        {
            j--;
            res.push_back('R');
        }
        else
        {
            i--;
            res.push_back('D');
        }
    }
    reverse(res.begin(), res.end());
    cout << dp[n - 1][m - 1] << '\n';
    cout << res;
    // for (auto &i : dp)
    // {
    //     for (auto &j : i)
    //         cout << j << ' ';
    //     cout << '\n';
    // }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
