// C. Наибольшая возрастающая подпоследовательность
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Пусть a1, a2, ..., an — числовая последовательность. Длина последовательности — это
// количество элементов этой последовательности. Последовательность ai1, ai2, ..., aik
// называется подпоследовательностью последовательности a, если
// 1 ≤ i1 < i2 < ... < ik ≤ n. Последовательность a называется возрастающей, если
// a1 < a2 < ... < an.

// Вам дана последовательность, содержащая n целых чисел. Найдите её самую длинную
// возрастающую подпоследовательность.

// Входные данные
// В первой строке задано одно число n (1 ≤ n ≤ 2000) — длина подпоследовательности.
// В следующей строке задано n целых чисел ai (−10^9 ≤ ai ≤ 10^9) — элементы
// последовательности.

// Выходные данные
// В первой строке выведите число k — длину наибольшей возрастающей подпоследовательности.
// В следующей строке выведите k чисел — саму подпоследовательность.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 8
// 1 4 1 5 3 3 4 2
// ======================================================================
// Выходные данные
// ======================================================================
// 3
// 1 4 5

// ======================================================================
// Входные данные
// ======================================================================
// 3
// 1 2 3
// ======================================================================
// Выходные данные
// ======================================================================
// 3
// 1 2 3
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, mxl = 1, mxlinx = 0;
    cin >> n;
    vector<int> a(n), dp(n, 1), p(n, -1);
    for (auto &i : a)
        cin >> i;

    for (int r = 0; r < n; r++)
    {
        for (int l = 0; l < r; l++)
        {
            if (a[l] < a[r] && dp[l] + 1 > dp[r])
            {
                dp[r] = dp[l] + 1;
                p[r] = l;
            }
        }

        if (dp[r] > mxl)
        {
            mxl = dp[r];
            mxlinx = r;
        }
    }
    cout << mxl << '\n';
    vector<int> res;
    while (mxlinx != -1)
    {
        res.push_back(a[mxlinx]);
        mxlinx = p[mxlinx];
    }
    for (auto i = res.rbegin(); i != res.rend(); i++)
        cout << *i << ' ';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
