// A. Сбалансированная подстрока
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Дана строка s, состоящая из n букв, каждая буква — либо 'a', либо 'b'. Буквы в строке
// пронумерованы от 1 до n.

// s[l;r] — это подстрока подряд идущих букв с позиции l до позиции r строки включительно.

// Строка называется сбалансированной, если количество букв 'a' в ней равно количеству
// букв 'b'. Например, строки «baba» и «aabbab» сбалансированные, а строки «aaab» и «b» — нет.

// Найдите любую непустую сбалансированную подстроку s[l;r] строки s. Выведите её l и r
// (1 ≤ l ≤ r ≤ n). Если таких подстрок нет, то выведите −1 −1.

// Входные данные
// В первой строке записано одно целое число t (1 ≤ t ≤ 1000) — количество наборов
// входных данных.

// Затем следуют описания t наборов входных данных.

// В первой строке каждого набора входных данных записано одно целое число n (1 ≤ n ≤ 50) —
// длина строки.

// Во второй строке каждого набора входных данных записана строка s, состоящая из n букв,
// каждая буква — либо 'a', либо 'b'.

// Выходные данные
// На каждый набор входных данных выведите два целых числа. Если существует непустая
// сбалансированная подстрока s[l;r], то выведите l r (1 ≤ l ≤ r ≤ n). В противном
// случае выведите −1 −1.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 1
// a
// 6
// abbaba
// 6
// abbaba
// 9
// babbabbaa
// ======================================================================
// Выходные данные
// ======================================================================
// -1 -1
// 1 6
// 3 6
// 2 5
// ======================================================================

// Примечание
// В первом наборе входных данных нет непустых сбалансированных подстрок.

// Во втором и в третьем наборах входных данных есть несколько сбалансированных подстрок,
// включая всю строку «abbaba» и подстроку «baba».

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    string s;
    cin >> n >> s;
    int cnt_a = 0, res_l = -1, res_r = -1;
    for (int i = 0; i < n - 1; i++)
    {
        if (s[i] != s[i + 1])
        {
            res_l = i + 1;
            res_r = i + 2;
            break;
        }
    }

    cout << res_l << ' ' << res_r << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
