// C. Математичное сложение
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Иван решил подготовиться к контрольной работе по решению уравнений в целых числах.
// Он заметил, что все задания в контрольной имеют следующий вид:

// Вам даны два положительных целых числа u и v, найдите любую пару целых чисел
// (необязательно положительных) x и y таких, что:

// x/u + y/v = (x + y) / (u + v).

// Решение x = 0, y = 0 запрещено, поэтому вы должны найти любое решение с (x, y) ≠ (0, 0).

// Пожалуйста, помогите Ивану решить некоторые уравнения такого вида.

// Входные данные
// Первая строка содержит единственное целое число t (1 ≤ t ≤ 10^3) — количество наборов
// входных данных. Далее следует описание наборов входных данных.

// Единственная строка описания каждого набора входных данных содержит два целых числа
// u и v (1 ≤ u, v ≤ 10^9) — параметры уравнения.

// Выходные данные
// Для каждого набора входных данных выведите два целых числа x и y — возможное решение
// уравнения. Должно быть выполнено, что −10^18 ≤ x, y ≤ 10^18 и (x, y) ≠ (0, 0).

// Можно показать, что ответ всегда существует. Если существует несколько возможных
// решений, вы можете вывести любое из них.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 1 1
// 2 3
// 3 5
// 6 9
// ======================================================================
// Выходные данные
// ======================================================================
// -1 1
// -4 9
// -18 50
// -4 9
// ======================================================================

// Примечание
// В первом наборе входных данных: −1/1 + 1/1 = 0 = (−1 + 1) / (1 + 1).

// Во втором наборе входных данных: −4/2 + 9/3 = 1 = (−4 + 9) / (2 + 3).

// В третьем наборе входных данных: −18/3 + 50/5 = 4 = (−18 + 50) / (3 + 5).

// В четвёртом наборе входных данных: −4/6 + 9/9 = 13 = (−4 + 9) / (6 + 9).

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int u, v;
    cin >> u >> v;
    int x = -(u * u), y = v * v;
    int n = gcd(x, y);
    cout << x / n << ' ' << y / n << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
