// A. Опять двадцать пять!
// ограничение по времени на тест0.5 секунд
// ограничение по памяти на тест64 мегабайта

// HR-менеджер опять был расстроен. Очередной кандидат так же провалил собеседование,
// как и 24 предыдущих. «Неужели я даю такое сложное задание? — думал HR-менеджер. —
// Всего лишь возвести число 5 в степень n и узнать последние две цифры числа. Да,
// конечно, n может быть большим, и на калькуляторе такую степень не посчитать,
// но нам и нужны люди, способные думать, а не только инструкции исполнять.»

// А вы смогли бы пройти собеседование в компании, занимающейся машинным зрением
// в ИТ-граде?

// Входные данные
// Единственная строка входных данных содержит одно целое число n (2 ≤ n ≤ 2·10^18) —
// степень, в которую вам нужно возвести число 5.

// Выходные данные
// Выведите последние две цифры числа 5^n без пробелов между ними.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 2
// ======================================================================
// Выходные данные
// ======================================================================
// 25
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    cout << 25;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
