// B. Закон Мура
// ограничение по времени на тест0.5 секунд
// ограничение по памяти на тест64 мегабайта

// Мэрия ИТ-града решила установить на главной площади города символ
// научно-технического прогресса — табло, в реальном времени демонстрирующее
// действие закона Мура.

// Закон Мура заключается в том, что количество транзисторов, размещаемых
// на кристалле интегральной схемы, удваивается каждые 24 месяца. Следствием
// закона Мура является то, что примерно так же экспоненциально от времени
// растёт и производительность компьютеров.

// Вам нужно подготовить для отображения на табло информацию, которая будет
// меняться каждую секунду. Будем считать, что каждую секунду количество
// транзисторов увеличивается ровно в 1.000000011 раз.

// Входные данные
// Единственная строка входных данных содержит пару целых чисел n (1000 ≤ n ≤ 10 000)
// и t (0 ≤ t ≤ 2 000 000 000) — количество транзисторов в начальный момент времени
// и количество секунд, прошедших с начального момента времени.

// Выходные данные
// Выведите одно число — оценку количества транзисторов на кристалле через t секунд
// после начального момента. Относительная погрешность Вашего ответа не должна
// превышать 10^{-6}.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 1000 1000000
// ======================================================================
// Выходные данные
// ======================================================================
// 1011.060722383550382782399454922040
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long double

void solve()
{
    const int Ex = 1.000000011;
    int n, t;
    cin >> n >> t;

    cout << setprecision(30) << n * pow(Ex, t);
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
