// D. Шестиугольники!
// ограничение по времени на тест0.5 секунд
// ограничение по памяти на тест64 мегабайта

// После успешного прохождения испытательного срока в компании ИТ-града, которая
// занимается играми, Петя вошёл в группу программистов, создающих новую пошаговую
// стратегию в стиле известной «Heroes of Might & Magic». Одним из элементов игры
// являются пошаговые бои больших отрядов противников на бесконечных полях, где каждая
// ячейка представляет собой шестиугольник.

// Некоторые из магических эффектов персонажей способны воздействовать сразу на
// несколько ячеек поля, которые находятся от ячейки применения эффекта на расстоянии
// не более n. Расстоянием между ячейками называется минимальное количество переходов
// через границу ячейки, позволяющее попасть из одной выбранной ячейки в другую.

// Легко заметить, что количество ячеек, которое подпадает под магический эффект,
// достаточно быстро растёт при увеличении n, что может отрицательно сказываться
// на производительности игры. Поэтому Петя решил написать программу, которая бы
// по числу n определяла количество ячеек, которые придётся перерисовать при
// применении эффекта, чтобы гейм-дизайнеры могли поддерживать баланс между
// масштабностью эффектов и производительностью игры. Помогите ему в этом.
// Найдите количество шестиугольников, расстояние от которых до заданной клетки
// не превышает n.

// Входные данные
// Единственная строка входных данных содержит одно целое число n (0 ≤ n ≤ 10^9).

// Выходные данные
// Выведите одно целое число — количество шестиугольников, расстояние от которых
// до заданной клетки не превышает n.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 2
// ======================================================================
// Выходные данные
// ======================================================================
// 19
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    cout << (n * (1 + n)) / 2 * 6 + 1;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
