// F. Подбор кадров
// ограничение по времени на тест0.5 секунд
// ограничение по памяти на тест64 мегабайта

// В одной из компаний ИТ-града было принято решение создать группу инновационных
// разработок численностью от 5 до 7 человек и набрать для этого новых сотрудников.
// После размещения объявлений в компанию поступило n анкет. Теперь отделу кадров
// предстоит непростая задача оценить каждый возможный состав группы и выбрать один
// из них. Ваша задача — посчитать, сколько вариантов состава новой группы необходимо
// будет рассмотреть отделу кадров.

// Входные данные
// Единственная строка входных данных содержит одно целое число n (7 ≤ n ≤ 777) —
// количество потенциальных новых сотрудников, приславших анкеты.

// Выходные данные
// Выведите одно целое число — количество различных вариантов состава новой группы.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 7
// ======================================================================
// Выходные данные
// ======================================================================
// 29
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long double

void solve()
{
    int n, res = 0;
    cin >> n;
    vector<int> faa(n - 4, 1);
    for (int i = 2; i <= n - 5; i++)
        faa[i] = faa[i - 1] * i;
    faa[0] = n;
    for (int k = 5; k <= 7; k++)
    {
        int t = n;
        for (int i = 1; i < n - k; i++)
            t *= (n - i);
        res += t / faa[n - k];
    }
    cout << setprecision(30) << round(res);
}

// n! /  k! (n - k)!

// 7 * 6 / 2
// 7 / 1
// 1/ 1

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
