// I. Автостоянка
// ограничение по времени на тест0.5 секунд
// ограничение по памяти на тест64 мегабайта

// Чтобы быстро набрать штат высококвалифицированных специалистов, одна из новых
// компаний ИТ-града пошла на беспрецедентный шаг. Она решила дарить каждому
// сотруднику автомобиль, причём сотрудник сам может выбрать одну из четырёх
// различных марок.

// Автостоянка перед офисом представляет собой одну линию из (2n − 2) парковочных мест.
// К сожалению, общее число машин оказалось больше, чем вместимость парковки. Более
// того, даже количество машин одной любой марки оказалось больше, чем количество
// парковочных мест! Поэтому свободных мест на стоянке не бывает никогда.

// Любуясь ровным рядом машин, директор подумал, что стоянка выглядела бы ещё красивее,
// если бы на ней нашлись ровно n подряд стоящих машин одинаковой марки. Помогите
// директору определить количество способов такого заполнения парковки.

// Входные данные
// Единственная строка входных данных содержит целое число n (3 ≤ n ≤ 30) — количество
// стоящих подряд машин одной марки.

// Выходные данные
// Выведите единственное целое число — количество способов заполнить стоянку машинами
// четырёх марок требуемым образом.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 3
// ======================================================================
// Выходные данные
// ======================================================================
// 24
// ======================================================================

// Примечание
// Обозначим марки так: A — Астон Мартин, B — Бентли, M — Мерседес-Майбах,
// Z — запорожец. Для n = 3 подходят следующие варианты заполнения стоянки:
// AAAB AAAM AAAZ ABBB AMMM AZZZ
// BBBA BBBM BBBZ BAAA BMMM BZZZ
// MMMA MMMB MMMZ MAAA MBBB MZZZ
// ZZZA ZZZB ZZZM ZAAA ZBBB ZMMM

// Изначально планировалось раздавать спортивные автомобили марок Феррари,
// Ламборджини, Мазерати и Бугатти, но от этой идеи отказались, поскольку по разбитым
// дорогам ИТ-града на этих автомобилях с маленьким клиренсом невозможно проехать.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    int k = (n << 1) - 2;
    int res = (2 * 4 * 3 * pow(4, k - n - 1)) + (k - n > 1 ? (k - n - 1) * 4 * 3 * 3 * pow(4, k - n - 2) : 0);
    cout << res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
