// A. Ты удаляешь, я удаляю
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Алисе и Бобу дана бинарная строка* s длины n. Она содержит как минимум один 0
// и как минимум одну 1.

// Они по очереди выполняют ровно одно действие в следующем порядке:

// - Сначала Алиса выбирает вхождение 0 в s и удаляет его.
// - Затем Боб выбирает вхождение 1 в получившейся строке и удаляет его.

// Алиса хочет, чтобы итоговая строка была лексикографически† как можно больше,
// а Боб хочет, чтобы она была лексикографически как можно меньше. Определите
// итоговую строку, если оба игрока действуют оптимально.

// * Бинарная строка — это строка, состоящая только из символов 0 и 1.

// † Для двух различных бинарных строк a и b одинаковой длины строка a
// лексикографически меньше строки b, если в первой позиции, где они различаются,
// у a стоит меньший символ.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 100) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// В единственной строке каждого набора входных данных дана бинарная строка s длины n
// (3 ≤ n ≤ 100).

// Гарантируется, что s содержит как минимум один 0 и как минимум одну 1.

// Выходные данные
// Для каждого набора входных данных выведите итоговую строку, если оба игрока
// действуют оптимально.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 101
// 11001
// 0010
// 0101010000010100100101
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 101
// 00
// 01010000010100100101
// ======================================================================

// Примечание
// В первом наборе входных данных Алиса обязана удалить единственный 0. Боб может
// удалить любое из двух вхождений 1, поэтому получается строка 1.

// Во втором наборе входных данных Алиса может удалить любое из двух вхождений 0.
// Боб оптимально удаляет одно из первых двух вхождений 1, поэтому получается
// строка 101.

// В третьем наборе входных данных Алиса может удалить любое вхождение 0. Затем
// Боб удаляет единственное вхождение 1, поэтому получается строка 00.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    string s;
    cin >> s;
    bool o = true, z = true;
    for (int i = 0; i < s.size(); i++)
    {
        if (!o && !z)
            break;
        if (s[i] == '0' && z)
        {
            s.erase(i, 1);
            z = !z;
            i--;
        }
        else if (s[i] == '1' && o)
        {
            s.erase(i, 1);
            o = !o;
            i--;
        }
    }
    cout << s << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
