// B. Слияние для совпадения
// ограничение по времени на тест1.5 секунд
// ограничение по памяти на тест256 мегабайт

// Даны два массива a и b длины n и m соответственно. Все n + m целых чисел в этих
// массивах различны.

// Над массивом a можно выполнять следующую операцию любое количество раз
// (возможно, ноль):

// - Выберите два элемента массива a со значениями x и y, где x ≤ y.
// - Удалите эти два элемента из массива a.
// - Вставьте в массив a одно целое число z такое, что x ≤ z ≤ y.

// После выполнения всех операций вы можете переставить элементы массива a
// в любом порядке.

// Определите, можно ли сделать массив a равным массиву b.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 10^4) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// В первой строке каждого набора входных данных содержатся два целых числа n и m
// (1 ≤ n, m ≤ 2·10^5) — длины массивов a и b.

// Во второй строке содержатся n целых чисел a1, a2, …, a_n (1 ≤ a_i ≤ 10^9).

// В третьей строке содержатся m целых чисел b1, b2, …, b_m (1 ≤ b_i ≤ 10^9).

// Гарантируется, что все n + m целых чисел в массивах a и b различны.

// Гарантируется, что сумма значений n по всем наборам входных данных не превосходит 2·10^5.
// Гарантируется, что сумма значений m по всем наборам входных данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите «YES», если можно сделать массив a
// равным массиву b, и «NO» в противном случае.

// Вы можете выводить каждую букву в любом регистре (строчную или заглавную). Например,
// строки «yEs», «yes», «Yes» и «YES» будут приняты как положительный ответ.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 11
// 2 1
// 1 3
// 2
// 3 2
// 1 3 5
// 2 4
// 4 2
// 1 3 5 7
// 4 6
// 4 2
// 2 5 8 11
// 1 10
// 4 2
// 1 4 7 9
// 3 10
// 5 2
// 10 1 100 6 4
// 90 5
// 6 3
// 1 4 10 20 30 40
// 3 15 35
// 4 2
// 1 2 3 100
// 4 5
// 7 3
// 1 8 3 30 18 12 25
// 2 15 28
// 4 1
// 1 2 3 5
// 4
// 4 2
// 1 3 5 6
// 2 4
// ======================================================================
// Выходные данные
// ======================================================================
// YES
// NO
// YES
// NO
// NO
// YES
// YES
// NO
// YES
// YES
// YES
// ======================================================================

// Примечание
// В первом наборе входных данных выберите 1 и 3, удалите их и вставьте 2.

// Во втором наборе входных данных можно показать, что никакая последовательность
// операций не может сделать массив a равным массиву b.

// В третьем наборе входных данных выберите 1 и 5, удалите их и вставьте 4. Затем
// выберите 3 и 7, удалите их и вставьте 6.

// В шестом наборе входных данных сначала выберите 1 и 10, удалите их и вставьте 5.
// Затем выберите 6 и 100, удалите их и вставьте 90. Наконец, выберите 4 и 5,
// удалите их и вставьте 5.

// В седьмом наборе входных данных для пар (1, 4), (10, 20) и (30, 40) удалите оба
// элемента и вставьте 3, 15 и 35 соответственно.

// В девятом наборе входных данных удалите пары (1, 3), (8, 18) и (25, 30) и вставьте
// 2, 15 и 28 соответственно. Затем удалите 12 и 15 и вставьте 15.

// В десятом наборе входных данных сначала выберите 1 и 2, удалите их и вставьте 2.
// Затем выберите 2 и 3, удалите их и вставьте 3. А после выберите 3 и 5, удалите их
// и вставьте 4.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, m;
    cin >> n >> m;
    vector<int> a(n), b(m);
    for (auto &i : a)
        cin >> i;
    for (auto &i : b)
        cin >> i;

    if (m * 2 > n)
    {
        cout << "NO\n";
        return;
    }
    sort(a.begin(), a.end());
    sort(b.begin(), b.end());
    vector<int> r(m), l(m);
    for (int i = 0; i < m; i++)
    {
        l[i] = a[i];
        r[i] = a[n - m + i];
        if (!(l[i] < b[i] && r[i] > b[i]))
        {
            cout << "NO\n";
            return;
        }
    }
    cout << "YES\n";
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
