// C. Число пар равных
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Даны два массива a и b, отсортированные по неубыванию. Найдите число пар (i, j),
// для которых a_i = b_j.

// Входные данные
// В первой строке записаны числа n и m — размеры массивов (1 ≤ n, m ≤ 10^5).
// Во второй строке находятся n чисел a_i — элементы первого массива,
// в третьей строке находятся m чисел b_i — элементы второго массива
// (−10^9 ≤ a_i, b_i ≤ 10^9).

// Выходные данные
// Выведите одно число — ответ на задачу.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 8 7
// 1 1 3 3 3 5 8 8
// 1 3 3 4 5 5 5
// ======================================================================
// Выходные данные
// ======================================================================
// 11
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long // Защита от переполнения int

void solve()
{
    int n, m;
    cin >> n >> m;
    vector<int> a(n), b(m);

    for (int i = 0; i < n; i++)
        cin >> a[i];
    for (int i = 0; i < m; i++)
        cin >> b[i];

    int ai = 0, bi = 0, res = 0;
    while (ai < n && bi < m)
    {
        if (a[ai] < b[bi])
            ai++;
        else if (a[ai] > b[bi])
            bi++;
        else
        {
            int cur_val = a[ai], c_a = 0, c_b = 0;

            while (ai < n && a[ai] == cur_val)
            {
                c_a++;
                ai++;
            }

            while (bi < m && b[bi] == cur_val)
            {
                c_b++;
                bi++;
            }

            res += c_a * c_b;
        }
    }

    cout << res;
}

int32_t main()
{
    // Включаем супер-быстрый ввод-вывод для C++
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
