// A. K-е число в объединении отрезков
// ограничение по времени на тест0.5 секунд
// ограничение по памяти на тест256 мегабайт

// Заданы n отрезков целых чисел [l1, r1], [l2, r2], …, [ln, rn]. Выпишем в массив
// все числа из этих отрезков. Если некоторое число содержится более чем в одном
// отрезке, то в массиве оно должно встречаться столько раз, в каком количестве
// отрезков оно содержится. То есть длина массива равна сумме количеств чисел
// во всех отрезках.

// После этого массив сортируется. Требуется вывести число в позиции k
// (нумерация начинается с 0) в нём.

// Входные данные
// В первой строке заданы n и k (1 ≤ n ≤ 50, 0 ≤ k ≤ 2·10^9). Далее в n строках
// заданы отрезки в виде пар l_i, r_i (−2·10^9 ≤ l_i ≤ r_i ≤ 2·10^9). Гарантируется,
// что k-е число в объединении существует.

// Выходные данные
// Выведите искомое значение.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 2 4
// 1 3
// 5 7
// ======================================================================
// Выходные данные
// ======================================================================
// 6

// ======================================================================
// Входные данные
// ======================================================================
// 2 3
// 1 4
// 3 5
// ======================================================================
// Выходные данные
// ======================================================================
// 3

// ======================================================================
// Входные данные
// ======================================================================
// 1 1500000091
// -1500000000 1500000000
// ======================================================================
// Выходные данные
// ======================================================================
// 91
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long // Защита от переполнения int

int solv_count(int l, int r, int x)
{
    if (x <= l)
        return 0;
    return min(r + 1, x) - l;
}

bool check(int mid, int k, vector<pair<int, int>> &a, int n)
{
    int l = 0;
    for (int i = 0; i < n; i++)
    {
        l += solv_count(a[i].first, a[i].second, mid);
    }

    return l <= k;
}

void solve()
{
    int n, k, l = 2e10, r = -2e10;
    cin >> n >> k;
    vector<pair<int, int>> a(n);

    for (int i = 0; i < n; i++)
    {
        cin >> a[i].first >> a[i].second;
        if (a[i].first < l + 1)
            l = a[i].first;
        if (a[i].second > r - 1)
            r = a[i].second + 1;
    }

    while (r > l + 1)
    {
        int mid = (l + r) / 2;
        if (check(mid, k, a, n))
            l = mid;
        else
            r = mid;
    }
    cout << l;
}

int32_t main()
{
    // Включаем супер-быстрый ввод-вывод для C++
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
