// B. Таблица умножения
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Петя составил таблицу умножения размера n × n. Ячейка в i-й строке и j-м столбце
// содержит значение i · j. Петю заинтересовал вопрос: какое число в таблице является
// k-м по возрастанию? Помогите Пете ответить на этот вопрос.

// Входные данные
// Ввод содержит два целых числа n и k (1 ≤ n ≤ 10^5, 1 ≤ k ≤ n^2).

// Выходные данные
// Выведите одно число — k-е число по возрастанию в таблице.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 3 4
// ======================================================================
// Выходные данные
// ======================================================================
// 3

// ======================================================================
// Входные данные
// ======================================================================
// 5 16
// ======================================================================
// Выходные данные
// ======================================================================
// 10
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long // Защита от переполнения int

bool check(int x, int k, int n)
{
    int res = 0;

    for (int i = 1; i <= n; i++)
    {
        res += min(n, x / i);
    }

    return res >= k;
}
// 1  2  3  4  5
// 2  4  6  8 10
// 3  6  9 12 15
// 4  8 12 16 20
// 5 10 15 20 25
void solve()
{
    int n, k, l = 0, r;
    cin >> n >> k;
    r = n * n + 1;

    while (r > l + 1)
    {
        int mid = (l + r) / 2;
        if (check(mid, k, n))
            r = mid;
        else
            l = mid;
    }
    cout << r;
}

int32_t main()
{
    // Включаем супер-быстрый ввод-вывод для C++
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
