// C. K-я сумма
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Есть два массива a и b, каждый из которых состоит из n чисел. Для каждой пары чисел
// (i, j): 1 ≤ i, j ≤ n выпишем сумму чисел a_i + b_j. Найдите в полученном множестве
// сумм k-ю по возрастанию.

// Входные данные
// Первая строка содержит целые числа n и k (1 ≤ n ≤ 10^5, 1 ≤ k ≤ n^2). Вторая строка
// содержит элементы массива a, третья строка содержит элементы массива b. Все элементы
// массивов — целые положительные числа, не больше 10^9.

// Выходные данные
// Выведите одно число — искомая k-я сумма.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5 10
// 4 2 6 4 8
// 7 3 1 9 5
// ======================================================================
// Выходные данные
// ======================================================================
// 9
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long // Защита от переполнения int

bool check(int mid, int k, vector<int> &a, vector<int> &b, int n)
{
    int count = 0, bi = n - 1;
    for (int ai = 0; ai < n; ai++)
    {
        while (bi >= 0 && a[ai] + b[bi] > mid)
            bi--;
        count += bi + 1;
    }

    return count >= k;
}

void solve()
{
    int n, k;
    cin >> n >> k;
    vector<int> a(n), b(n);

    for (int i = 0; i < n; i++)
        cin >> a[i];
    for (int i = 0; i < n; i++)
        cin >> b[i];

    int l = 1, r = 1e18;

    sort(a.begin(), a.end());
    sort(b.begin(), b.end());

    while (r > l + 1)
    {
        int mid = (l + r) / 2;
        if (check(mid, k, a, b, n))
            r = mid;
        else
            l = mid;
    }
    cout << r;
}

int32_t main()
{
    // Включаем супер-быстрый ввод-вывод для C++
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
