// A. Нечётный ластик
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Дан массив a1, a2, …, a_n. К нему можно применить следующую операцию произвольное
// количество раз (возможно, ни одного):

// - Выберите целое число k ≥ 1 такое, что 2k + 1 ≤ m, и 2k + 1 индексов
//   i1, i2, …, i_{2k+1} (1 ≤ i1 < i2 < … < i_{2k+1} ≤ m), где m — текущая длина
//   массива. Затем удалите i_{k+1}-й элемент из массива.

// Заметим, что после каждой операции длина массива уменьшается на один, а оставшиеся
// части массива соединяются.

// Пусть b1, b2, …, b_m — массив, оставшийся после всех операций.

// Каково максимально возможное значение gcd(b1, b2, …, b_m), где gcd массива чисел
// обозначает их наибольший общий делитель (НОД)?

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 500) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// В первой строке каждого набора входных данных содержится n (1 ≤ n ≤ 100) —
// размер массива.

// Во второй строке каждого набора входных данных содержатся n целых чисел
// a1, a2, …, a_n (1 ≤ a_i ≤ 10^9).

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — максимально возможное
// значение.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 7
// 2 4 6 7 8 9 10
// 2
// 55 55555
// 4
// 1000000 1000 1 1000000000
// 5
// 23 32 23 32 23
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// 5
// 1000000
// 23
// ======================================================================

// Примечание
// В первом наборе входных данных дан массив [2, 4, 6, 7, 8, 9, 10].

// При выборе индексов [1, 3, 4, 6, 7] удаляется a4 = 7, и получается массив
// [2, 4, 6, 8, 9, 10].

// Затем при выборе индексов [2, 5, 6] удаляется a5 = 9, и получается массив
// [2, 4, 6, 8, 10]. Получить ответ больше 2 невозможно.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;

    if (n == 1)
        cout << a[0] << '\n';
    else
        cout << gcd(a[0], a[n - 1]) << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
