// B1. Нарезка моркови (простая версия)
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Это простая версия задачи. Отличие между версиями заключается в том, что в этой
// версии вам нужно решить задачу только для k = 1. Вы можете делать взломы только
// в том случае, если решили все версии этой задачи.

// Алп любит морковь. Поскольку он ещё не обедал, он хочет купить морковный салат,
// чтобы поесть на улице. Однако у него есть странная навязчивая идея: все морковки
// должны быть в точности одинаковой длины, иначе салат кажется ему неэстетичным.
// Так как Алп находится посреди улицы и у него нет ножа, он не может нарезать морковь
// самостоятельно. Вам нужно разделить все морковки с помощью своей машины и продать
// их Алпу.

// Вам даны n вкусных морковок размером a1, a2, …, a_n. Также вам дана машина для
// нарезки, которая работает следующим образом.

// Каждый раз вы выбираете множество морковок (можно выбирать уже нарезанные морковки)
// и положительное целое число x (не обязательно одинаковое для каждой операции).
// После этого рассмотрим каждую выбранную морковку, пусть её длина равна l.
// Если l ≤ x, эта морковка не изменяется, иначе она разделяется на две морковки
// размером x и l − x.

// Мы хотим продать часть финальных морковок заинтересованному покупателю, который
// хочет, чтобы все они были одинаковой длины.

// Определите максимальное количество морковок, которое мы можем продать после ровно k
// использований машины. Решите задачу только для k = 1.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 10^4) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// В первой строке каждого набора входных данных содержатся n и m (1 ≤ n, m ≤ 2·10^5) —
// количество морковок и максимально возможная длина морковки соответственно.

// Во второй строке каждого набора входных данных содержатся n целых чисел
// a1, a2, …, a_n (1 ≤ a_i ≤ m) — исходные размеры морковок.

// Гарантируется, что сумма n по всем наборам входных данных не превосходит 2·10^5,
// и сумма m по всем наборам входных данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — ответ для k = 1.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 5 4
// 1 2 3 4 4
// 5 8
// 1 1 8 8 8
// 1 8
// 6
// 7 9
// 1 7 5 1 7 5 3
// 4 1
// 1 1 1 1
// 3 5
// 3 1 5
// ======================================================================
// Выходные данные
// ======================================================================
// 6
// 6
// 2
// 7
// 4
// 3
// ======================================================================

// Примечание
// В первом наборе входных данных даны морковки [1, 2, 3, 4, 4].

// Для k = 1 оптимально выбрать x = 2 и множество [2, 3, 4, 4]. Мы получим
// [1, 2, 2, 1, 2, 2, 2, 2]. Можно продать 6 морковок длины 2.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, m;
    cin >> n >> m;
    vector<int> a(n), cnt(m + 1, 0), suff(m + 2, 0);
    for (auto &i : a)
    {
        cin >> i;
        cnt[i]++;
    }

    for (int i = m; i >= 1; --i)
        suff[i] = suff[i + 1] + cnt[i];
    int res = 0;
    for (int d = 1; d <= m; d++)
    {
        int temp = suff[d];
        if (d * 2 <= m)
            temp += cnt[d * 2];
        res = max(res, temp);
    }
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
