// C. Три части массива
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Задан массив d1, d2, …, d_n, состоящий из n целых чисел.

// Ваша задача — разделить этот массив на три части (некоторые из которых могут быть
// пустыми) таким образом, что каждый элемент массива принадлежит ровно одной из частей,
// и каждая часть образует последовательный непрерывный подотрезок (возможно, пустой)
// исходного массива.

// Пусть сумма элементов первой части равна sum1, сумма элементов второй части равна sum2
// и сумма элементов третьей части равна sum3. Среди всех возможных разбиений массива
// вам нужно выбрать такое, что sum1 = sum3 и sum1 является максимально возможной.

// Более формально, если первая часть массива содержит a элементов, вторая часть массива
// содержит b элементов и третья часть массива содержит c элементов, тогда:

// - sum1 = ∑_{1 ≤ i ≤ a} d_i,
// - sum2 = ∑_{a+1 ≤ i ≤ a+b} d_i,
// - sum3 = ∑_{a+b+1 ≤ i ≤ a+b+c} d_i.

// Сумма пустого массива равна 0.

// Ваша задача — найти такое разбиение массива, что sum1 = sum3 и sum1 является
// максимально возможной.

// Входные данные
// Первая строка входных данных содержит одно целое число n (1 ≤ n ≤ 2·10^5) —
// количество элементов массива d.

// Вторая строка входных данных содержит n целых чисел d1, d2, …, d_n (1 ≤ d_i ≤ 10^9) —
// элементы массива d.

// Выходные данные
// Выведите одно целое число — максимально возможное значение sum1, удовлетворяющее
// условию sum1 = sum3.

// Очевидно, всегда существует хотя бы один способ разбить массив нужным образом
// (если a = c = 0 и b = n).

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 1 3 1 1 4
// ======================================================================
// Выходные данные
// ======================================================================
// 5

// ======================================================================
// Входные данные
// ======================================================================
// 5
// 1 3 2 1 4
// ======================================================================
// Выходные данные
// ======================================================================
// 4

// ======================================================================
// Входные данные
// ======================================================================
// 3
// 4 1 2
// ======================================================================
// Выходные данные
// ======================================================================
// 0
// ======================================================================

// Примечание
// В первом тестовом примере только одно возможное разбиение, которое максимизирует sum1:
// [1, 3, 1], [], [1, 4].

// Во втором тестовом примере существует единственный способ набрать sum1 = 4:
// [1, 3], [2, 1], [4].

// В третьем тестовом примере есть только один способ разделить массив:
// [], [4, 1, 2], [].

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n), prefsum(n + 1, 0), suffsum(n + 1, 0);
    for (int i = 0; i < n; i++)
    {
        cin >> a[i];
        prefsum[i + 1] = prefsum[i] + a[i];
    }

    for (int i = n - 1; i >= 0; --i)
        suffsum[i] = suffsum[i + 1] + a[i];

    int l = 0, r = n, res = 0;
    while (r + 1 > l)
    {
        while (r + 1 > l && prefsum[l] > suffsum[r])
            r--;
        while (r + 1 > l && prefsum[l] < suffsum[r])
            l++;

        if (prefsum[l] == suffsum[r])
        {
            res = prefsum[l];
            // cout << l << ' ' << r << '\n';
            r--;
            l++;
        }
    }
    cout << res << '\n';

    // for (auto i : prefsum)
    //     cout << i << ' ';
    // cout << '\n';
    // for (auto i : suffsum)
    //     cout << i << ' ';
    // cout << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
