// B. Бейджик
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Как вы, возможно, знаете, в ЛКШ за плохое поведение ставят дырки в бейджик. Вот и
// сегодня один из суровых преподавателей поймал группу из n школьников за очередной
// проделкой. Пронумеруем для удобства школьников в этой группе от 1 до n.

// Преподаватель подошёл к школьнику a и поставил ему дырку в бейджик. Тот, правда,
// попытался оправдаться, что зачинщиком был некоторый другой школьник p_a.

// После этого преподаватель подошёл к школьнику p_a и поставил дырку в бейджик и ему.
// Тот в ответ послал его к школьнику p_{p_a}.

// Так продолжалось некоторое время, но, так как количество школьников было конечно,
// то через некоторое время преподаватель пришёл к школьнику, которому он уже поставил
// дырку.

// После этого он поставил в бейдж этого школьника вторую дырку и счёл на этом свой
// долг выполненным.

// Вы не знаете, с какого школьника a начал преподаватель. Но вы знаете все числа p_i.
// Выясните для каждого возможного школьника a того школьника, которому была поставлена
// вторая дырка.

// Входные данные
// Первая строка входных данных содержит одно целое число n (1 ≤ n ≤ 1000) —
// количество нашкодивших школьников.

// Вторая строка содержит n целых чисел p1, p2, …, p_n (1 ≤ p_i ≤ n), где p_i —
// это номер школьника, к которому посылает преподавателя школьник под номером i.

// Выходные данные
// Для каждого школьника a от 1 до n выведите номер школьника, которому поставят две
// дырки, если преподаватель начнёт ставить дырки со школьника a.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 3
// 2 3 2
// ======================================================================
// Выходные данные
// ======================================================================
// 2 2 3

// ======================================================================
// Входные данные
// ======================================================================
// 3
// 1 2 3
// ======================================================================
// Выходные данные
// ======================================================================
// 1 2 3
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

int f(int x, vector<int> &a, vector<int> &cnt)
{
    cnt[x]++;
    if (cnt[x] == 2)
        return x;
    return f(a[x], a, cnt);
}

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
    {
        cin >> i;
        i--;
    }

    for (int i = 0; i < n; i++)
    {
        vector<int> cnt(n, 0);
        cout << f(i, a, cnt) + 1 << ' ';
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
