// B. Математика
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Учитель JATC по математике всегда даёт их классу разные интересные математические
// задачки, чтобы им не было скучно. Сегодня задачка выглядит следующим образом.
// Дано целое число n, вы можете выполнить следующие операции ноль или более раз:

// - mul x: умножает n на x (где x является произвольным положительным целым числом).
// - sqrt: заменяет n на √n (эту операцию можно выполнить только если √n является
//   целым числом).

// Вы можете выполнять данные операции столько раз, сколько вы хотите. Какого
// минимального значения n можно добиться и какое минимальное количество операций
// нужно сделать, чтобы получить это минимальное значение?

// Похоже, что никто в классе не умеет решать эту задачу. Может быть, вы можете
// им помочь?

// Входные данные
// Единственная строка входных данных содержит одно целое число n (1 ≤ n ≤ 10^6) —
// изначальное значение числа.

// Выходные данные
// Выведите два целых числа — минимальное значение n, которого можно добиться
// с помощью операций выше, и минимальное требуемое для этого число операций.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 20
// ======================================================================
// Выходные данные
// ======================================================================
// 10 2

// ======================================================================
// Входные данные
// ======================================================================
// 5184
// ======================================================================
// Выходные данные
// ======================================================================
// 6 4
// ======================================================================

// Примечание
// В первом примере можно применить операцию mul 5, чтобы получить 100, а затем sqrt,
// чтобы получить 10.

// Во втором примере можно сначала применить sqrt, чтобы получить 72, затем выполнить
// mul 18, чтобы получить 1296, и в конце ещё две операции sqrt, чтобы получить 6.

// Обратите внимание, что несмотря на то, что изначальное значение n не превосходит 10^6,
// оно вполне может стать больше 10^6 после выполнения одной или нескольких операций.

#include <bits/stdc++.h>
using namespace std;

#define int long long
vector<int> facto(int x)
{
    vector<int> res;
    int c = 2;
    while (x != 1)
    {
        while (x % c == 0)
        {
            x /= c;
            res.push_back(c);
        }
        c++;
    }

    return res;
}
void solve()
{
    int x;
    cin >> x;
    unordered_map<int, int> m;
    for (auto &i : facto(x))
        // cout << i << ' ';
        m[i]++;
    bool ok = true;
    int res1 = 1, cnt = 0, mx = 0;
    for (auto &i : m)
    {
        // cout << i.first << ' ' << i.second << '\n';
        res1 *= i.first;
        mx = max(mx, i.second);
    }

    int targ = 1;
    while (targ < mx)
    {
        targ *= 2;
        cnt++;
    }

    for (auto &i : m)
    {
        if (i.second != targ)
        {
            ok = false;
            break;
        }
    }

    cout << res1 << ' ' << cnt + (ok ? 0 : 1);
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
