// B. Div на Mod
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Вася любит решать уравнения. Сегодня он хочет решить уравнение (x div k) · (x mod k) = n,
// где div и mod означают целочисленное деление и операцию взятия по модулю
// (см. Примечания ниже для точного определения). В этом уравнении k и n являются
// целыми положительными параметрами, а x — неизвестным целым положительным числом.
// Если решений несколько, то Вася хочет найти наименьшее из возможных x.
// Вы можете ему помочь?

// Входные данные
// Первая строка содержит два целых числа n и k (1 ≤ n ≤ 10^6, 2 ≤ k ≤ 1000).

// Выходные данные
// Выведите единственное целое число x — наименьшее положительное целое решение
// (x div k) · (x mod k) = n. Гарантируется, что это уравнение имеет хотя бы одно
// целое положительное решение.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 6 3
// ======================================================================
// Выходные данные
// ======================================================================
// 11

// ======================================================================
// Входные данные
// ======================================================================
// 1 2
// ======================================================================
// Выходные данные
// ======================================================================
// 3

// ======================================================================
// Входные данные
// ======================================================================
// 4 6
// ======================================================================
// Выходные данные
// ======================================================================
// 10
// ======================================================================

// Примечание
// Результат целочисленного деления a div b равен наибольшему целому числу c такому,
// что b·c ≤ a. a по модулю b (сокращённо a mod b) — единственное целое число c такое,
// что 0 ≤ c < b и a − c делится на b.

// В первом примере 11 div 3 = 3 и 11 mod 3 = 2. Поскольку 3·2 = 6, то x = 11
// является решением уравнения (x div 3) · (x mod 3) = 6. Можно заметить, что 19 —
// это единственное другое решение этого уравнения, поэтому 11 будет наименьшим.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, k, res = 1e18;
    cin >> n >> k;
    for (int i = 1; i < k; i++)
        res = n % i == 0 ? min((n / i) * k + i, res) : res;
    cout << res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
