// F. Сделай связным
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вам дан неориентированный граф, состоящий из n вершин. На каждой вершине записано
// число; число, записанное на вершине i, равно a_i. Изначально в графе нет ни одного
// ребра.

// Вы можете добавлять ребра в граф за определённую стоимость. За добавление ребра между
// вершинами x и y надо заплатить a_x + a_y монет. Также существует m специальных
// предложений, каждое из которых характеризуется тремя числами x, y и w, и означает,
// что можно добавить ребро между вершинами x и y за w монет. Эти специальные
// предложения не обязательно использовать: если существует такая пара вершин x и y,
// такая, что для неё существует специальное предложение, можно всё равно добавить
// ребро между ними за a_x + a_y монет.

// Сколько монет минимально вам потребуется, чтобы сделать граф связным? Граф является
// связным, если от каждой вершины можно добраться до любой другой вершины, используя
// только рёбра этого графа.

// Входные данные
// В первой строке заданы два целых числа n и m (1 ≤ n ≤ 2·10^5, 0 ≤ m ≤ 2·10^5) —
// количество вершин в графе и специальных предложений соответственно.

// Во второй строке заданы n целых чисел a1, a2, …, a_n (1 ≤ a_i ≤ 10^12) — числа,
// записанные на вершинах.

// Затем следуют m строк, в каждой из которых заданы три целых числа x, y и w
// (1 ≤ x, y ≤ n, 1 ≤ w ≤ 10^12, x ≠ y), обозначающие спецпредложение: можно добавить
// ребро между вершинами x и y за w монет.

// Выходные данные
// Выведите одно целое число — минимальное количество монет, которое необходимо
// потратить, чтобы сделать граф связным.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 3 2
// 1 3 3
// 2 3 5
// 2 1 1
// ======================================================================
// Выходные данные
// ======================================================================
// 5

// ======================================================================
// Входные данные
// ======================================================================
// 4 0
// 1 3 3 7
// ======================================================================
// Выходные данные
// ======================================================================
// 16

// ======================================================================
// Входные данные
// ======================================================================
// 5 4
// 1 2 3 4 5
// 1 2 8
// 1 3 10
// 1 4 7
// 1 5 15
// ======================================================================
// Выходные данные
// ======================================================================
// 18
// ======================================================================

// Примечание
// В первом примере из условия можно соединить 1 и 2 при помощи 2-го спецпредложения,
// а затем 1 и 3 без использования спецпредложения.

// В следующих двух примерах оптимальный ответ можно получить без использования
// спецпредложений.

#include <bits/stdc++.h>
using namespace std;

#define int long long

struct DSU
{
    vector<int> p, r;
    DSU(int n)
    {
        p.resize(n);
        r.assign(n, 1);
        for (int i = 0; i < n; i++)
            p[i] = i;
    }

    int get(int x) { return p[x] = (x == p[x] ? x : get(p[x])); }

    bool united(int a, int b)
    {
        a = get(a), b = get(b);
        if (a != b)
        {
            if (r[a] > r[b])
                swap(a, b);
            p[a] = b;
            if (r[a] == r[b])
                r[b]++;
            return 1;
        }
        return 0;
    }
};

void solve()
{
    int n, m;
    cin >> n >> m;
    vector<int> a(n);
    int mn_inx = 0;
    for (int i = 0; i < n; i++)
    {
        cin >> a[i];
        if (a[i] < a[mn_inx])
            mn_inx = i;
    }

    auto comp = [](pair<int, pair<int, int>> &a, pair<int, pair<int, int>> &b)
    { return a.first > b.first; };

    priority_queue<pair<int, pair<int, int>>, vector<pair<int, pair<int, int>>>, decltype(comp)> e;
    for (int i = 0; i < n; i++)
        if (i != mn_inx)
            e.push({a[mn_inx] + a[i], {mn_inx, i}});

    while (m--)
    {
        int x, y, w;
        cin >> x >> y >> w;
        x--;
        y--;
        e.push({w, {x, y}});
    }
    int res = 0, cnt = 0;
    DSU d(n);
    while (!e.empty() || cnt != n - 1)
    {
        auto i = e.top();
        e.pop();
        if (d.united(i.second.first, i.second.second))
        {
            res += i.first;
            cnt++;
        }
    }
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
