// E. Рюкзак
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// У вас есть набор предметов, у каждого из которых есть какой-то целочисленный вес
// не более 8. Вы называете подмножество набора предметов хорошим, если суммарный вес
// предметов в подмножестве не превосходит W.

// Посчитайте максимально возможный вес хорошего подмножества набора предметов.
// Обратите внимание, что пустое множество и исходный набор предметов тоже являются
// подмножествами исходного набора.

// Входные данные
// В первой строке записано одно целое число W (0 ≤ W ≤ 10^18) — максимально возможный
// вес хорошего подмножества.

// Вторая строка описывает набор предметов, который у вас есть. Она содержит 8 целых
// чисел cnt1, cnt2, …, cnt8 (0 ≤ cnt_i ≤ 10^16), где cnt_i — количество предметов
// веса i в наборе.

// Выходные данные
// Выведите одно целое число — максимальный вес хорошего подмножества.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 10
// 1 2 3 4 5 6 7 8
// ======================================================================
// Выходные данные
// ======================================================================
// 10

// ======================================================================
// Входные данные
// ======================================================================
// 0
// 0 0 0 0 0 0 0 0
// ======================================================================
// Выходные данные
// ======================================================================
// 0

// ======================================================================
// Входные данные
// ======================================================================
// 3
// 0 4 1 0 0 9 8 3
// ======================================================================
// Выходные данные
// ======================================================================
// 3
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int w;
    cin >> w;
    vector<int> a(8), dp(1 << 8, -1);
    dp[0] = 0;
    for (auto &i : a)
        cin >> i;

    for (int mask = 0; mask < (1 << 8); mask++)
    {
        if (dp[mask] == -1)
            continue;

        for (int i = 0; i < 8; i++)
        {
            if ((((mask >> i) & 1) == 0) && (dp[mask] + a[i] <= w))
            {
                int next = mask | (1 << i);
                dp[next] = dp[mask] + a[i];
            }
        }
    }
    cout << *max_element(dp.begin(), dp.end());
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
