// C. Сбалансированная команда
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вы — университетский тренер. Всего в университете под Вашим надзором n студентов,
// умение программировать i-го студента равно a_i.

// Вы хотите составить команду для нового соревнования по программированию. Как Вы
// знаете, чем больше студентов на соревновании — тем больше шансов победить! Поэтому
// Вы хотите составить максимальную по количеству студентов команду. Но Вы также
// знаете, что команда должна быть сбалансированной. Это означает, что умение
// программировать каждой пары студентов в команде должно отличаться не более, чем на 5.

// Ваша задача — найти максимально возможное количество студентов в сбалансированной
// команде.

// Входные данные
// Первая строка входных данных содержит одно целое число n (1 ≤ n ≤ 2·10^5) —
// количество студентов.

// Вторая строка входных данных содержит n целых чисел a1, a2, …, a_n (1 ≤ a_i ≤ 10^9),
// где a_i означает умение i-го студента программировать.

// Выходные данные
// Выведите одно целое число — максимально возможное количество студентов
// в сбалансированной команде.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 1 10 17 12 15 2
// ======================================================================
// Выходные данные
// ======================================================================
// 3

// ======================================================================
// Входные данные
// ======================================================================
// 10
// 1337 1337 1337 1337 1337 1337 1337 1337 1337 1337
// ======================================================================
// Выходные данные
// ======================================================================
// 10

// ======================================================================
// Входные данные
// ======================================================================
// 6
// 1 1000 10000 10 100 1000000000
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// ======================================================================

// Примечание
// В первом тестовом примере Вы можете создать команду с умениями [12, 17, 15].

// Во втором тестовом примере Вы можете взять всех студентов в команду, потому что
// их умения программировать равны.

// В третьем тестовом примере Вы можете создать команду, состоящую из одного студента
// (и не можете создать команду, состоящую хотя бы из двух студентов).

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;

    sort(a.begin(), a.end());
    int best_res = 0, l = 0;
    for (int r = 0; r < n; r++)
    {
        if (a[r] - a[l] > 5)
            l++;
        else
            best_res = max(best_res, r - l + 1);
    }
    cout << best_res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
