// A. Праздник
// ограничение по времени на тест3 seconds
// ограничение по памяти на тест256 megabytes

// В компании работает n сотрудников, пронумерованных от 1 до n. У каждого сотрудника
// либо нет руководителя, либо есть ровно один непосредственный руководитель —
// некоторый другой сотрудник с другим номером. Сотрудник A называется начальником
// другого сотрудника B, если выполняется хотя бы одно из двух условий:

// - Сотрудник A — непосредственный руководитель сотрудника B.
// - У сотрудника B есть непосредственный руководитель, сотрудник C, такой, что A
//   является начальником сотрудника C.

// В структуре компании нет циклов. То есть никакой сотрудник не является начальником
// своего непосредственного руководителя.

// Сегодня компания собирается организовать праздник. Для этого необходимо разделить
// всех n сотрудников на несколько групп: каждый человек должен относиться ровно
// к одной группе. Более того, в каждой группе не должно быть таких двух сотрудников A и B,
// что A является начальником B.

// Ваша задача — найти наименьшее возможное количество таких групп.

// Входные данные
// Первая строка содержит целое число n (1 ≤ n ≤ 2000) — количество сотрудников.

// Следующие n строк содержат целые числа p_i (1 ≤ p_i ≤ n или p_i = -1). Каждое p_i
// обозначает непосредственного руководителя i-го сотрудника. Если p_i равно -1,
// то i-й сотрудник не имеет непосредственного руководителя.

// Гарантируется, что никакой сотрудник не является своим собственным непосредственным
// руководителем (p_i ≠ i). Также гарантируется, что структура компании не содержит циклов.

// Выходные данные
// Выведите единственное целое число — минимальное количество групп, на которые можно
// разделить всех сотрудников.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5
// -1
// 1
// 2
// 1
// -1
// ======================================================================
// Выходные данные
// ======================================================================
// 3
// ======================================================================

// Примечание
// В первом примере достаточно трёх групп:

// - Сотрудник 1;
// - Сотрудники 2 и 4;
// - Сотрудники 3 и 5.

#include <bits/stdc++.h>
using namespace std;

#define int long long

int f(int x, vector<vector<int>> &a)
{
    int res = 0;
    for (int i = 0; i < a[x].size(); i++)
        res = max(res, f(a[x][i], a));

    return res + 1;
}

void solve()
{
    int n;
    cin >> n;
    vector<vector<int>> a(n);
    vector<int> p;
    for (int i = 0; i < n; i++)
    {
        int x;
        cin >> x;
        if (x != -1)
            a[x - 1].push_back(i);
        else
            p.push_back(i);
    }

    int res = 0;
    for (auto &i : p)
        res = max(res, f(i, a));
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
