// D. Почти все делители
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Мы загадали некоторое целое число x. Вам задан список почти всех его делителей.
// Почти всех означает, что в списке есть все делители кроме 1 и x.

// Ваша задача — найти минимально возможное целое число x, которое может быть загаданным
// числом, или сказать, что входные данные противоречивы и невозможно найти такое число.

// Вам необходимо ответить на t независимых запросов.

// Входные данные
// Первая строка входных данных содержит одно целое число t (1 ≤ t ≤ 25) —
// количество запросов. Далее следуют t запросов.

// Первая строка запроса содержит одно целое число n (1 ≤ n ≤ 300) — количество
// делителей в списке.

// Вторая строка запроса содержит n целых чисел d1, d2, …, d_n (2 ≤ d_i ≤ 10^6),
// где d_i равно i-му делителю заданного числа. Гарантируется, что все значения d_i
// различны.

// Выходные данные
// Выведите ответ на каждый запрос.

// Если входные данные противоречивы и невозможно найти такое число x, что заданный
// список делителей — это список почти всех его делителей, выведите -1. Иначе выведите
// минимально возможное такое x.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 2
// 8
// 8 2 12 6 4 24 16 3
// 1
// 2
// ======================================================================
// Выходные данные
// ======================================================================
// 48
// 4
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long
#define all(a) a.begin(), a.end()
#define forr(i, n) for (int i = 0; i < n; i++)

vector<int> dl(int x)
{
    vector<int> res;
    for (int i = 2; i * i <= x; i++)
    {
        if (x % i == 0)
        {
            res.push_back(i);
            if (i != x / i)
                res.push_back(x / i);
        }
    }
    return res;
}

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;

    sort(all(a));
    int res = a[0] * a[n - 1];
    auto v = dl(res);
    sort(all(v));
    // for (auto &i : v)
    //     cout << i << ' ';
    if (v.size() != n)
    {
        cout << "-1\n";
        return;
    }
    forr(i, v.size()) if (v[i] != a[i])
    {
        cout << "-1\n";
        return;
    }

    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
