// B. Тренировки Поликарпа
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт
// Поликарп хочет потренироваться перед очередным важным соревнованием по программированию. В течение первого дня его тренировок он хочет решить ровно 1
//  задачу, в течение второго дня — ровно 2
//  задачи, в течение третьего дня — ровно 3
//  задачи, и так далее. В течение k
// -го дня он хочет решить ровно k
//  задач.

// У Поликарпа есть список из n
//  контестов, i
// -й контест состоит из ai
//  задач. В течение каждого дня Поликарп будет выбирать ровно один из контестов, который он еще не решал до этого, и решать его. Он решает ровно k
//  задач из этого контеста. Остальные задачи исключаются из контеста. Если контестов, состоящих из не менее k
//  задач, которые Поликарп еще не решал, в течение k
// -го дня нет, то Поликарп прекращает тренироваться.

// Как много дней Поликарп сможет тренироваться, если будет выбирать контесты оптимально?

// Входные данные
// Первая строка входных данных содержит одно целое число n
//  (1≤n≤2⋅105
// ) — количество контестов.

// Вторая строка входных данных содержит n
//  целых чисел a1,a2,…,an
//  (1≤ai≤2⋅105
// ) — количество задач в i
// -м контесте.

// Выходные данные
// Выведите одно целое число — максимальное количество дней, которое Поликарп сможет тренироваться, если он будет выбирать контесты оптимально.

// Примеры
// Входные данныеСкопировать
// 4
// 3 1 4 1
// Выходные данныеСкопировать
// 3
// Входные данныеСкопировать
// 3
// 1 1 1
// Выходные данныеСкопировать
// 1
// Входные данныеСкопировать
// 5
// 1 1 1 2 2
// Выходные данныеСкопировать
// 2

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;

    sort(a.begin(), a.end());
    int pos = 1;
    for (int i = 0; i < n; i++)
    {
        if (a[i] >= pos)
            pos++;
    }

    cout << pos - 1 << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
