// C. Распространение новостей
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// В некоторой социальной сети зарегистрированы n пользователей. Они общаются между
// собой в m группах. Давайте рассмотрим процесс распространения новостей между
// пользователями.

// Изначально какой-нибудь пользователь x узнаёт новость из какого-то внешнего источника.
// Затем этот пользователь отправляет новость всем своим друзьям (два пользователя
// считаются друзьями, если они оба принадлежат к какой-нибудь группе). Друзья
// продолжают отправлять новость своим друзьям, и так далее. Процесс заканчивается,
// когда не останется ни одной пары друзей, в которой один пользователь знает новость,
// а другой — нет.

// Для каждого пользователя x определите, сколько пользователей в конечном итоге узнает
// новость, если x начнёт её распространять.

// Входные данные
// В первой строке записаны два целых числа n и m (1 ≤ n, m ≤ 5·10^5) — количество
// пользователей и групп соответственно.

// Затем следуют m строк, каждая из которых описывает группу. i-я строка начинается
// целым числом k_i (0 ≤ k_i ≤ n) — количество пользователей в i-й группе. Затем
// следуют k_i различных чисел, обозначающих пользователей, принадлежащих к i-й группе.

// Гарантируется, что ∑_{i=1}^{m} k_i ≤ 5·10^5.

// Выходные данные
// Выведите n целых чисел. i-е из них должно быть равно количеству пользователей,
// которые узнают новость, если пользователь i начнёт её распространять.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 7 5
// 3 2 5 4
// 0
// 2 1 2
// 1 1
// 2 6 7
// ======================================================================
// Выходные данные
// ======================================================================
// 4 4 1 4 4 2 2
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

struct DSU
{
    vector<int> v, parent;

    DSU(int n)
    {
        v.assign(n, 1);
        parent.assign(n, 1);
        for (int i = 0; i < n; i++)
            parent[i] = i;
    }

    int find(int x)
    {
        if (x == parent[x])
            return x;
        return parent[x] = find(parent[x]);
    }

    void un(int l, int r)
    {
        int par_l = find(l), par_r = find(r);

        if (par_l != par_r)
        {
            parent[par_r] = par_l;

            int a = v[par_l], b = v[par_r];
            v[par_l] += b;
            v[par_r] += a;
        }
    }
};

void solve()
{
    int n, m;
    cin >> n >> m;
    DSU d(n);
    for (int i = 0; i < m; i++)
    {
        int k;
        cin >> k;
        vector<int> a(k);
        for (auto &j : a)
        {
            cin >> j;
            j--;
        }
        for (int z = 1; z < k; z++)
            d.un(a[z - 1], a[z]);
    }
    for (int i = 0; i < n; i++)
        cout << d.v[d.find(i)] << ' ';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
