// B. WOW фактор
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Строка a является подпоследовательностью строки b, если a может быть получена из b
// удалением нескольких (возможно, ни одного или всех) символов. Например, для строки
// a = «wowwo» следующие строки являются подпоследовательностями: «wowwo», «wowo»,
// «oo», «wow», «» и другие, а следующие не являются подпоследовательностями: «owoo»,
// «owwwo», «ooo».

// Wow фактор строки равен количеству подпоследовательностей, которые равны строке «wow».
// Боб хотел выписать строку, которая имеет большой wow фактор. Однако кнопка «w»
// на его клавиатуре сломана, поэтому он пишет вместо неё две буквы «v».

// Боб неожиданно осознал, что, возможно, в строке можно найти больше букв «w», чем он
// написал. Например, рассмотрим строку «ww». Боб написал бы её как «vvvv», но в этой
// строке можно найти три буквы «w»:

// «vvvv»
// «vvvv»
// «vvvv»

// Например, wow фактор в слове «vvvovvv» равен четырём, потому что есть четыре способа
// выбрать «wow»:

// «vvvovvv»
// «vvvovvv»
// «vvvovvv»
// «vvvovvv»

// Обратите внимание, что подпоследовательность «vvvovvv» не считается, так как буквы
// «v» должны быть последовательными.

// Посчитайте wow фактор для строки s и выведите его. Обратите внимание, что не
// гарантируется, что возможно получить строку s из другой строки, заменяя «w» на «vv».
// Например, s может быть «vov».

// Входные данные
// Первая строка содержит одну непустую строку s, которая состоит только из символов
// «v» и «o». Длина строки s не более 10^6 символов.

// Выходные данные
// Выведите одно целое число — wow фактор строки s.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// vvvovvv
// ======================================================================
// Выходные данные
// ======================================================================
// 4

// ======================================================================
// Входные данные
// ======================================================================
// vvovooovovvovoovoovvvvovovvvov
// ======================================================================
// Выходные данные
// ======================================================================
// 100
// ======================================================================

// Примечание
// Первый пример объяснён в легенде.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    string s;
    cin >> s;
    int n = s.size();
    int wcnt = 0, wocnt = 0, wow_factor = 0;
    for (int i = 0; i < n; i++)
    {
        if (s[i] == 'o')
            wocnt += wcnt;
        else if (i > 0 && s[i - 1] == 'v' && s[i] == 'v')
        {
            wcnt++;
            wow_factor += wocnt;
        }
    }
    cout << wow_factor;

    // vector<int> nules, w;
    // int res = 0;
    // for (int i = 0; i < n; i++)
    // {
    //     if (w.empty())
    //     {
    //         while (i < n && s[i] != 'v')
    //             i++;
    //         int wcnt = -1;
    //         while (i < n && s[i] == 'v')
    //         {
    //             wcnt++;
    //             i++;
    //         }
    //         if (wcnt)
    //             w.push_back(wcnt);
    //     }
    //     else
    //     {
    //         int cnt0 = 1;
    //         while (i < n)
    //         {
    //             while (i < n && s[i] != 'v')
    //             {
    //                 cnt0++;
    //                 i++;
    //             }
    //             int wcnt = -1;
    //             while (i < n && s[i] == 'v')
    //             {
    //                 wcnt++;
    //                 i++;
    //             }
    //             if (wcnt)
    //             {
    //                 nules.push_back(cnt0);
    //                 w.push_back(wcnt);
    //                 break;
    //             }
    //         }
    //     }
    // }
    // vector<int> pref(nules.size() + 1, 0);
    // for (int i = 0; i < nules.size(); i++)
    //     pref[i + 1] = pref[i] + nules[i];

    // for (int r = 0; r < w.size(); r++)
    // {
    //     for (int l = 0; l < r; l++)
    //     {
    //         res += w[l] * (pref[r] - pref[l]) * w[r];
    //     }
    // }
    // cout << res << '\n';

    // for (auto &i : nules)
    //     cout << i << ' ';
    // cout << '\n';
    // for (auto &i : w)
    //     cout << i << ' ';
    // cout << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}

// vv ooooo vv ooooo vvvv oo vvv
// 1    5    1   5     3   2   2

// 1 * 5 * 1= 5
// (1 * 10 * 3) + (1 * 5 * 3)= 45
// (3 * 2 * 2) + (1 * 7 * 2) + (1 * 12 * 2) = 50
// 5 + 45 + 500 = 100

// 0 5 10 12
// 1 1  3  2