// A. Заполнение формами
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Вам дано целое число n. Найдите количество способов заполнить все 3×n плитки
// формой, описанной на рисунке ниже. Нельзя, чтобы после заполнения были пустые
// плитки. Формы не могут перекрываться.

// Эта картина описывает ситуацию, когда n = 4. Слева — форма, а справа — 3×n плиток.

// Форма имеет вид:

// ##
//  #

// Входные данные
// Первая строка содержит одно целое число n (1 ≤ n ≤ 60) — длину.

// Выходные данные
// Выведите количество способов.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 4
// ======================================================================
// Выходные данные
// ======================================================================
// 4

// ======================================================================
// Входные данные
// ======================================================================
// 1
// ======================================================================
// Выходные данные
// ======================================================================
// 0
// ======================================================================

// Примечание
// В первом примере есть всего 4 возможных способа заполнения.

// Во втором примере вы не можете заполнить 3×1 плиток.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    cout << (n % 2 == 0 && n / 2 > 0) * (int)pow(2, n / 2);
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
