// C. Баскетбольная зарядка
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// В ЛКШ наконец-то появилось поле для игры в баскетбол, и на радостях Демид решил
// провести баскетбольную зарядку. На зарядку к Демиду пришло 2·n человек, и он построил
// их в два ряда по n человек в каждом. В каждом из рядов он пронумеровал игроков
// от 1 до n слева направо.

// Теперь Демид хочет выбрать команду для игры в баскетбол. Он будет выбирать игроков
// слева направо, и номер каждого следующего взятого игрока будет строго больше, чем
// номер предыдущего взятого. А для того, чтобы не отдавать предпочтения одному из рядов,
// каждый следующий выбранный школьник должен стоять не в том же ряду, что предыдущий.
// Первый выбранный школьник может быть любым из всех 2n, а количество игроков в команде
// не ограничено.

// Демид считает, что команда тем лучше, чем больше суммарный рост её игроков. Помогите
// Демиду определить максимальный суммарный рост игроков команды, которую он может выбрать.

// Входные данные
// В первой строке дано число n (1 ≤ n ≤ 10^5) — количество школьников в каждом из рядов.

// Вторая строка входных данных содержит n целых чисел h_{1,1}, h_{1,2}, …, h_{1,n},
// разделённых пробелами (1 ≤ h_{1,i} ≤ 10^9), где h_{1,i} равно росту i-го человека
// в первом ряду.

// Третья строка входных данных содержит n целых чисел h_{2,1}, h_{2,2}, …, h_{2,n},
// разделённых пробелами (1 ≤ h_{2,i} ≤ 10^9), где h_{2,i} равно росту i-го человека
// во втором ряду.

// Выходные данные
// Выведите одно число — максимальный суммарный рост игроков в команде, которую может
// выбрать Демид.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 9 3 5 7 3
// 5 8 1 4 5
// ======================================================================
// Выходные данные
// ======================================================================
// 29

// ======================================================================
// Входные данные
// ======================================================================
// 3
// 1 2 9
// 10 1 1
// ======================================================================
// Выходные данные
// ======================================================================
// 19

// ======================================================================
// Входные данные
// ======================================================================
// 1
// 7
// 4
// ======================================================================
// Выходные данные
// ======================================================================
// 7
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<pair<int, int>> a(n), dp(n + 1, {-1, -1});
    for (auto &i : a)
        cin >> i.first;
    for (auto &i : a)
        cin >> i.second;
    dp[0] = {0, 0};
    int mi2 = 0, mi1 = 0;
    for (int i = 1; i <= n; i++)
    {
        dp[i].first = mi1 + a[i - 1].first;
        dp[i].second = mi2 + a[i - 1].second;
        mi1 = max(mi1, dp[i].second);
        mi2 = max(mi2, dp[i].first);
    }
    cout << max(dp[n].first, dp[n].second);
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
