// D. Простая задача
// ограничение по времени на тест2 seconds
// ограничение по памяти на тест256 megabytes

// Задан простой неориентированный граф. Выведите число простых циклов в нём.
// Цикл называется простым, если он не содержит повторяющихся вершин и рёбер
// (т.е. каждая вершина и ребро содержатся в нём не более 1 раза).

// Входные данные
// Первая строка содержит два целых числа n и m (1 ≤ n ≤ 19, 0 ≤ m) — количество
// вершин и рёбер соответственно. Последующие m строк описывают рёбра графа парами
// a, b (1 ≤ a, b ≤ n, a ≠ b), обозначающими номера соединяемых ребром вершин.
// Между каждой парой вершин не более одного ребра.

// Выходные данные
// Выведите количество простых циклов в заданном графе.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 4 6
// 1 2
// 1 3
// 1 4
// 2 3
// 2 4
// 3 4
// ======================================================================
// Выходные данные
// ======================================================================
// 7
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long
#define all(a) a.begin(), a.end()

void solve()
{
    int n, m;
    cin >> n >> m;
    vector<vector<int>> a(n, vector<int>(n, 0)), dp(1 << 19, vector<int>(n, 0));
    for (int i = 0; i < m; i++)
    {
        int x, y;
        cin >> x >> y;
        x--, y--;
        a[x][y] = a[y][x] = 1;
    }

    for (int i = 0; i < n; i++)
        dp[1 << i][i] = 1;

    int res = 0;
    for (unsigned int mask = 1; mask < (1 << n); mask++)
    {
        int start = -1;
        for (int i = 0; i < 19 && start == -1; i++)
            if (mask & (1 << i))
                start = i;

        for (int j = 0; j < n; j++)
        {
            if (dp[mask][j] == 0)
                continue;
            for (int i = start; i < n; i++)
            {
                if (!a[j][i])
                    continue;

                if (i == start && popcount(mask) >= 3)
                    res += dp[mask][j];
                if (!(mask & (1 << i)))
                    dp[mask | (1 << i)][i] += dp[mask][j];
            }
        }
    }
    cout << res / 2;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
