// C. Общие делители
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вам задан массив a, состоящий из n целых чисел.

// Ваша задача — найти количество таких положительных целых чисел x, что x делит каждое
// число в массиве. Другими словами, вам необходимо найти количество общих делителей
// всех элементов массива.

// Например, если массив a будет равен [2, 4, 6, 2, 10], то 1 и 2 делят каждое число
// в массиве (таким образом, ответ на этот тест равен 2).

// Входные данные
// Первая строка входных данных содержит одно целое число n (1 ≤ n ≤ 4·10^5) —
// количество элементов в a.

// Вторая строка входных данных содержит n целых чисел a1, a2, …, a_n (1 ≤ a_i ≤ 10^12),
// где a_i равно i-му элементу a.

// Выходные данные
// Выведите одно целое число — количество таких положительных целых чисел x, что x
// делит каждое число из заданного массива (другими словами, ответ равен количеству
// общих делителей всех элементов массива).

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 1 2 3 4 5
// ======================================================================
// Выходные данные
// ======================================================================
// 1

// ======================================================================
// Входные данные
// ======================================================================
// 6
// 6 90 12 18 30 18
// ======================================================================
// Выходные данные
// ======================================================================
// 4
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;
    int g = a[0];
    for (int i = 1; i < n; i++)
        g = gcd(g, a[i]);

    int res = 0;
    int j = 1;
    while (j * j <= g)
    {
        if (g % j == 0)
        {
            res++;
            if (j * j != g)
                res++;
        }
        j++;
    }
    cout << res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
