// D. Корова и вечеринка
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Легендарный фермер Джон готовит большую вечеринку. В гости были приглашены животные
// со всего мира. Сейчас гости проголодались, так что Джон попросил свою корову Бесси
// достать чего-нибудь перекусить.

// Есть n разных видов закусок, пронумерованных числами 1, 2, …, n. У Бесси есть n
// закусок, по одной закуске каждого вида. У каждого гостя есть ровно два любимых вида
// закусок. Процесс перекуса будет происходить следующим образом:

// - Сначала Бесси упорядочит всех гостей в каком-то порядке.
// - Затем в этом порядке гости будут по одному подходить к закускам.
// - Каждый гость будет в свой ход съедать все оставшиеся закуски любимых типов.
//   В случае, если не осталось ни одной закуски любимых типов, то гость уйдёт очень
//   грустным.

// Помогите Бесси минимизировать число грустных гостей, упорядочив гостей правильным
// образом.

// Входные данные
// Первая строка содержит целые числа n и k (2 ≤ n ≤ 10^5, 1 ≤ k ≤ 10^5) —
// количество закусок и количество гостей.

// i-я из следующих k строк содержит два целых числа x_i и y_i (1 ≤ x_i, y_i ≤ n,
// x_i ≠ y_i) — любимые виды закусок для i-го гостя.

// Выходные данные
// Выведите одно целое число — минимальное возможное количество грустных гостей.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5 4
// 1 2
// 4 3
// 1 4
// 3 4
// ======================================================================
// Выходные данные
// ======================================================================
// 1

// ======================================================================
// Входные данные
// ======================================================================
// 6 5
// 2 3
// 2 1
// 3 4
// 6 5
// 4 5
// ======================================================================
// Выходные данные
// ======================================================================
// 0
// ======================================================================

// Примечание
// В первом примере Бесси может упорядочить гостей следующим образом: 3, 1, 2, 4.
// Гость 3 пойдёт первым и съест закуски 1 и 4. Затем идёт гость 1 и съедает закуску 2,
// так как закуска 1 уже съедена. Затем приходит гость 2 и съедает только закуску 3.
// Так как все закуски уже съедены, то гость 4 будет грустным.

// Во втором примере можно упорядочить гостей как 2, 1, 3, 5, 4. Тогда все гости
// будут удовлетворены.

#include <bits/stdc++.h>
using namespace std;

#define int long long

struct DSU
{
    vector<int> parent;

    DSU(int n)
    {
        parent.resize(n);
        for (int i = 0; i < n; i++)
            parent[i] = i;
    };

    int find(int x)
    {
        if (x == parent[x])
            return x;
        return parent[x] = find(parent[x]);
    };

    void uni(int l, int r)
    {
        int parl = find(l), parr = find(r);
        if (parl != parr)
        {
            parent[parl] = parr;
        }
    };
};

void solve()
{
    int n, k;
    cin >> n >> k;
    DSU d(n);
    for (int i = 0; i < k; i++)
    {
        int x, y;
        cin >> x >> y;
        x--;
        y--;
        d.uni(x, y);
    }

    int count = 0;
    for (int i = 0; i < n; i++)
        count += d.parent[i] == i;
    cout << k - (n - count);
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}

// #include <bits/stdc++.h>
// using namespace std;

// #define int long long

// void solve()
// {
//     int n, k;
//     cin >> n >> k;
//     vector<vector<int>> a(n);
//     for (int i = 0; i < k; i++)
//     {
//         int l, r;
//         cin >> l >> r;
//         l--;
//         r--;
//         a[l].push_back(r);
//         a[r].push_back(l);
//     }

//     vector<bool> vis(n, false);
//     int comp = 0;
//     for (int i = 0; i < n; i++)
//     {
//         if (!vis[i])
//         {
//             comp++;
//             queue<int> q;
//             q.push(i);
//             vis[i] = 1;
//             while (!q.empty())
//             {
//                 int cur = q.front();
//                 q.pop();

//                 for (auto &u : a[cur])
//                 {
//                     if (!vis[u])
//                     {
//                         vis[u] = 1;
//                         q.push(u);
//                     }
//                 }
//             }
//         }
//     }
//     cout << comp << '\n';
//     cout << k - (n - comp) << '\n';
// }

// int32_t main()
// {
//     ios_base::sync_with_stdio(false);
//     cin.tie(NULL);

//     solve();
//     return 0;
// }
