// B. Плохие цены
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Поликарп анализирует цену на новую модель berPhone. В его распоряжении цены за n
// последних дней: a1, a2, …, a_n, где a_i — цена berPhone в день i.

// Поликарп считает цену в день i плохой, если позже (то есть в день с большим номером)
// berPhone продавался по меньшей цене. Например, если n = 6 и a = [3, 9, 4, 6, 7, 5],
// то количество дней с плохой ценой равно 3 — это дни 2 (a2 = 9), 4 (a4 = 6) и 5 (a5 = 7).

// Выведите количество дней с плохой ценой по мнению Поликарпа.

// Вам необходимо ответить на t независимых наборов входных данных.

// Входные данные
// В первой строке записано целое число t (1 ≤ t ≤ 10000) — количество наборов
// входных данных в тесте. Наборы входных данных надо обрабатывать независимо,
// один за другим.

// Каждый набор входных данных состоит из двух строк. Первая строка содержит целое
// число n (1 ≤ n ≤ 150000) — количество дней. Вторая строка содержит n целых чисел
// a1, a2, …, a_n (1 ≤ a_i ≤ 10^6), где a_i — цена в i-й день.

// Гарантируется, что сумма n по всем наборам входных данных в тесте не превосходит 150000.

// Выходные данные
// Выведите t целых чисел, j-е из них должно быть равно количеству дней с плохой ценой
// в j-м наборе входных данных.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 6
// 3 9 4 6 7 5
// 1
// 1000000
// 2
// 2 1
// 10
// 31 41 59 26 53 58 97 93 23 84
// 7
// 3 2 1 2 3 4 5
// ======================================================================
// Выходные данные
// ======================================================================
// 3
// 0
// 1
// 8
// 2
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;
    int lcmin = a[n - 1], res = 0;
    for (auto i = n - 1; i >= 0; --i)
    {
        if (a[i] > lcmin)
            res++;
        else
            lcmin = a[i];
    }
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
