// G. Запросы на пути
// ограничение по времени на тест3 секунды
// ограничение по памяти на тест256 мегабайт

// Вам задано взвешенное дерево, состоящее из n вершин. Напомним, что деревом называется
// связный граф без циклов. Вершины u_i и v_i соединены ребром веса w_i.

// Вам задано m запросов. i-й запрос задан целым числом q_i. В этом запросе вам необходимо
// посчитать количество пар вершин (u, v) (u < v) таких, что максимальный вес ребра
// на простом пути между u и v не превосходит q_i.

// Входные данные
// Первая строка входных данных содержит два целых числа n и m (1 ≤ n, m ≤ 2·10^5) —
// количество вершин в дереве и количество запросов.

// Каждая из следующих n − 1 строк описывает рёбра дерева. Ребро i обозначается тремя
// целыми числами u_i, v_i и w_i — номерами вершин, которые оно соединяет
// (1 ≤ u_i, v_i ≤ n, u_i ≠ v_i) и весом ребра (1 ≤ w_i ≤ 2·10^5). Гарантируется,
// что заданный набор рёбер образует дерево.

// Последняя строка входных данных содержит m целых чисел q1, q2, …, q_m
// (1 ≤ q_i ≤ 2·10^5), где q_i равно максимальному весу ребра в i-м запросе.

// Выходные данные
// Выведите m целых чисел — ответы на запросы. i-е число должно равняться количеству
// пар вершин (u, v) (u < v) таких, что максимальный вес ребра на простом пути между
// u и v не превосходит q_i.

// Запросы пронумерованы от 1 до m в порядке входных данных.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 7 5
// 1 2 1
// 3 2 3
// 2 4 1
// 4 5 2
// 5 7 4
// 3 6 2
// 5 2 3 4 1
// ======================================================================
// Выходные данные
// ======================================================================
// 21 7 15 21 3

// ======================================================================
// Входные данные
// ======================================================================
// 1 2
// 1 2
// ======================================================================
// Выходные данные
// ======================================================================
// 0 0

// ======================================================================
// Входные данные
// ======================================================================
// 3 3
// 1 2 1
// 2 3 2
// 1 3 2
// ======================================================================
// Выходные данные
// ======================================================================
// 1 3 3
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long
#define all(a) a.begin(), a.end()
#define rall(a) a.rbegin(), a.rend()
#define forr(i, n) for (int i = 0; i < n; i++)
#define rforr(i, n) for (int i = 0; i < n; i--)

struct DSU
{
    vector<int> p, r, cnt;
    DSU(int n)
    {
        p.resize(n);
        r.assign(n, 1);
        cnt.assign(n, 1);
        forr(i, n) p[i] = i;
    }

    int get(int x) { return p[x] = (x == p[x] ? x : get(p[x])); }

    pair<pair<int, int>, pair<int, int>> united(int a, int b)
    {
        a = get(a), b = get(b);
        if (a != b)
        {
            if (r[a] > r[b])
                swap(a, b);
            p[a] = b;
            int ra = (cnt[a] * (cnt[a] - 1)) / 2, rb = (cnt[b] * (cnt[b] - 1)) / 2, nr;
            cnt[b] += cnt[a];
            nr = (cnt[b] * (cnt[b] - 1)) / 2;
            r[b] += r[a] == r[b];
            return {{1, nr}, {ra, rb}}; // bool , +new res, -ra, -rb
        }
        return {{0, -1}, {-1, -1}};
    }
};

void solve()
{
    int n, m;
    cin >> n >> m;
    DSU d(n);
    vector<pair<int, pair<int, int>>> g(n - 1);
    forr(i, n - 1)
    {
        cin >> g[i].second.first >> g[i].second.second >> g[i].first;
        g[i].second.first--, g[i].second.second--;
    }
    vector<pair<int, int>> q(m);
    forr(i, m)
    {
        cin >> q[i].first;
        q[i].second = i;
    }
    sort(all(g));
    sort(all(q));
    vector<int> ans(m);
    int j = 0, res = 0;
    for (auto &i : q)
    {
        while (j < n - 1 && g[j].first <= i.first)
        {
            auto data = d.united(g[j].second.first, g[j].second.second);
            if (data.first.first)
                res += data.first.second - data.second.first - data.second.second;
            j++;
        }
        ans[i.second] = res;
        // res[i.second] = d.resp[d.get(g[j].second.first)];
    }
    for (auto &i : ans)
        cout << i << ' ';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
