// C. Аппарат Констанции
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Констанция — самая умная девушка в своей деревне, но вот зрением она не блещет.

// Однажды она изобрела невероятный аппарат! Когда вы произносите букву, аппарат
// записывает её на лист бумаги. Например, если вы произнесёте буквы 'c', 'o', 'd' и 'e'
// в таком порядке, то аппарат запишет «code» на бумаге. Благодаря этому изобретению
// она наконец-то может писать письма, не надевая очки.

// Однако её глупый друг Акко решил над ней подшутить. Акко испортил аппарат так, что
// если произнести 'w', то будет записано «uu» вместо «w», и если произнести 'm',
// то будет записано «nn» вместо «m». Так как зрение у Констанции довольно плохое,
// она не заметила, что Акко сделал.

// Остальные буквы работают так же, как и прежде — если произнести любую букву,
// кроме 'w' и 'm', то аппарат просто запишет её на бумаге.

// На следующий день я получил письмо. Я его не смог разобрать, так что я решил,
// что это либо какая-то тарабарщина от Акко, либо то, что записала Констанция своим
// аппаратом. Но так как мне известно, что совершил Акко, мне захотелось перечислить
// все возможные строки, которые могли получиться в результате записи аппаратом
// Констанции, чтобы посмотреть, могло ли это быть посланным сообщением.

// Таким образом, мне хочется узнать, сколько понадобится бумаги для этой затеи.
// В этом мне не помешает твоя помощь. Подскажи мне количество строк, которые аппарат
// Констанции мог превратить в полученное мной сообщение.

// Так как данное число могло получиться довольно большим, сообщи мне остаток от его
// деления на 10^9 + 7.

// Если не существует ни одной такой строки, что аппарат Констанции мог превратить
// их в полученное мной сообщение, то выведите 0.

// Входные данные
// В единственной строке содержится строка s (1 ≤ |s| ≤ 10^5) — полученное сообщение.
// s содержит только строчные латинские буквы.

// Выходные данные
// Выведите одно целое число — количество строк, которые аппарат Констанции мог
// превратить в полученное мной сообщение s, по модулю 10^9 + 7.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// ouuokarinn
// ======================================================================
// Выходные данные
// ======================================================================
// 4

// ======================================================================
// Входные данные
// ======================================================================
// banana
// ======================================================================
// Выходные данные
// ======================================================================
// 1

// ======================================================================
// Входные данные
// ======================================================================
// nnn
// ======================================================================
// Выходные данные
// ======================================================================
// 3

// ======================================================================
// Входные данные
// ======================================================================
// amanda
// ======================================================================
// Выходные данные
// ======================================================================
// 0
// ======================================================================

// Примечание
// В первом примере возможные строки: «ouuokarinn», «ouuokarim», «owokarim» и «owokarinn».

// Во втором примере есть только одна строка: «banana».

// В третьем примере возможные строки: «nm», «mn» и «nnn».

// В последнем примере нет ни одной строки, которую аппарат бы вывел как «amanda»,
// так как аппарат не может напечатать 'm'.

#include <bits/stdc++.h>
using namespace std;

#define int long long

const int MOD = 1e9 + 7;

void solve()
{
    string s;
    cin >> s;
    int res = 1;
    vector<int> fibo(1e5 + 5);
    fibo[0] = 1;
    fibo[1] = 1;
    for (int i = 2; i < 1e5 + 5; i++)
        fibo[i] = (fibo[i - 1] + fibo[i - 2]) % MOD;

    bool ok = s[0] != 'm' && s[0] != 'w';
    for (int i = 1; i < s.size();)
    {
        int t = 1, k = 0;
        if (s[i] == s[i - 1] && (s[i] == 'u' || s[i] == 'n'))
        {
            while (s[i] == s[i - 1] && (s[i] == 'u' || s[i] == 'n'))
            {
                t++;
                i++;
            }
        }
        else
            k = 1;
        ok = ok && s[i] != 'm' && s[i] != 'w';
        res = (res * fibo[t]) % MOD;
        i += k;
    }
    cout << ok * res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
