// A. Перестановки
// ограничение по времени на тест1 second
// ограничение по памяти на тест256 megabytes

// Дано n k-значных целых чисел. Требуется так переставить цифры в числах, чтобы
// разница между максимальным и минимальным числом была минимальна. Цифры во всех
// числах переставляются по одному и тому же правилу.

// Входные данные
// В первой строке заданы целые числа n и k — количество и разрядность чисел
// соответственно (1 ≤ n, k ≤ 8). В следующих n строках задаются k-значные
// положительные целые числа. Лидирующие нули разрешены как в исходных,
// так и в полученных после перестановки числах.

// Выходные данные
// Выведите одно число — минимальную возможную разницу между максимальным
// и минимальным числом после перестановки цифр во всех числах по одному
// и тому же правилу.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 6 4
// 5237
// 2753
// 7523
// 5723
// 5327
// 2537
// ======================================================================
// Выходные данные
// ======================================================================
// 2700

// ======================================================================
// Входные данные
// ======================================================================
// 3 3
// 010
// 909
// 012
// ======================================================================
// Выходные данные
// ======================================================================
// 3

// ======================================================================
// Входные данные
// ======================================================================
// 7 5
// 50808
// 36603
// 37198
// 44911
// 29994
// 42543
// 50156
// ======================================================================
// Выходные данные
// ======================================================================
// 20522
// ======================================================================

// Примечание
// В первом примере, если поменять порядок цифр в числах на (3, 1, 4, 2), то 2-е
// и 4-е число будут равны 5237 и 2537 соответственно (они — максимальные
// и минимальные для такого порядка чисел).

// Во втором примере, поменяв вторые по порядку цифры с первыми, получим числа 100,
// 99 и 102.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, k;
    cin >> n >> k;
    vector<string> a(n);
    vector<int> inx(k);
    for (auto &i : a)
        cin >> i;

    iota(inx.begin(), inx.end(), 0);

    int best_res = 1e9;
    do
    {
        int mx = 0, mn = 1e10;
        for (int i = 0; i < n; i++)
        {
            string cur_num = a[i];
            int t = 0;
            for (int j = 0; j < k; j++)
                t = t * 10 + (cur_num[inx[j]] - '0');
            // 2 1 0   123
            // 300

            mx = max(mx, t);
            mn = min(mn, t);
        }
        best_res = min(best_res, mx - mn);
    } while (next_permutation(inx.begin(), inx.end()));
    cout << best_res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
