// C. Очередная сломанная клавиатура
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Недавно Norge нашёл строку s = s1 s2 … sn, состоящую из n строчных букв латинского
// алфавита. В качестве упражнения для улучшения скорости печатания он решил напечатать
// все подстроки s. Да, все n(n+1)/2 из них!

// Подстрокой строки s называется непустая строка x = s[a…b] = sa sa+1 … sb
// (1 ≤ a ≤ b ≤ n). Например, «auto» и «ton» являются подстроками «automaton».

// Незадолго до начала упражнения Norge осознал, что его клавиатура сломана, а если
// говорить более точно, он может использовать только k латинских букв c1, c2, …, ck
// из 26.

// После этого Norge стало интересно, как много подстрок строки s он сможет написать,
// используя свою сломанную клавиатуру. Помогите ему найти это число.

// Входные данные
// Первая строка входных данных содержит два целых числа n и k
// (1 ≤ n ≤ 2·10^5, 1 ≤ k ≤ 26) — длину строки s и количество латинских букв,
// доступных на клавиатуре.

// Вторая строка входных данных содержит строку s, состоящую ровно из n строчных букв
// латинского алфавита.

// Третья строка содержит k различных строчных букв латинского алфавита
// c1, c2, …, ck — буквы, доступные на клавиатуре.

// Выходные данные
// Выведите одно целое число — количество подстрок s, которые можно написать,
// используя только доступные буквы c1, c2, …, ck.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 7 2
// abacaba
// a b
// ======================================================================
// Выходные данные
// ======================================================================
// 12

// ======================================================================
// Входные данные
// ======================================================================
// 10 3
// sadfaasdda
// f a d
// ======================================================================
// Выходные данные
// ======================================================================
// 21

// ======================================================================
// Входные данные
// ======================================================================
// 7 1
// aaaaaaa
// b
// ======================================================================
// Выходные данные
// ======================================================================
// 0
// ======================================================================

// Примечание
// В первом примере Norge может напечатать подстроки s[1…2], s[2…3], s[1…3], s[1…1],
// s[2…2], s[3…3], s[5…6], s[6…7], s[5…7], s[5…5], s[6…6], s[7…7].

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, k;
    cin >> n >> k;
    vector<bool> ch(26, 0);
    string s;
    cin >> s;
    for (int i = 0; i < k; i++)
    {
        char a;
        cin >> a;
        ch[a - 'a'] = 1;
    }
    int r = 0, res = 0;
    for (int l = 0; l < n; l++)
    {
        r = l;
        while (r < n && ch[s[r] - 'a'])
            r++;
        res += (r - l) * (r - l + 1) / 2;
        l = r;
    }
    cout << res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
