// F. Максимально белое поддерево
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вам задано дерево, состоящее из n вершин. Деревом называется связный неориентированный
// граф с n−1 ребром. Каждая вершина v этого дерева имеет свой цвет (a_v = 1, если вершина v
// белая, и 0, если вершина v чёрная).

// Вам нужно решить следующую задачу для каждой вершины v: какую максимальную разницу
// между количеством белых вершин и количеством чёрных вершин вы можете получить, если
// выберете некоторое поддерево заданного дерева, которое содержит вершину v? Поддеревом
// дерева называется связный подграф заданного дерева. Более формально, если вы выберете
// поддерево, которое содержит cnt_w белых вершин и cnt_b чёрных вершин, вам нужно
// максимизировать cnt_w − cnt_b.

// Входные данные
// Первая строка теста содержит одно целое число n (2 ≤ n ≤ 2·10^5) — количество вершин
// в дереве.

// Вторая строка теста содержит n целых чисел a1, a2, …, a_n (0 ≤ a_i ≤ 1), где a_i —
// это цвет i-й вершины.

// Каждая из последующих n−1 строк описывает ребро в дереве. Ребро i задаётся двумя
// целыми числами u_i и v_i — номерами вершин, которые оно соединяет
// (1 ≤ u_i, v_i ≤ n, u_i ≠ v_i).

// Гарантируется, что заданные рёбра образуют дерево.

// Выходные данные
// Выведите n целых чисел res1, res2, …, res_n, где res_i — максимальная возможная
// разница между количеством белых и количеством чёрных вершин в некотором поддереве,
// которое содержит вершину i.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 9
// 0 1 1 1 0 0 0 0 1
// 1 2
// 1 3
// 3 4
// 3 5
// 2 6
// 4 7
// 6 8
// 5 9
// ======================================================================
// Выходные данные
// ======================================================================
// 2 2 2 2 2 1 1 0 2

// ======================================================================
// Входные данные
// ======================================================================
// 4
// 0 0 1 0
// 1 2
// 1 3
// 1 4
// ======================================================================
// Выходные данные
// ======================================================================
// 0 -1 1 -1
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long
#define all(a) a.begin(), a.end()

int n;
vector<vector<int>> g;
vector<int> a, dp, res;

void DFS(int v, int parent)
{
    dp[v] = a[v];
    for (auto &i : g[v])
    {
        if (i != parent)
        {
            DFS(i, v);
            // if (dp[i] > 0)
            dp[v] += max(dp[i], 0LL);
        }
    }
}

void DFS1(int v, int parent)
{
    for (auto &i : g[v])
    {
        if (i != parent)
        {
            int profit = res[v] - max(0LL, dp[i]);
            res[i] = dp[i] + max(0LL, profit);
            DFS1(i, v);
        }
    }
}

void solve()
{
    cin >> n;
    g.resize(n);
    a.resize(n);
    dp.assign(n, 0);
    res.resize(n);

    for (auto &i : a)
    {
        cin >> i;
        i = (i ? i : -1);
    }
    for (int i = 0; i < n - 1; i++)
    {
        int a, b;
        cin >> a >> b;
        a--, b--;
        g[a].push_back(b);
        g[b].push_back(a);
    }

    DFS(0, -1);
    res[0] = dp[0];
    DFS1(0, -1);

    for (auto &i : res)
        cout << i << ' ';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
