// D. Пара тем
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// На следующей лекции в университете нужно обсудить две темы. i-я тема интересна
// на a_i единиц для преподавателя и на b_i единиц для студентов.

// Пара тем i и j (i < j) называется хорошей, если a_i + a_j > b_i + b_j
// (т.е. эта пара тем более интересна преподавателю).

// Ваша задача — найти количество хороших пар тем.

// Входные данные
// Первая строка теста содержит одно целое число n (2 ≤ n ≤ 2·10^5) — количество тем.

// Вторая строка теста содержит n целых чисел a1, a2, …, a_n (1 ≤ a_i ≤ 10^9),
// где a_i — уровень интереса к i-й теме у преподавателя.

// Третья строка теста содержит n целых чисел b1, b2, …, b_n (1 ≤ b_i ≤ 10^9),
// где b_i — уровень интереса к i-й теме у студентов.

// Выходные данные
// Выведите одно целое число — количество хороших пар тем.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 4 8 2 6 2
// 4 5 4 1 3
// ======================================================================
// Выходные данные
// ======================================================================
// 7

// ======================================================================
// Входные данные
// ======================================================================
// 4
// 1 3 2 4
// 1 3 2 4
// ======================================================================
// Выходные данные
// ======================================================================
// 0
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;
    for (auto &i : a)
    {
        int x;
        cin >> x;
        i -= x;
    }
    sort(a.begin(), a.end());
    int l = 0, r = n - 1, res = 0;
    while (r > l)
    {
        if (a[l] + a[r] > 0)
        {
            res += r - l;
            r--;
        }
        else
        {
            l++;
        }
    }
    cout << res;

    // for (auto &i : a)
    //     cout << i << ' ';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
