// B. K-я красивая строка
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Для заданного целого числа n (n > 2) выпишем все строки длины n, которые содержат
// в себе n − 2 буквы 'a' и две буквы 'b', в лексикографическом (алфавитном) порядке.

// Напомним, что строка s длины n лексикографически меньше строки t длины n, если
// существует такое i (1 ≤ i ≤ n), что s_i < t_i, а для всех j (1 ≤ j < i) s_j = t_j.
// Лексикографическое сравнение строк реализовано при помощи оператора < в современных
// языках программирования.

// Например, если n = 5, то получатся следующие строки (их порядок важен):

// aaabb
// aabab
// aabba
// abaab
// ababa
// abbaa
// baaab
// baaba
// babaa
// bbaaa

// Легко показать, что такой список строк будет содержать ровно n·(n−1)/2 строк.

// Вам задано n (n > 2) и k (1 ≤ k ≤ n·(n−1)/2). Выведите k-ю строку из списка.

// Входные данные
// Входные данные содержат один или несколько наборов тестовых данных.

// Первая строка входных данных содержит одно целое число t (1 ≤ t ≤ 10^4) — количество
// наборов тестовых данных в тесте. Затем следуют t наборов тестовых данных.

// Каждый набор тестовых данных содержится на отдельной строке, содержащей два целых
// числа n и k (3 ≤ n ≤ 10^5, 1 ≤ k ≤ min(2·10^9, n·(n−1)/2)).

// Сумма значений n по всем наборам тестовых данных не превосходит 10^5.

// Выходные данные
// Для каждого набора тестовых данных выведите k-ю строку из списка всех описанных
// выше строк длины n. Строки в списке отсортированы лексикографически
// (в алфавитном порядке).

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 7
// 5 1
// 5 2
// 5 8
// 5 10
// 3 1
// 3 2
// 20 100
// ======================================================================
// Выходные данные
// ======================================================================
// aaabb
// aabab
// baaba
// bbaaa
// abb
// bab
// aaaaabaaaaabaaaaaaaa
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void print(int r, int n, int k)
{
    for (int i = 0; i < n - (r + 1); i++)
        cout << 'a';
    cout << 'b';
    for (int i = 0; i < (r * (r + 1)) / 2 - k; i++)
        cout << 'a';
    cout << 'b';
    for (int i = 0; i < n - ((n - (r + 1)) + ((r * (r + 1)) / 2 - k) + 2); i++)
        cout << 'a';
    cout << '\n';
}

void solve()
{
    int n, k;
    cin >> n >> k;
    int l = 0, r = min((int)2e9 + 1, (n * (n - 1) / 2 + 1));
    while (r > l + 1)
    {
        int m = (l + r) / 2;
        if ((m * (m + 1)) / 2 < k)
            l = m;
        else
            r = m;
    }
    print(r, n, k);
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
