// D. Анти-судоку
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вам дано корректное решение головоломки судоку. Если вы не знаете, что такое судоку,
// то вы можете прочитать об этом здесь.

// Блоки ограничены жирным чёрным цветом.

// Ваша задача — заменить не более 9 элементов этого поля (то есть выбрать некоторые
// 1 ≤ i, j ≤ 9 и заменить число в позиции (i, j) на любое другое число в отрезке [1; 9]),
// чтобы получить анти-судоку. Анти-судоку — это поле размера 9×9, в котором:

// - Каждое число на этом поле находится в отрезке [1; 9];
// - Каждая строка содержит как минимум два одинаковых элемента;
// - Каждый столбец содержит как минимум два одинаковых элемента;
// - Каждый блок размера 3×3 (о том, что такое блок, вы можете прочитать по ссылке выше)
//   содержит как минимум два одинаковых элемента.

// Гарантируется, что ответ существует.

// Вам нужно ответить на t независимых наборов тестовых данных.

// Входные данные
// Первая строка тестовых данных содержит одно целое число t (1 ≤ t ≤ 10^4) — количество
// наборов тестовых данных. Затем следуют t наборов тестовых данных.

// Каждый набор состоит из 9 строк, каждая строка состоит из 9 символов от 1 до 9
// без пробелов — то есть представляет собой корректное решение головоломки судоку.

// Выходные данные
// Для каждого набора тестовых данных выведите ответ на него — заданное изначально поле
// с не более чем 9 изменёнными в нём элементами так, что полученное поле является
// анти-судоку. Если существует несколько подходящих решений, вы можете вывести любое.
// Гарантируется, что ответ существует.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 1
// 154873296
// 386592714
// 729641835
// 863725149
// 975314628
// 412968357
// 631457982
// 598236471
// 247189563
// ======================================================================
// Выходные данные
// ======================================================================
// 154873396
// 336592714
// 729645835
// 863725145
// 979314628
// 412958357
// 631457992
// 998236471
// 247789563
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    const int n = 9;
    vector<string> a(n);
    for (auto &i : a)
        cin >> i;

    vector<pair<int, int>> c{
        {0, 0},
        {1, 3},
        {2, 6},
        {3, 1},
        {4, 4},
        {5, 7},
        {6, 2},
        {7, 5},
        {8, 8},
    };

    for (auto &i : c)
    {
        if (a[i.first][i.second] == '1')
            a[i.first][i.second] = '2';
        else
            a[i.first][i.second] = '1';
    }

    for (auto &i : a)
        cout << i << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
