// A. Прибавление степеней
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// У вас есть массив a длины n. Для каждого положительного числа x в течение x-й секунды
// вы собираетесь выполнить следующую операцию:

// - Выберите несколько различных индексов i1, i2, …, ik, которые находятся в диапазоне
//   от 1 до n включительно, и добавьте 2x − 1 к каждой соответствующей позиции в a.
//   Формально a_{i_j} := a_{i_j} + 2x − 1 для j = 1, 2, …, k. Обратите внимание,
//   что вы можете также не выбрать ни одного индекса.

// Вы должны сделать a неубывающим как можно быстрее. Найдите наименьшее число T такое,
// что вы можете сделать массив неубывающим не позднее, чем через T секунд.

// Массив a называется неубывающим, если и только если a1 ≤ a2 ≤ … ≤ a_n.

// Вы должны ответить на t независимых тестовых случаев.

// Входные данные
// Первая строка содержит одно целое число t (1 ≤ t ≤ 10^4) — количество тестовых случаев.

// Первая строка каждого тестового случая содержит одно целое число n (1 ≤ n ≤ 10^5) —
// длину массива a. Гарантируется, что сумма значений n по всем тестовым случаям
// не превышает 10^5.

// Вторая строка каждого теста содержит n целых чисел a1, a2, …, a_n
// (−10^9 ≤ a_i ≤ 10^9).

// Выходные данные
// Для каждого тестового примера выведите минимальное количество секунд, за которое
// вы можете сделать a неубывающим.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 3
// 4
// 1 7 6 5
// 5
// 1 2 3 4 5
// 2
// 0 -4
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// 0
// 3
// ======================================================================

// Примечание
// В первом тестовом случае, если вы выберете индексы 3, 4 на 1-й секунде и 4 на 2-й
// секунде, то a станет равным [1, 7, 7, 8]. Есть и другие способы сделать a
// неубывающим за 2 секунды, но вы не можете сделать его неубывающим быстрее.

// Во втором тестовом случае a уже неубывающий, поэтому ответ равен 0.

// В третьем тестовом случае, если вы ничего не сделаете в первые 2 секунды
// и в течение 3-й секунды выберете индекс 2, a станет равным [0, 0].

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n), r(n);
    for (auto &i : a)
        cin >> i;

    for (int i = 1; i < n; i++)
    {
        if (i == 1)
            r[i] = max(0LL, a[i - 1] - a[i]);
        else
            r[i] = max(0LL, (a[i - 1] - a[i] >= 0 ? r[i - 1] + a[i - 1] - a[i] : (a[i - 1] + r[i - 1] - a[i])));
    }
    int targ = *max_element(r.begin(), r.end());
    int le = 0, ri = 31;
    while (ri > le + 1)
    {
        int m = (le + ri) / 2;
        int t1 = 1 << m;
        if ((1 << m) <= targ)
            le = m;
        else
            ri = m;
    }
    cout << (targ ? le + 1 : 0) << '\n';

    // for (auto &i : r)
    //     cout << i << ' ';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
