// C. Чередующаяся подпоследовательность
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Напомним, что последовательность b является подпоследовательностью последовательности a,
// если b может быть получена из a путём удаления нуля или более элементов без изменения
// порядка оставшихся элементов. Например, если a = [1, 2, 1, 3, 1, 2, 1], то возможные
// подпоследовательности: [1, 1, 1, 1], [3] и [1, 2, 1, 3, 1, 2, 1], но не [3, 2, 3]
// и [1, 1, 1, 1, 2].

// Вам задана последовательность a, состоящая из n положительных и отрицательных
// элементов (в последовательности нет нулей).

// Ваша задача — выбрать максимальную по размеру (длине) чередующуюся подпоследовательность
// заданной последовательности (то есть знак каждого следующего элемента противоположен
// знаку текущего элемента, например, положительный-отрицательный-положительный и так
// далее или отрицательный-положительный-отрицательный и так далее). Из всех таких
// подпоследовательностей вам нужно выбрать ту, которая имеет максимальную сумму элементов.

// Другими словами, если максимальная длина чередующейся подпоследовательности равна k,
// то ваша задача — найти максимальную сумму элементов какой-то чередующейся
// подпоследовательности длины k.

// Вам нужно ответить на t независимых наборов тестовых данных.

// Входные данные
// Первая строка теста содержит одно целое число t (1 ≤ t ≤ 10^4) — количество наборов
// тестовых данных. Затем следуют t наборов тестовых данных.

// Первая строка каждого набора тестовых данных содержит одно целое число n
// (1 ≤ n ≤ 2·10^5) — количество элементов в a. Вторая строка каждого набора входных
// данных содержит n целых чисел a1, a2, …, a_n (−10^9 ≤ a_i ≤ 10^9, a_i ≠ 0),
// где a_i — i-й элемент в a.

// Гарантируется, что сумма чисел n по всем наборам тестовых данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора тестовых данных выведите ответ на него — максимальную сумму
// максимальной по размеру (длине) чередующейся подпоследовательности a.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 5
// 1 2 3 -1 -2
// 4
// -1 -2 -1 -3
// 10
// -2 8 3 8 -4 -15 5 -2 -3 1
// 6
// 1 -1000000000 1 -1000000000 1 -1000000000
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// -1
// 6
// -2999999997
// ======================================================================

// Примечание
// В первом наборе тестовых данных одним из возможных ответов является [1, 2, 3, −1, −2].

// Во втором наборе тестовых данных одним из возможных ответов является [−1, −2, −1, −3].

// В третьем наборе тестовых данных одним из возможных ответов является
// [−2, 8, 3, 8, −4, −15, 5, −2, −3, 1].

// В четвёртом наборе тестовых данных одним из возможных ответов является
// [1, −1000000000, 1, −1000000000, 1, −1000000000].

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;

    int res = 0, l = 0, r = 0;
    while (r < n)
    {
        int cur_z = a[l] / abs(a[l]);
        int cur_mx = -1e9;
        while (r < n && a[r] / abs(a[r]) == cur_z)
        {
            cur_mx = max(cur_mx, a[r]);
            r++;
        }
        res += cur_mx;
        l = r;
    }
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
