// B. Сумма слагаемых одинаковой четности
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Заданы два целых положительных числа n (1 ≤ n ≤ 10^9) и k (1 ≤ k ≤ 100).
// Представьте число n в виде суммы k положительных целых чисел одинаковой чётности
// (с одинаковыми остатками от деления на 2).

// Иными словами, найдите такие a1, a2, …, a_k, что все a_i > 0, n = a1 + a2 + … + a_k
// и либо все a_i одновременно чётные, либо все a_i одновременно нечётные. Если такого
// представления не существует, то сообщите об этом.

// Входные данные
// В первой строке записано целое число t (1 ≤ t ≤ 1000) — количество наборов
// входных данных в тесте. Далее записаны t наборов входных данных по одному в строке.

// Каждый набор представляет собой два целых положительных числа n (1 ≤ n ≤ 10^9)
// и k (1 ≤ k ≤ 100).

// Выходные данные
// Для каждого набора входных данных выведите:

// - YES и искомые a_i, если ответ существует (если ответов несколько, то выведите
//   любой из них);
// - NO, если ответа не существует.

// Буквы в словах YES и NO можно выводить в любом регистре.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 8
// 10 3
// 100 4
// 8 7
// 97 2
// 8 8
// 3 10
// 5 3
// 1000000000 9
// ======================================================================
// Выходные данные
// ======================================================================
// YES
// 4 2 4
// YES
// 55 5 5 35
// NO
// NO
// YES
// 1 1 1 1 1 1 1 1
// NO
// YES
// 3 1 1
// YES
// 111111110 111111110 111111110 111111110 111111110 111111110 111111110 111111110 111111120
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, k;
    cin >> n >> k;
    if (n % k == 0)
    {
        cout << "YES\n";
        for (int i = 0; i < k; i++)
            cout << n / k << ' ';
        cout << '\n';
        return;
    }

    if ((n - (2 * (k - 1))) % 2 == 0 && n - (2 * (k - 1)) > 0)
    {
        cout << "YES\n";
        for (int i = 0; i < k - 1; i++)
            cout << "2 ";
        cout << n - (2 * (k - 1)) << '\n';
    }
    else if ((n - (k - 1)) % 2 != 0 && (n - (k - 1)) % 2 > 0)
    {
        cout << "YES\n";
        for (int i = 0; i < k - 1; i++)
            cout << "1 ";
        cout << n - (k - 1) << '\n';
    }
    else
        cout << "NO\n";
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
