// C. K-е неделящееся на n
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Заданы два целых положительных числа: n и k. Выведите k-е положительное целое число,
// которое не делится на n.

// Например, если n = 3, а k = 7, то все числа, которые не делятся на 3, имеют вид:
// 1, 2, 4, 5, 7, 8, 10, 11, 13, … . 7-е число среди них равно 10.

// Входные данные
// В первой строке записано целое число t (1 ≤ t ≤ 1000) — количество наборов
// входных данных в тесте. Далее записаны t наборов входных данных по одному в строке.

// Каждый набор представляет собой два целых положительных числа n (2 ≤ n ≤ 10^9)
// и k (1 ≤ k ≤ 10^9).

// Выходные данные
// Для каждого набора входных данных выведите k-е целое положительное число,
// которое не делится на n.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 3 7
// 4 12
// 2 1000000000
// 7 97
// 1000000000 1000000000
// 2 1
// ======================================================================
// Выходные данные
// ======================================================================
// 10
// 15
// 1999999999
// 113
// 1000000001
// 1
// ======================================================================
#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, k;
    cin >> n >> k;
    cout << k + ((k - 1) / (n - 1)) << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }

    return 0;
}