// B. Троичная строка
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вам дана строка s, каждый символ которой — 1, 2 или 3. Вы должны выбрать кратчайшую
// непрерывную подстроку s, в которой каждый из трёх символов встречается хотя бы один раз.

// Непрерывная подстрока s — строка, которую можно получить из s удалением какого-то
// количества (возможно, ни одного) символов из начала строки s и какого-то количества
// (возможно, ни одного) символов из конца строки s.

// Входные данные
// В первой строке задано одно целое число t (1 ≤ t ≤ 20000) — количество наборов
// входных данных.

// Каждый набор входных данных состоит из одной строки s (1 ≤ |s| ≤ 200000).
// Гарантируется, что каждый символ s — 1, 2 или 3.

// Сумма длин всех строк не превосходит 200000.

// Выходные данные
// Для каждого набора тестовых данных выведите одно число — длину кратчайшей подстроки s,
// содержащей символы всех трёх типов. Если такой подстроки нет, выведите 0.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 7
// 123
// 12222133333332
// 112233
// 332211
// 12121212
// 333333
// 31121
// ======================================================================
// Выходные данные
// ======================================================================
// 3
// 3
// 4
// 4
// 0
// 0
// 4
// ======================================================================

// Примечание
// Рассмотрим пример из условия:

// В первом наборе входных данных можно использовать подстроку 123.

// Во втором наборе входных данных можно использовать подстроку 213.

// В третьем наборе входных данных можно использовать подстроку 1223.

// В четвёртом наборе входных данных можно использовать подстроку 3221.

// В пятом наборе входных данных в s нет символа 3.

// В шестом наборе входных данных в s нет символа 1.

// В седьмом наборе входных данных можно использовать подстроку 3112.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    string s;
    cin >> s;
    int l = 0, r = 0, cnt1 = 0, cnt2 = 0, cnt3 = 0, n = s.size(), best_res = 1e18;
    bool ok = 0;
    while (r < n)
    {
        while (r < n && (!cnt1 || !cnt2 || !cnt3))
        {
            cnt1 += s[r] == '1';
            cnt2 += s[r] == '2';
            cnt3 += s[r] == '3';
            r++;
        }
        while (l < r && (cnt1 && cnt2 && cnt3))
        {
            ok = 1;
            cnt1 -= s[l] == '1';
            cnt2 -= s[l] == '2';
            cnt3 -= s[l] == '3';
            l++;
        }
        // if (cnt1 && cnt2 && cnt3)
        best_res = min(best_res, r - l + 1);
    }
    if (!ok)
        cout << "0\n";
    else
        cout << best_res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
