// B. Юные следопыты
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Отряд юных следопытов отправился в учебную экспедицию навстречу своим первым
// приключениям. И возглавляет их старший следопыт Рассел. Вот герои зашли в лес,
// разбили лагерь и дальше решили разделиться на группы, чтобы исследовать как можно
// больше интересных мест. Рассел должен был выбрать состав групп, но столкнулся
// с одной проблемой...

// Многие юные следопыты неопытны, и отправлять их маленькими группами — не всегда
// хорошая идея. Даже сам Рассел недавно стал старшим следопытом и нечасто бывал
// в экспедициях. Каждый следопыт характеризуется своей неопытностью — целым
// положительным числом e_i. Рассел решил, что юный следопыт с неопытностью e может
// идти лишь в группе, количество следопытов в которой не меньше e.

// Теперь задача Рассела — определить, какое наибольшее число групп следопытов он
// сможет организовать. При этом может получиться, что некоторые следопыты не войдут
// в состав ни одной группы, это не страшно, ведь и в лагере для них найдётся работа.
// Рассел очень переживает за успех экспедиции, и потому попросил вас помочь ему.

// Входные данные
// В первой строке записано число T (1 ≤ T ≤ 2·10^5) — количество независимых
// тестовых случаев. В следующих 2T строках следует описание тестовых случаев.

// В первой строке описания каждого теста задано целое число юных следопытов N
// (1 ≤ N ≤ 2·10^5).

// В следующей строке записаны N целых чисел e1, e2, …, e_N (1 ≤ e_i ≤ N), где e_i —
// неопытность i-го следопыта.

// Гарантируется, что сумма N по всем тестовым случаям не превосходит 3·10^5.

// Выходные данные
// Выведите T чисел, каждое на отдельной строке.

// В i-й строке выведите наибольшее число групп, которое можно организовать в i-м
// тестовом случае.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 2
// 3
// 1 1 1
// 5
// 2 3 1 2 2
// ======================================================================
// Выходные данные
// ======================================================================
// 3
// 2
// ======================================================================

// Примечание
// В первом примере можно сформировать три группы, в каждой из которых будет один
// следопыт. Это возможно, так как неопытность всех трёх следопытов равна 1,
// что не меньше, чем размер их групп.

// Во втором примере можно сформировать две группы. В первой группе окажутся следопыты
// с неопытностью 1, 2 и 3, а во второй группе — два следопыта с неопытностью 2.

// Этот способ — не единственный возможный. Можно, например, сформировать одну группу
// из трёх следопытов с неопытностью 2, а также ещё одну группу, в которой будет всего
// один следопыт с неопытностью 1. При таком разбиении на группы следопыт с неопытностью
// 3 не войдёт в состав ни одной группы.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, res = 0;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;

    sort(a.begin(), a.end());
    int l = 0, r = 0;
    while (r < n)
    {
        while (r + 1 < n && r - l + 1 < a[r])
            r++;
        if (r < n && r - l + 1 >= a[r])
            res++;
        r++;
        l = r;
    }

    cout << res << '\n';
}

// 1 2 2 2 3

// 1 1 3

// 1 1 1
// 0 1 2 3 4
// 1 2 2 2 3
// !
// 1 2

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
