// C. Смешиваем воду
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Есть два бесконечных источника воды:

// - горячая вода температуры h;
// - холодная вода температуры c (c < h).

// Вы совершаете следующую чередующуюся последовательность действий:

// - набрать одну кружку горячей воды и вылить её в бесконечно глубокую бочку;
// - набрать одну кружку холодной воды и вылить её в бесконечно глубокую бочку;
// - набрать одну кружку горячей воды …
// - и так далее …

// Обратите внимание, что вы всегда начинаете с кружки горячей воды.

// Бочка изначально пустая. Необходимо налить хотя бы одну кружку в бочку. Температура
// воды в бочке равна средней температуре вылитых кружек.

// Вы хотите получить воду температуры как можно ближе к t. То есть если температура
// воды в бочке равна t_b, то абсолютная разность t_b и t (|t_b − t|) должна быть
// минимально возможна.

// Сколько кружек необходимо налить в бочку, чтобы температура стала как можно ближе
// к t? Если существует несколько ответов с минимальной абсолютной разностью,
// то выведите наименьший из них.

// Входные данные
// В первой строке записано одно целое число T (1 ≤ T ≤ 3·10^4) — количество наборов
// входных данных.

// В каждой из следующих T строк записаны по три целых числа h, c и t
// (1 ≤ c < h ≤ 10^6; c ≤ t ≤ h) — температура горячей воды, температура холодной воды
// и желаемая температура в бочке.

// Выходные данные
// На каждый набор входных данных выведите одно положительное целое число — минимальное
// количество кружек, которое необходимо вылить в бочку, чтобы получить температуру,
// как можно более близкую к t.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 3
// 30 10 20
// 41 15 30
// 18 13 18
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// 7
// 1
// ======================================================================

// Примечание
// В первом наборе входных данных температура после 2 налитых кружек: 1 горячей
// и 1 холодной — равна 20. И это самое близкое возможное значение.

// Во втором наборе температура после 7 налитых кружек: 4 горячих и 3 холодных —
// примерно 29.857. Если наливать больше воды, то температура не станет ближе к t.

// В третьем наборе температура после 1 налитой кружки: 1 горячей — равна 18.
// Это совпадает с t.

#include <bits/stdc++.h>
using namespace std;

#define int long long
#define all(a) a.begin(), a.end()
#define forr(i, n) for (int i = 0; i < n; i++)

void solve()
{
    int h, c, t;
    cin >> h >> c >> t;
    //  БЛЯЯЯЯ ПИЗДЕЦ ТАМ В РАЗБОРЕ ПОЛНАЯ ХУЙНЯ КАКАЯ ТО
    //  БРО ЭТО ПИЗДЕЦ Я СЛИШКОМ ТУПОЙ ДЛЯ ТАКОЙ ХУЙНМ
    //  О БОЖЕЕЕЕЕ ТАМ СТОЛЬКО МАТЕМАТИКИ
    //  РАЗБОР : https://codeforces.com/blog/entry/78116
    //  ЭЬтО ПИЗДА Я НИХУЙ НЕ ПОНЯЛ мб потом разберусь
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
