// A. Выбор нечетных
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// У Shubham есть массив a размера n, и он хочет выбрать из него ровно x элементов так,
// чтобы их сумма была нечетной. Эти элементы не обязаны быть последовательными.
// Элементы массива не обязательно различны.

// Скажите ему, может ли он сделать это.

// Входные данные
// В первой строке входных данных содержится одно целое число t (1 ≤ t ≤ 100) —
// количество наборов входных данных. Далее следуют описания наборов входных данных.

// Первая строка каждого набора входных данных содержит два целых числа n и x
// (1 ≤ x ≤ n ≤ 1000) — длину массива и количество элементов, которые нужно выбрать
// соответственно.

// Следующая строка каждого набора входных данных содержит n целых чисел
// a1, a2, …, an (1 ≤ ai ≤ 1000) — элементы массива.

// Выходные данные
// Для каждого набора входных данных выведите «Yes» или «No» в зависимости от того,
// можно ли выбрать ровно x элементов, чтобы их сумма была нечетной.

// Вы можете выводить буквы в любом регистре.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 1 1
// 999
// 1 1
// 1000
// 2 1
// 51 50
// 2 2
// 51 50
// 3 3
// 101 102 103
// ======================================================================
// Выходные данные
// ======================================================================
// Yes
// No
// Yes
// Yes
// No
// ======================================================================

// Примечание
// В 1-м наборе входных данных: мы должны выбрать элемент 999, и сумма будет нечетной.

// Во 2-м наборе входных данных: мы должны выбрать элемент 1000, поэтому сумма не будет
// нечетной.

// В 3-м наборе входных данных: мы можем выбрать элемент 51.

// В 4-м наборе входных данных: мы должны выбрать оба элемента 50 и 51 — так что общая
// сумма нечетна.

// В 5-м наборе входных данных: мы должны выбрать все элементы — но общая сумма
// не является нечетной.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, x;
    cin >> n >> x;
    int cnt1 = -1, cnt0 = 0;
    for (int i = 0; i < n; i++)
    {
        int x;
        cin >> x;
        cnt1 += x % 2;
        cnt0 += !(x % 2);
    }
    if (cnt1 == -1)
    {
        cout << "No\n";
        return;
    }

    for (int i = 0; i < x; i += 2)
    {
        if (cnt1 >= i && cnt0 >= (x - i - 1))
        {
            cout << "Yes\n";
            return;
        }
    }
    cout << "No\n";
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
