// A. XXXXX
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Ехаб любит теорию чисел, но по какой-то причине он ненавидит число x. Для данного
// массива a найдите длину самого длинного его подмассива, сумма элементов которого
// не делится на x, или определите, что такого подмассива не существует.

// Массив a является подмассивом массива b, если a может быть получен из b удалением
// нескольких (возможно, ни одного или всех) элементов из начала и нескольких
// (возможно, ни одного или всех) элементов из конца.

// Входные данные
// Первая строка содержит целое число t (1 ≤ t ≤ 5) — количество наборов входных
// данных. Описание наборов входных данных приведено ниже.

// Первая строка каждого набора входных данных содержит два целых числа n и x
// (1 ≤ n ≤ 10^5, 1 ≤ x ≤ 10^4) — количество элементов в массиве a и число,
// которое Ехаб ненавидит.

// Вторая строка каждого набора входных данных содержит n целых чисел a1, a2, …, a_n
// (0 ≤ a_i ≤ 10^4) — элементы массива a.

// Выходные данные
// Для каждого набора входных данных выведите длину самого длинного подмассива,
// сумма элементов которого не делится на x. Если такого подмассива не существует,
// выведите −1.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 3
// 3 3
// 1 2 3
// 3 4
// 1 2 3
// 2 2
// 0 6
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// 3
// -1
// ======================================================================

// Примечание
// В первом наборе входных данных подмассив [2, 3] имеет сумму элементов 5,
// которая не делится на 3.

// Во втором наборе входных данных сумма всего массива равна 6 и не делится на 4.

// В третьем наборе входных данных все подмассивы имеют чётную сумму, поэтому
// ответ равен −1.

#include <bits/stdc++.h>
using namespace std;

#define int long long

// 1 2 3
// 0 1 3 6
//-1 1-1-1

void solve()
{
    int n, x;
    cin >> n >> x;
    vector<int> a(n), pref(n + 1, 0);
    bool ol_d_n_x = true;
    for (int i = 0; i < n; i++)
    {
        cin >> a[i];
        if (a[i] % x != 0)
            ol_d_n_x = false;
        pref[i + 1] = pref[i] + a[i];
    }
    if (ol_d_n_x)
    {
        cout << "-1\n";
        return;
    }
    if (pref[n] % x != 0)
    {
        cout << n << '\n';
        return;
    }
    int ml = n, mr = 0;
    for (int l = 0; l < n; l++)
    {
        if (a[l] % x != 0)
        {
            ml = l + 1;
            break;
        }
    }
    for (int r = n - 1; r >= 0; r--)
    {
        if (a[r] % x != 0)
        {
            mr = r;
            break;
        }
    }

    cout << max(n - ml, mr) << '\n';
}

int32_t
main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
