// A. Игра с таблицей
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Ashish и Vivek играют в игру на таблице с n строками и m столбцами, захватывая
// клетки. Незахваченные клетки обозначены 0, а захваченные клетки обозначены 1.
// Вам дано исходное состояние таблицы.

// На каждом ходу игрок должен захватить одну клетку. Клетку можно захватить, если она
// ещё не захвачена и она не находится в одной строке или столбце с другой захваченной
// клеткой. Игра кончается, когда игрок не может сделать ход, в таком случае он проигрывает.

// Если Ashish и Vivek ходят по очереди и Ashish ходит первым, найдите победителя игры,
// если они оба играют оптимально.

// Оптимальная игра между двумя игроками означает, что оба игрока выбирают лучшую
// возможную стратегию, чтобы получить наиболее благоприятный для себя результат игры.

// Входные данные
// В первой строке записано одно целое число t (1 ≤ t ≤ 50) — количество наборов
// входных данных. Далее следуют описания наборов входных данных.

// В первой строке каждого набора входных данных записаны два целых числа n, m
// (1 ≤ n, m ≤ 50) — количество строк и столбцов в таблице.

// В каждой из следующих n строк записаны m целых чисел, j-е число на i-й строке
// описывает a_{i,j} (a_{i,j} ∈ {0, 1}).

// Выходные данные
// Для каждого набора входных данных, если Ashish выиграет при правильной игре,
// выведите «Ashish», иначе выведите «Vivek» (без кавычек).

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 2 2
// 0 0
// 0 0
// 2 2
// 0 0
// 0 1
// 2 3
// 1 0 1
// 1 1 0
// 3 3
// 1 0 0
// 0 0 0
// 1 0 0
// ======================================================================
// Выходные данные
// ======================================================================
// Vivek
// Ashish
// Vivek
// Ashish
// ======================================================================

// Примечание
// В первом наборе входных данных один из возможных исходов игры следующий:
// Ashish захватывает клетку (1, 1), затем Vivek захватывает клетку (2, 2).
// Ashish не может захватить ни клетку (1, 2), ни клетку (2, 1), так как клетки
// (1, 1) и (2, 2) уже захвачены. Таким образом, Ashish проигрывает. Можно показать,
// что вне зависимости от ходов Ashish, Vivek выиграет.

// Во втором наборе входных данных Ashish захватывает клетку (1, 1), единственная
// клетка, которую можно захватить. После этого у Vivek не будет возможных ходов.

// В третьем наборе входных данных Ashish не может сделать ход, поэтому Vivek выиграет.

// В четвёртом наборе входных данных Ashish захватывает клетку (2, 3), у Vivek
// не останется возможных ходов.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, m, res = 0;
    cin >> n >> m;
    vector<vector<int>> a(n, vector<int>(m, 0));
    // vector<int> chn(n, 1);
    // vector<int> chm(m, 1);
    int r1 = 0, r2 = 0;
    for (int i = 0; i < n; i++)
    {
        int s = 0;
        for (auto &j : a[i])
        {
            cin >> j;
            s += j;
        }
        r1 += !s;
    }

    for (int j = 0; j < m; j++)
    {
        int s = 0;
        for (int i = 0; i < n; i++)
        {
            s += a[i][j];
        }
        r2 += !s;
    }
    // for (auto &i : chn)
    //     cout << i << ' ';
    // cout << '\n';
    // for (auto &i : chm)
    //     cout << i << ' ';
    // cout << '\n';
    // cout << res << '\n';
    cout << (min(r1, r2) % 2 != 0 ? "Ashish\n" : "Vivek\n");
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
