// B. Проблематичная сортировка
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// У Ashish есть n элементов, расположенных по порядку.

// Каждый элемент задается двумя целыми числами a_i — значение элемента и b_i — тип
// элемента (есть только два возможных типа: 0 и 1). Он хочет отсортировать элементы
// в порядке неубывания a_i.

// Он может совершать следующую операцию произвольное число раз:

// - Выбрать любые два таких элемента i и j, что b_i ≠ b_j, и поменять их местами.
//   Таким образом, он может за ход поменять местами два элемента разных типов.

// Скажите ему, может ли он отсортировать массив в порядке неубывания a_i, используя
// описанные операции.

// Входные данные
// В первой строке записано одно целое число t (1 ≤ t ≤ 100) — количество наборов
// входных данных.

// В первой строке каждого набора входных данных записано одно целое число n
// (1 ≤ n ≤ 500) — размеры массивов.

// Во второй строке записаны n целых чисел a_i (1 ≤ a_i ≤ 10^5) — значение i-го элемента.

// В третьей строке записаны n целых чисел b_i (b_i ∈ {0, 1}) — тип i-го элемента.

// Выходные данные
// Для каждого набора входных данных выведите «Yes» или «No» (без кавычек)
// в зависимости от того, возможно ли отсортировать массив в порядке неубывания
// значений, используя описанные операции.

// Вы можете выводить каждый символ в любом регистре (верхнем или нижнем).

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 4
// 10 20 20 30
// 0 1 0 1
// 3
// 3 1 2
// 0 1 1
// 4
// 2 2 4 8
// 1 1 1 1
// 3
// 5 15 4
// 0 0 0
// 4
// 20 10 100 50
// 1 0 0 1
// ======================================================================
// Выходные данные
// ======================================================================
// Yes
// Yes
// Yes
// No
// Yes
// ======================================================================

// Примечание
// В первом наборе входных данных элементы уже находятся в отсортированном порядке.

// Во втором наборе входных данных Ashish сначала может поменять местами элементы
// на позициях 1 и 2, затем поменять местами элементы на позициях 2 и 3.

// В четвёртом наборе входных данных нельзя поменять местами никакие два элемента,
// так как нет пары i и j, что b_i ≠ b_j. Таким образом, элементы не могут быть
// отсортированы.

// В пятом наборе входных данных Ashish может поменять местами элементы на позициях
// 3 и 4, а затем элементы на позициях 1 и 2.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n), b(n), cnt(2, 0);
    for (auto &i : a)
        cin >> i;

    for (auto &i : b)
    {
        cin >> i;
        cnt[i]++;
    }

    if (cnt[0] > 0 && cnt[1] > 0 || is_sorted(a.begin(), a.end()))
        cout << "Yes\n";
    else
        cout << "No\n";
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
