// D. Решить лабиринт
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Vivek столкнулся с интересной задачей. У него есть лабиринт, который можно описать
// таблицей n × m. Каждая клетка может быть одного из следующих типов:

// - Пустая — '.'
// - Стена — '#'
// - Хороший человек — 'G'
// - Плохой человек — 'B'

// Единственный выход из лабиринта находится в клетке (n, m).

// Человек может перейти в клетку, если она не содержит стену и она имеет общую сторону
// с его текущей клеткой. Vivek хочет заблокировать (заменить на стены) некоторые пустые
// клетки, чтобы все хорошие люди могли дойти до выхода из лабиринта, но чтобы все плохие
// люди не могли. Клетку, которая исходно содержит 'G' или 'B', нельзя блокировать,
// но через неё можно проходить.

// Ваша задача — определить, можно ли заменить несколько (ноль или более) пустых клеток
// на стены, чтобы удовлетворить описанным ограничениям.

// Гарантируется, что клетка (n, m) пустая. Vivek разрешается её блокировать.

// Входные данные
// В первой строке записано одно целое число t (1 ≤ t ≤ 100) — количество наборов
// входных данных. Далее следуют описания наборов входных данных.

// В первой строке каждого набора входных данных записаны два целых числа n, m
// (1 ≤ n, m ≤ 50) — количество строк и столбцов в лабиринте.

// В каждой из следующих n строк записаны m символов. Они описывают исходный лабиринт.
// Если символ в строке равен '.', тогда соответствующая клетка пустая, если символ
// равен '#', тогда клетка содержит стену, а 'G' и 'B' обозначают, что клетка содержит
// хорошего или плохого человека соответственно.

// Выходные данные
// Для каждого набора входных данных выведите «Yes» или «No», в зависимости от того,
// можно ли заменить некоторые пустые клетки на стены, чтобы удовлетворить описанным
// ограничениям.

// Вы можете выводить каждую букву в любом регистре (верхнем или нижнем).

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 1 1
// .
// 1 2
// G.
// 2 2
// #B
// G.
// 2 3
// G.#
// B#.
// 3 3
// #B.
// #..
// GG.
// 2 2
// #B
// B.
// ======================================================================
// Выходные данные
// ======================================================================
// Yes
// Yes
// No
// No
// Yes
// Yes
// ======================================================================

// Примечание
// В первом и во втором наборах входных данных все условия уже выполнены.

// В третьем наборе входных данных есть только одна свободная клетка (2,2), и если
// мы заменим её на стену, то хороший человек в клетке (1,2) не сможет выйти.

// В четвёртом наборе входных данных хороший человек в клетке (1,1) не может сбежать
// с самого начала, поэтому ответ «No».

// В пятом наборе входных данных можно заблокировать клетки (2,3) и (2,2).

// В последнем наборе входных данных можно заблокировать выход (2,2).

#include <bits/stdc++.h>
using namespace std;

#define int long long

const int MoveDirX[]{1, -1, 0, 0};
const int MoveDirY[]{0, 0, 1, -1};
// R L D U
int n, m;
// y x

bool canbuild(int x, int y, int dir) { return x + MoveDirX[dir] >= 0 && x + MoveDirX[dir] < m && y + MoveDirY[dir] >= 0 && y + MoveDirY[dir] < n; }

void DFS(int y, int x, vector<vector<int>> &Ykarta, vector<vector<int>> &visited)
{
    visited[y][x] = 1;
    for (int i = 0; i < 4; i++)
    {
        if (canbuild(x, y, i))
        {
            int t = Ykarta[y + MoveDirY[i]][x + MoveDirX[i]];
            if (t != 0 && !visited[y + MoveDirY[i]][x + MoveDirX[i]])
                DFS(y + MoveDirY[i], x + MoveDirX[i], Ykarta, visited);
        }
    }
}

void solve()
{
    cin >> n >> m;
    vector<vector<int>> Ykarta(n, vector<int>(m, 1));
    vector<pair<int, int>> GStart, BStart;
    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < m; j++)
        {
            char val;
            cin >> val;
            if (val == '#')
                Ykarta[i][j] = 0;
            if (val == 'G')
            {
                GStart.push_back({i, j});
                Ykarta[i][j] = 2;
            }
            if (val == 'B')
            {
                BStart.push_back({i, j});
                Ykarta[i][j] = 3;
            }
        }
    }

    for (int i = 0; i < BStart.size(); i++)
    {
        for (int k = 0; k < 4; k++)
        {
            auto &[y, x] = BStart[i];
            if (canbuild(x, y, k) && Ykarta[y + MoveDirY[k]][x + MoveDirX[k]] == 1)
                Ykarta[y + MoveDirY[k]][x + MoveDirX[k]] = 0;
        }
    }
    if (GStart.empty())
    {
        cout << "Yes\n";
        return;
    }

    // for (auto &y : Ykarta)
    // {
    //     for (auto &x : y)
    //         cout << x << ' ';
    //     cout << '\n';
    // }
    vector<vector<int>> visited(n, vector<int>(m, 0));

    DFS(n - 1, m - 1, Ykarta, visited);
    bool ok = 1;
    for (auto &[y, x] : GStart)
        ok = ok && visited[y][x];

    for (auto &[y, x] : BStart)
        ok = ok && !visited[y][x];
    cout << (ok ? "Yes\n" : "No\n");
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
