// C. Соответствия поворотом
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// После мистического исчезновения Ashish каждый из его любимых учеников Ishika и Hriday
// получил одну половину секретного сообщения. Эти сообщения могут быть описаны
// перестановками размера n. Назовём их a и b.

// Напомним, что перестановка из n элементов — это последовательность чисел a1, a2, …, a_n,
// в которой каждое число от 1 до n встречается ровно один раз.

// Сообщение может быть расшифровано из конфигурации перестановок a и b, в которой
// количество совпадающих пар элементов максимально. Пара элементов a_i и b_j называется
// совпадающей, если:

// - i = j, таким образом, у них один и тот же индекс;
// - a_i = b_j.

// Его ученикам разрешается совершать следующую операцию произвольное число раз:

// - выбрать число k и циклически сдвинуть одну из перестановок влево или вправо k раз.

// Циклический сдвиг перестановки c влево — это операция, которая присваивает
// c1 := c2, c2 := c3, …, c_n := c1 одновременно. Аналогично, циклический сдвиг
// перестановки c вправо — это операция, которая присваивает c1 := c_n, c2 := c1, …,
// c_n := c_{n-1} одновременно.

// Помогите Ishika и Hriday найти наибольшее возможное число совпадающих пар в данных
// перестановках после применения описанных операций несколько (возможно, ноль) раз.

// Входные данные
// В первой строке записано одно целое число n (1 ≤ n ≤ 2·10^5) — размеры массивов.

// Во второй строке записаны n целых чисел a1, a2, …, a_n (1 ≤ a_i ≤ n) — элементы
// первой перестановки.

// В третьей строке записаны n целых чисел b1, b2, …, b_n (1 ≤ b_i ≤ n) — элементы
// второй перестановки.

// Выходные данные
// Выведите наибольшее возможное число совпадающих пар в данных перестановках после
// применения описанных операций несколько (возможно, ноль) раз.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 1 2 3 4 5
// 2 3 4 5 1
// ======================================================================
// Выходные данные
// ======================================================================
// 5

// ======================================================================
// Входные данные
// ======================================================================
// 5
// 5 4 3 2 1
// 1 2 3 4 5
// ======================================================================
// Выходные данные
// ======================================================================
// 1

// ======================================================================
// Входные данные
// ======================================================================
// 4
// 1 3 2 4
// 4 2 3 1
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// ======================================================================

// Примечание
// В первом примере можно сдвинуть b направо на k = 1. Получившиеся перестановки
// будут {1, 2, 3, 4, 5} и {1, 2, 3, 4, 5}.

// Во втором примере не требуется совершать никаких операций. По всем возможным
// сдвигам a и b число совпадающих пар не будет превышать 1.

// В третьем примере можно сдвинуть b влево на k = 1. Получившиеся перестановки
// будут {1, 3, 2, 4} и {2, 3, 1, 4}. Позиции 2 и 4 будут являться совпадающей парой.
// По всем возможным циклическим сдвигам a и b количество совпадающих пар не будет
// превышать 2.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, res = 0;
    cin >> n;
    vector<int> a(n, -1);
    map<int, int> m;
    for (int i = 0; i < n; i++)
    {
        int x;
        cin >> x;
        x--;
        a[x] = i;
    }
    for (int i = 0; i < n; i++)
    {
        int x;
        cin >> x;
        x--;
        a[x] = ((a[x] - i) % n + n) % n;
        m[a[x]]++;
        res = max(res, m[a[x]]);
    }
    cout << res << '\n';
    // for (auto &i : a)
    //     cout << i << ' ';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
