// A. Лопаты и мечи
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Поликарп играет в известную компьютерную игру (мы не хотим упоминать её название).
// В этой игре он может создавать инструменты двух видов — лопаты и мечи. На создание
// лопаты Поликарп тратит две палки и один алмаз; на создание меча Поликарп тратит
// два алмаза и одну палку.

// Каждый инструмент может быть продан за один изумруд. Как много изумрудов может
// заработать Поликарп, если у него есть a палок и b алмазов?

// Входные данные
// Первая строка содержит число t (1 ≤ t ≤ 1000) — количество наборов входных данных.

// Единственная строка каждого набора входных данных содержит два числа a и b
// (0 ≤ a, b ≤ 10^9) — количество палок и алмазов соответственно.

// Выходные данные
// На каждый набор входных данных выведите число — максимальное количество изумрудов,
// которое может заработать Поликарп.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 4 4
// 1000000000 0
// 7 15
// 8 7
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// 0
// 7
// 5
// ======================================================================

// Примечание
// В первом наборе входных данных Поликарп может заработать два изумруда следующим
// образом: создать один меч и одну лопату.

// Во втором наборе входных данных у Поликарпа нет алмазов, а значит, он не сможет
// ничего создать.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int a, b;
    cin >> a >> b;
    cout << min({a, b, (a + b) / 3}) << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
