// B. Перемешивание
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Вам задан массив, состоящий из n чисел a1, a2, …, a_n. Изначально a_x = 1,
// а остальные элементы равны 0.

// Вы выполняете m операций. Во время i-й операции вы выбираете два индекса c и d
// таких, что l_i ≤ c, d ≤ r_i, и меняете местами a_c и a_d.

// Посчитайте количество индексов k таких, что существует возможность выбрать операции
// так, что в конце a_k = 1.

// Входные данные
// Первая строка содержит число t (1 ≤ t ≤ 100) — количество наборов входных данных.
// Затем следует описание каждого из t наборов входных данных.

// Первая строка каждого набора входных данных содержит три целых числа n, x и m
// (1 ≤ n ≤ 10^9; 1 ≤ m ≤ 100; 1 ≤ x ≤ n).

// Каждая из следующих m строк содержит описание операций; а именно — в i-й строке
// содержится два целых числа l_i и r_i (1 ≤ l_i ≤ r_i ≤ n).

// Выходные данные
// На каждый набор входных данных выведите одно число — количество индексов k таких,
// что существует возможность выбрать операции так, что в конце a_k = 1.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 3
// 6 4 3
// 1 6
// 2 3
// 5 5
// 4 1 2
// 2 4
// 1 2
// 3 3 2
// 2 3
// 1 2
// ======================================================================
// Выходные данные
// ======================================================================
// 6
// 2
// 3
// ======================================================================

// Примечание
// В первом наборе входных данных условие a_k = 1 выполняется для любого k.
// Для этого можно выполнить следующие операции:

// - поменять местами a_k и a_4;
// - поменять местами a_2 и a_2;
// - поменять местами a_5 и a_5.

// Во втором наборе входных данных подходят только индексы k = 1 и k = 2.
// Для выполнения a1 = 1 нужно поменять местами a1 и a1 во второй операции.
// Для выполнения a2 = 1 нужно поменять местами a1 и a2 во второй операции.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, x, m;
    cin >> n >> x >> m;
    int cur_l = x, cur_r = x;
    while (m--)
    {
        int l, r;
        cin >> l >> r;
        if (max(cur_l, l) <= min(cur_r, r))
        {
            cur_l = min(cur_l, l);
            cur_r = max(cur_r, r);
        }
    }
    cout << cur_r - cur_l + 1 << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
