// C. Игра с числом
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Ashishgup и FastestFinger играют в игру.

// Они начинают с целого числа n и начинают делать ходы по очереди. На каждом ходу
// игрок может сделать любой из следующих двух ходов:

// - Разделить n на один из его нечётных делителей, который больше чем 1.
// - Вычесть 1 из n, если n больше чем 1.

// Обратите внимание, что множество делителей числа включает само число.

// Если игрок не может сделать ход, он проигрывает игру.

// Ashishgup ходит первым. Определите победителя игры, если оба игрока играют оптимально.

// Входные данные
// В первой строке находится единственное целое число t (1 ≤ t ≤ 100) — количество
// наборов входных данных. Описание наборов входных данных следует.

// В единственной строке описания каждого набора входных данных находится единственное
// целое число n (1 ≤ n ≤ 10^9).

// Выходные данные
// Для каждого набора входных данных выведите «Ashishgup», если он побеждает в игре,
// и «FastestFinger» иначе (без кавычек).

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 7
// 1
// 2
// 3
// 4
// 5
// 6
// 12
// ======================================================================
// Выходные данные
// ======================================================================
// FastestFinger
// Ashishgup
// Ashishgup
// FastestFinger
// Ashishgup
// FastestFinger
// Ashishgup
// ======================================================================

// Примечание
// В первом наборе входных данных n = 1 и Ashishgup не может сделать ход. Он проигрывает.

// Во втором наборе входных данных n = 2 и Ashishgup вычитает 1 на первом ходу.
// Теперь n = 1 и FastestFinger не может сделать ход, поэтому он проигрывает.

// В третьем наборе входных данных n = 3 и Ashishgup делит на 3 на первом ходу.
// Теперь n = 1 и FastestFinger не может сделать ход, поэтому он проигрывает.

// В последнем наборе входных данных n = 12 и Ashishgup делит на 3 на первом ходу.
// Теперь n = 4, FastestFinger может только вычесть 1, и Ashishgup получает число 3.
// Наконец, он побеждает после деления этого числа на 3.

#include <bits/stdc++.h>
using namespace std;

#define int long long

bool isP(int x)
{
    if (x < 2)
        return 0;
    for (int i = 2; i * i <= x; i++)
        if (x % i == 0)
            return 0;
    return 1;
}

void solve()
{
    bool pl1_win = 1;
    int n;
    cin >> n;
    if (n == 1 || (n & (n - 1)) == 0 && n != 2)
        pl1_win = 0;
    else if (n % 4 != 0 && n % 2 == 0)
    {
        int op = n / 2;
        if (isP(op))
            pl1_win = 0;
    }
    cout << (pl1_win ? "Ashishgup" : "FastestFinger") << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
