// B. Последовательный ним
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Есть n кучек камней, i-я из них содержит a_i камней. Два игрока играют в игру,
// поочерёдно забирая камни из кучек.

// За один ход игрок может забрать целое положительное количество камней из первой
// непустой кучки (кучки с минимальным индексом, которая содержит хотя бы один камень).
// Первый игрок, который не может сделать ход (потому что все кучки пустые), проигрывает
// игру. Определите победителя игры при условии, что оба игрока играют оптимально.

// Входные данные
// В первой строке находится единственное целое число t (1 ≤ t ≤ 1000) — количество
// наборов входных данных. Следующие 2t строк содержат описания наборов входных данных.

// В первой строке каждого набора входных данных содержится единственное целое число n
// (1 ≤ n ≤ 10^5) — количество кучек.

// Во второй строке каждого набора входных данных содержится n целых чисел
// a1, …, an (1 ≤ a_i ≤ 10^9) — a_i равно количеству камней в i-й кучке.

// Гарантируется, что сумма n по всем наборам входных данных не превосходит 10^5.

// Выходные данные
// Для каждого набора входных данных, если игрок, делающий первый ход, победит,
// выведите «First». Иначе выведите «Second».

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 7
// 3
// 2 5 4
// 8
// 1 1 1 1 1 1 1 1
// 6
// 1 2 3 4 5 6
// 6
// 1 1 2 1 2 2
// 1
// 1000000000
// 5
// 1 2 2 1 1
// 3
// 1 1 1
// ======================================================================
// Выходные данные
// ======================================================================
// First
// Second
// Second
// First
// First
// Second
// First
// ======================================================================

// Примечание
// В первом наборе входных данных первый игрок выиграет игру. Его выигрышная стратегия:

// - Первый игрок должен забирать камни из первой кучки. Он возьмёт 1 камень.
//   Количества камней в кучках будут [1, 5, 4].
// - Второй игрок должен забирать камни из первой кучки. Он возьмёт 1 камень,
//   потому что он не может взять никакое другое количество камней. Количества камней
//   в кучках будут [0, 5, 4].
// - Первый игрок должен забирать камни из второй кучки, потому что первая кучка пустая.
//   Он возьмёт 4 камня. Количества камней в кучках будут [0, 1, 4].
// - Второй игрок должен забирать камни из второй кучки, потому что первая кучка пустая.
//   Он возьмёт 1 камень, потому что он не может взять никакое другое количество камней.
//   Количества камней в кучках будут [0, 0, 4].
// - Первый игрок должен забирать камни из третьей кучки, потому что первая и вторая
//   кучка пустые. Он возьмёт 4 камня. Количества камней в кучках будут [0, 0, 0].
// - Второй игрок проигрывает игру, потому что все кучки пустые.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    int cnt1 = 0;
    bool ok = 1;
    for (int i = 0; i < n; i++)
    {
        int x;
        cin >> x;
        if (ok)
        {
            if (x == 1)
                cnt1++;
            else
                ok = 0;
        }
    }
    cout << (cnt1 % 2 && cnt1 != n || (cnt1 % 2 == 0 && cnt1 == n) ? "Second\n" : "First\n");
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
