// C. Лодочное соревнование
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Есть n людей, желающих принять участие в лодочном соревновании. Вес i-го участника
// равен w_i. Принять участие могут только команды, состоящие из двух человек.
// Как организатор, вы считаете честным допустить к соревнованию только команды
// с одинаковым суммарным весом.

// Таким образом, для k команд (a1, b1), (a2, b2), …, (a_k, b_k), где a_i — вес первого
// участника i-й команды, а b_i — вес второго участника i-й команды, должно выполняться
// условие a1 + b1 = a2 + b2 = … = a_k + b_k = s, где s — суммарный вес для каждой
// команды.

// Ваша задача — выбрать такое число s, что количество команд, которые могут быть
// созданы, максимально возможное. Обратите внимание: каждый участник может состоять
// не более чем в одной команде.

// Вам необходимо ответить на t независимых наборов тестовых данных.

// Входные данные
// Первая строка содержит одно целое число t (1 ≤ t ≤ 1000) — количество наборов
// тестовых данных. Затем следуют t наборов тестовых данных.

// Первая строка каждого набора тестовых данных содержит одно целое число n
// (1 ≤ n ≤ 50) — количество участников. Вторая строка каждого набора тестовых
// данных содержит n целых чисел w1, w2, …, w_n (1 ≤ w_i ≤ n), где w_i — вес
// i-го участника.

// Выходные данные
// Для каждого набора тестовых данных выведите одно целое число k — максимальное
// число команд, которые могут быть составлены при суммарном весе участников в команде,
// равном s, если выбирать s оптимально.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 5
// 1 2 3 4 5
// 8
// 6 6 6 6 6 6 8 8
// 8
// 1 2 2 1 2 1 1 2
// 3
// 1 3 3
// 6
// 1 1 3 4 2 2
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// 3
// 4
// 1
// 2
// ======================================================================

// Примечание
// В первом наборе тестовых данных примера мы можем достичь оптимального ответа
// для s = 6. Тогда первая лодка будет использоваться участниками 1 и 5, а вторая
// лодка — участниками 2 и 4 (индексы совпадают с весами).

// Во втором наборе тестовых данных примера мы можем достичь оптимального ответа
// для s = 12. Тогда первые 6 участников смогут образовать 3 пары.

// В третьем наборе тестовых данных примера мы можем достичь оптимального ответа
// для s = 3. Ответ равен 4, потому что у нас есть 4 участника с весом 1 и 4 участника
// с весом 2.

// В четвёртом наборе тестовых данных примера мы можем достичь оптимального ответа
// для s = 4 или s = 6.

// В пятом наборе тестовых данных примера мы можем достичь оптимального ответа
// для s = 3. Заметьте, что участник с весом 3 не может использовать лодку, потому
// что для него в списке нет подходящей пары.

// 1 1 1 1 2 2 2 2
// l

// 1 : 3 2

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    vector<int> w(n + 1, 0); // веса
    for (auto &i : a)
    {
        cin >> i;
        w[i]++;
    }
    sort(a.begin(), a.end());

    int res = 0;
    for (int s = 2; s <= 2 * n; s++) // перебираем суммы
    {
        int tmp = 0;
        for (int l = 1; l <= s; l++)
        {
            int r = s - l; // s = r + l => r = s - l
            if (r < l || r < 1 || r > n)
                continue;
            if (l == r)
                tmp += w[l] / 2;
            else
                tmp += min(w[l], w[r]);
        }
        res = max(res, tmp);
    }

    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
