// A. Ахахахахахахахаха
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// У Александры есть массив a чётной длины, состоящий из чисел 0 и 1. Элементы массива
// пронумерованы от 1 до n. Она хочет удалить из него не более n/2 элементов (где n —
// его длина) таким образом, чтобы знакопеременная сумма массива была равна 0
// (т.е. a1 − a2 + a3 − a4 + … = 0). Иными словами, Александра хочет, чтобы сумма всех
// элементов на нечётных позициях была равна сумме всех элементов на чётных позициях.
// Элементы, которые вы удаляете, не обязаны быть последовательными.

// К примеру, если у неё был массив a = [1, 0, 1, 0, 0, 0], и она удалила 2-й и 4-й
// элементы, то a станет равным [1, 1, 0, 0] и его знакопеременная сумма будет равна
// 1 − 1 + 0 − 0 = 0.

// Помогите ей!

// Входные данные
// Каждый тест содержит несколько наборов входных данных. Первая строка содержит
// количество наборов входных данных t (1 ≤ t ≤ 10^3). Описание наборов входных
// данных приведено ниже.

// Первая строка каждого набора входных данных содержит одно целое число n
// (2 ≤ n ≤ 10^3, n чётное) — длину массива.

// Вторая строка каждого набора входных данных содержит n целых чисел a1, a2, …, a_n
// (0 ≤ a_i ≤ 1) — элементы массива.

// Гарантируется, что сумма значений n по всем наборам входных данных не превосходит 10^3.

// Выходные данные
// Для каждого набора входных данных сначала выведите число k (n/2 ≤ k ≤ n) — число
// элементов, которые останутся после удаления. В следующей строке выведите k чисел,
// которые не будут удалены, в том порядке, в котором они идут в массиве a.
// Обратите внимание, вам надо вывести сами числа, а не их индексы.

// Можно показать, что ответ всегда существует. Если существует несколько ответов,
// выведите любой из них.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 2
// 1 0
// 2
// 0 0
// 4
// 0 1 1 1
// 4
// 1 1 0 0
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 0
// 1
// 0
// 2
// 1 1
// 4
// 1 1 0 0
// ======================================================================

// Примечание
// В первом и втором наборах входных данных знакопеременная сумма массива, очевидно,
// равна 0.

// В третьем наборе входных данных знакопеременная сумма массива равна 1 − 1 = 0.

// В четвёртом наборе входных данных знакопеременная сумма уже равна 1 − 1 + 0 − 0 = 0,
// мы можем ничего не удалять.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, cnt0 = 0, cnt1 = 0;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
    {
        cin >> i;
        cnt0 += !i;
        cnt1 += i;
    }
    if (cnt1 <= n / 2)
    {
        cout << n - cnt1 << '\n';
        for (int i = 0; i < n - cnt1; i++)
            cout << "0 ";
        cout << '\n';
    }
    else
    {
        cout << n - cnt0 - (cnt1 % 2 ? 1 : 0) << '\n';
        for (int i = 0; i < n - cnt0 - (cnt1 % 2 ? 1 : 0); i++)
            cout << "1 ";
        cout << '\n';
    }
}
int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
