// D. Уменьшение суммы цифр
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вам задано целое положительное число n. За один ход вы можете увеличить n на единицу
// (то есть сделать n := n + 1). Ваша задача — найти минимальное количество ходов,
// которое надо совершить, чтобы сделать сумму цифр n не превышающей s.

// Вам необходимо ответить на t независимых наборов тестовых данных.

// Входные данные
// Первая строка входных данных содержит одно целое число t (1 ≤ t ≤ 2·10^4) —
// количество наборов тестовых данных. Затем следуют t наборов тестовых данных.

// Единственная строка набора тестовых данных содержит два целых числа n и s
// (1 ≤ n ≤ 10^18; 1 ≤ s ≤ 162).

// Выходные данные
// На каждый набор тестовых данных выведите ответ: минимальное количество ходов,
// которое надо совершить, чтобы сделать сумму цифр n не превышающей s.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 2 1
// 1 1
// 500 4
// 217871987498122 10
// 100000000000000001 1
// ======================================================================
// Выходные данные
// ======================================================================
// 8
// 0
// 500
// 2128012501878
// 899999999999999999
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

int get_sum(int x)
{
    int sum = 0;
    while (x > 0)
    {
        sum += x % 10;
        x /= 10;
    }
    return sum;
}

void solve()
{
    string sn;
    int s, cur_n_s = 0, n;
    cin >> sn >> s;
    for (auto &i : sn)
        cur_n_s += i - '0';
    n = stoll(sn);

    int start_n = n;
    int p = 10;
    while (get_sum(n) > s)
    {
        int rem = n % p;
        if (rem > 0)
            n += (p - rem);
        p *= 10;
    }
    cout << n - start_n << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
