// C. Mortal Kombat Tower
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Вы и ваш друг играете в Mortal Kombat XI. Вы пытаетесь пройти башню испытаний.
// Всего в башне есть n боссов, пронумерованных от 1 до n. Тип i-го босса равен a_i.
// Если i-й босс является лёгким, то его тип равен a_i = 0, иначе этот босс является
// сложным и его тип равен a_i = 1.

// В течение одной игровой сессии вы или ваш друг можете убить одного или двух боссов
// (ни вы, ни ваш друг не можете пропускать сессию, поэтому минимальное количество
// боссов, убитых в течение сессии, равно хотя бы одному). После сессии вашего друга
// начинается ваша сессия, затем опять сессия вашего друга, затем опять ваша, и так
// далее. Первая сессия — сессия вашего друга.

// Вашему другу надо научиться играть лучше, потому что на самом деле он не может
// убивать сложных боссов. Чтобы убивать их, он использует очки пропуска. Одно очко
// пропуска может быть использовано для того, чтобы убить одного сложного босса.

// Ваша задача — найти минимальное количество очков пропуска, которое ваш друг должен
// использовать для того, чтобы вы с вашим другом убили всех n боссов в заданном порядке.

// Например: предположим, что n = 8, a = [1, 0, 1, 1, 0, 1, 1, 1]. Тогда лучшей
// последовательностью действий является следующая:

// - ваш друг убивает первых двух боссов, используя одно очко пропуска для первого босса;
// - вы убиваете третьего и четвёртого боссов;
// - ваш друг убивает пятого босса;
// - вы убиваете шестого и седьмого боссов;
// - ваш друг убивает последнего босса, используя одно очко пропуска, таким образом,
//   башня проходится с использованием двух очков пропуска.

// Вам необходимо ответить на t независимых наборов тестовых данных.

// Входные данные
// Первая строка входных данных содержит одно целое число t (1 ≤ t ≤ 2·10^4) —
// количество наборов тестовых данных. Затем следуют t наборов тестовых данных.

// Первая строка набора входных данных содержит одно целое число n (1 ≤ n ≤ 2·10^5) —
// количество боссов. Вторая строка набора входных данных содержит n целых чисел
// a1, a2, …, a_n (0 ≤ a_i ≤ 1), где a_i равно типу i-го босса.

// Гарантируется, что сумма n не превосходит 2·10^5 (∑n ≤ 2·10^5).

// Выходные данные
// Выведите ответ на каждый набор тестовых данных: минимальное количество очков
// пропуска, которое ваш друг должен использовать для того, чтобы вы с вашим другом
// убили всех n боссов в заданном порядке.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 8
// 1 0 1 1 0 1 1 1
// 5
// 1 1 1 1 0
// 7
// 1 1 1 1 0 0 1
// 6
// 1 1 1 1 1 1
// 1
// 1
// 1
// 0
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// 2
// 2
// 2
// 1
// 0
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;

    int res = a[0] == 1, r = 0;
    for (int l = 1; l < n; l++)
    {
        if (a[l] == 1)
        {
            r = l;
            while (r < n && a[r] == 1)
                r++;
            res += (r - l) / 3;
            l = r;
        }
    }
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
