// D. Дерево минимальной высоты
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// У Монокарпа было дерево из n вершин с корнем в вершине 1. Он решил изучить алгоритм
// BFS (Поиск в ширину), и поэтому запустил BFS на своём дереве, стартуя с корня.
// Упрощённо, BFS можно описать следующим псевдокодом:

// a = [] # порядок, в котором вершины обработались
// q = Queue()
// q.put(1) # кладём корень в конец очереди
// while not q.empty():
//     k = q.pop() # достаём вершину из начала очереди
//     a.append(k) # кладём k в конец последовательности, описывающей порядок посещения вершин
//     for y in g[k]: # g[k] — это список всех детей вершины k, отсортированный в порядке возрастания
//         q.put(y)

// Монокарп был так восхищён алгоритмом BFS, что в результате потерял своё дерево.
// К счастью, у него осталась последовательность вершин в порядке их посещения алгоритмом
// BFS (массив a из псевдокода). Монокарп знает, что каждая вершина была посещена ровно
// один раз (так как они кладутся и забираются из очереди ровно один раз). Также он
// знает, что все дети каждой вершины были просмотрены в порядке возрастания.

// Монокарп понимает, что есть много деревьев (в общем случае) с одинаковым порядком
// посещения a, поэтому даже не надеется восстановить своё дерево. Монокарпа устроит
// любое дерево минимально возможной высоты.

// Высота дерева — это максимум среди глубин вершин дерева, и глубина вершины — это
// количество дуг на пути от корня до этой вершины. Например, глубина вершины 1 равна 0,
// так как она является корнем, а глубина любого из детей корня равна 1.

// Помогите Монокарпу найти любое дерево с заданным порядком посещения a и минимальной
// высотой.

// Входные данные
// В первой строке задано единственное целое число t (1 ≤ t ≤ 1000) — количество
// наборов входных данных.

// В первой строке каждого набора задано одно целое число n (2 ≤ n ≤ 2·10^5) —
// количество вершин в дереве.

// Во второй строке каждого набора заданы n целых чисел a1, a2, …, a_n
// (1 ≤ a_i ≤ n; a_i ≠ a_j; a_1 = 1) — порядок посещения вершин алгоритмом BFS.

// Гарантируется, что сумма n по всем наборам входных данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите минимально возможную высоту дерева
// с заданным порядком обхода a.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 3
// 4
// 1 4 3 2
// 2
// 1 2
// 3
// 1 2 3
// ======================================================================
// Выходные данные
// ======================================================================
// 3
// 1
// 1
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;

    int res = 0;
    int parents_cur = 1, parents_next = 0;
    for (int i = 1; i < n; i++)
    {
        if (i > 1 && a[i - 1] > a[i])
            parents_cur--;

        if (parents_cur == 0)
        {
            res++;
            parents_cur = parents_next;
            parents_next = 0;
        }
        parents_next++;
    }
    cout << (parents_next ? res + 1 : res) << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
