// B. Ходы и повороты
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест512 мегабайт

// В начале координат бесконечной двумерной плоскости находится робот. Каждую секунду
// робот перемещается ровно на 1 метр в одном из четырёх направлений: на север, юг,
// запад или восток. Робот может выбрать произвольное направление для первого шага,
// но после этого в конце каждой секунды он обязан повернуть на 90 градусов влево или
// вправо относительно направления, в котором только что двигался. Например, если робот
// только что переместился на север или юг, его следующий шаг должен быть на запад или
// восток, и наоборот.

// Робот совершает ровно n шагов из начального положения в соответствии с правилами выше.
// В скольких различных точках робот может оказаться в итоге? Финальное направление
// робота можно игнорировать.

// Входные данные
// В единственной строке записано одно целое число n (1 ≤ n ≤ 1000) — количество шагов
// робота.

// Выходные данные
// Выведите одно целое число — количество различных возможных положений робота после
// ровно n шагов.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 1
// ======================================================================
// Выходные данные
// ======================================================================
// 4

// ======================================================================
// Входные данные
// ======================================================================
// 2
// ======================================================================
// Выходные данные
// ======================================================================
// 4

// ======================================================================
// Входные данные
// ======================================================================
// 3
// ======================================================================
// Выходные данные
// ======================================================================
// 12
// ======================================================================

// Примечание
// В первом примере робот переместится на 1 метр на север, юг, запад или восток
// в зависимости от исходного направления.

// Во втором примере робот всегда окажется в 2–√ метрах на северо-западе,
// северо-востоке, юго-западе или юго-востоке.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    if (n % 2 == 0)
        cout << ((n * n) / 4 + n + 1);
    else
        cout << (n / 2 + 1) * 2 * (n / 2 + 2);
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
