// C. Длинные прыжки
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Поликарп нашёл под ёлкой массив a из n элементов и инструкцию для игры с ним:

// - Выбери число i (1 ≤ i ≤ n) — стартовую позицию в массиве. Помести фишку на позицию i
//   (на элемент a_i);
// - Пока i ≤ n, прибавь к своему результату значение a_i и переместись на a_i вправо
//   (т.е. замени i на i + a_i);
// - Если i > n, то Поликарп заканчивает игру.

// Например, если n = 5 и a = [7, 3, 1, 2, 3], тогда следующие варианты игр возможны:

// - Поликарп выбирает i = 1. Процесс игры: i = 1 → 8. Результат игры: a1 = 7.
// - Поликарп выбирает i = 2. Процесс игры: i = 2 → 5 → 8. Результат игры: a2 + a5 = 6.
// - Поликарп выбирает i = 3. Процесс игры: i = 3 → 4 → 6. Результат игры: a3 + a4 = 3.
// - Поликарп выбирает i = 4. Процесс игры: i = 4 → 6. Результат игры: a4 = 2.
// - Поликарп выбирает i = 5. Процесс игры: i = 5 → 8. Результат игры: a5 = 3.

// Помогите Поликарпу узнать, какой максимальный результат он может получить,
// если он выбирает стартовую позицию оптимально.

// Входные данные
// В первой строке находится одно целое число t (1 ≤ t ≤ 10^4) — количество наборов
// входных данных. Далее следуют t наборов входных данных.

// В первой строке каждого набора входных данных находится одно целое число n
// (1 ≤ n ≤ 2·10^5) — длина массива a.

// В следующей строке находятся n целых чисел a1, a2, …, a_n (1 ≤ a_i ≤ 10^9) —
// элементы массива a.

// Гарантируется, что сумма n по всем наборам входных данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора входных данных в отдельной строке выведите одно число —
// максимальный результат, который Поликарп может получить, сыграв в игру
// на соответствующем массиве по инструкции из условия. Обратите внимание, что
// Поликарп выбирает любую стартовую позицию от 1 до n таким образом, чтобы
// максимизировать свой результат.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 5
// 7 3 1 2 3
// 3
// 2 1 4
// 6
// 2 1000 2 3 995 1
// 5
// 1 1 1 1 1
// ======================================================================
// Выходные данные
// ======================================================================
// 7
// 6
// 1000
// 5
// ======================================================================

// Примечание
// Первый набор входных данных разобран в условии.

// Во втором наборе входных данных максимальный результат достигается при выборе i = 1.

// В третьем наборе входных данных максимальный результат достигается при выборе i = 2.

// В четвёртом наборе входных данных максимальный результат достигается при выборе i = 1.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, max_res = 0;
    cin >> n;
    vector<int> a(n), dp(n + 1, 0);
    for (auto &i : a)
        cin >> i;

    for (int i = n; i >= 1; i--)
    {
        int t = i + a[i - 1];
        if (t <= n)
            dp[i] = a[i - 1] + dp[t];
        else
            dp[i] = a[i - 1];
        max_res = max(max_res, dp[i]);
    }
    cout << max_res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
