// B. Различные делители
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Число x называется делителем числа y, если y делится на x без остатка. Например,
// 1 является делителем 7, а 3 не является делителем 8.

// Мы дали Вам число d и попросили найти наименьшее положительное целое a,
// обладающее следующими свойствами:

// - у числа a есть хотя бы 4 делителя;
// - разность между любыми двумя различными делителями a не меньше d.

// Входные данные
// В первой строке задано одно целое число t (1 ≤ t ≤ 3000) — количество наборов
// входных данных.

// Описание каждого набора состоит из одной строки, в которой задано целое число d
// (1 ≤ d ≤ 10000).

// Выходные данные
// Для каждого набора входных данных выведите одно целое число a — наименьшее число,
// удовлетворяющее условиям выше.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 2
// 1
// 2
// ======================================================================
// Выходные данные
// ======================================================================
// 6
// 15
// ======================================================================

// Примечание
// В первом наборе входных данных число 6 имеет делители [1, 2, 3, 6]. Их всего 4
// и разница между любыми двумя из них не менее 1. Любое меньшее число имеет
// меньше 4 делителей.

// Во втором наборе число 15 имеет делители [1, 3, 5, 15]. Их всего 4 и разница
// между любыми двумя из них не менее 2.

// Ответ 12 неверный, потому его делители: [1, 2, 3, 4, 6, 12]. И разность между,
// например, делителями 2 и 3 меньше d = 2.

#include <bits/stdc++.h>
using namespace std;

#define int long long

bool is_prime(int n)
{
    if (n == 2)
        return true;
    if (n % 2 == 0)
        return false;
    int d = 3;
    while (d * d <= n)
    {
        if (n % d++ == 0)
            return false;
    }
    return true;
}

void solve()
{
    int d;
    cin >> d;
    int x = 1 + d;
    while (!is_prime(x))
    {
        if (x % 2 == 0)
            x++;
        else
            x += 2;
    }
    int y = x + d;
    while (!is_prime(y))
    {
        if (y % 2 == 0)
            y++;
        else
            y += 2;
    }
    cout << x * y << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }

    return 0;
}
