// C. Бал в Берляндии
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// В школе, в которой учится Вася, идёт подготовка к проведению выпускного. Одно из
// запланированных выступлений — бал, в котором примут участие пары, состоящие из
// мальчиков и девочек.

// Каждый класс должен представить на бал по две пары. В классе Васи a мальчиков и b
// девочек изъявили желание участвовать в мероприятии. Но не все мальчики и не все
// девочки готовы танцевать в паре.

// Формально, вам известно k возможных пар, состоящих из одного мальчика и одной девочки.
// Вам нужно выбрать из этих пар две так, чтобы ни один человек не состоял больше чем
// в одной паре.

// Например, если a = 3, b = 4, k = 4 и следующие пары готовы танцевать вместе
// (1, 2), (1, 3), (2, 2), (3, 4) (в каждой паре сначала идёт номер мальчика, потом
// номер девочки), то возможны следующие комбинации из двух пар (ниже перечислены
// не все возможные варианты):

// - (1, 3) и (2, 2);
// - (3, 4) и (1, 3);

// Но следующие комбинации не возможны:

// - (1, 3) и (1, 2) — первый мальчик входит сразу в две пары;
// - (1, 2) и (2, 2) — вторая девочка входит сразу в две пары.

// Найдите количество способов выбрать две пары, подходящие под условие выше. Два способа
// считаются различными, если состоят из разных пар.

// Входные данные
// В первой строке записано одно целое число t (1 ≤ t ≤ 10^4) — количество наборов
// входных данных. Далее следуют t наборов входных данных.

// В первой строке каждого набора входных данных содержатся три целых числа a, b и k
// (1 ≤ a, b, k ≤ 2·10^5) — количество мальчиков и девочек в классе и количество пар,
// готовых танцевать вместе.

// Во второй строке каждого набора входных данных содержится k целых чисел a1, a2, …, a_k
// (1 ≤ a_i ≤ a), где a_i — номер мальчика в паре с номером i.

// В третьей строке каждого набора входных данных содержится k целых чисел b1, b2, …, b_k
// (1 ≤ b_i ≤ b), где b_i — номер девочки в паре с номером i.

// Гарантируется, что суммы a, b и k по всем наборам входных данных не превосходят 2·10^5.

// Гарантируется, что каждая пара указана в одном наборе входных данных не больше одного раза.

// Выходные данные
// Для каждого набора входных данных в отдельной строке выведите одно целое число —
// количество способов выбрать две пары, подходящие под условие выше.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 3
// 3 4 4
// 1 1 2 3
// 2 3 2 4
// 1 1 1
// 1
// 1
// 2 2 4
// 1 1 2 2
// 1 2 1 2
// ======================================================================
// Выходные данные
// ======================================================================
// 4
// 0
// 2
// ======================================================================

// Примечание
// В первом наборе входных данных следующие комбинации из двух пар подходят:

// - (1, 2) и (3, 4);
// - (1, 3) и (2, 2);
// - (1, 3) и (3, 4);
// - (2, 2) и (3, 4).

// Во втором наборе входных данных есть всего одна пара.

// В третьем наборе входных данных следующие комбинации из двух пар подходят:

// - (1, 1) и (2, 2);
// - (1, 2) и (2, 1).

#include <bits/stdc++.h>
using namespace std;

#define int long long

pair<int, int> dfs(vector<vector<int>> &graph, int v, vector<bool> &visited)
{
    pair<int, int> res = {graph[v].size(), 1};
    visited[v] = 1;
    for (auto &u : graph[v])
        if (!visited[u])
        {
            auto data = dfs(graph, u, visited);
            res.first += data.first;
            res.second += data.second;
        }
    return res;
}

void solve()
{
    int vn, un, k;
    cin >> vn >> un >> k;
    vector<pair<int, int>> edges(k);
    vector<int> da(vn, 0), db(un, 0);
    for (int i = 0; i < k; i++)
    {
        int a;
        cin >> a;
        a--;
        edges[i].first = a;
        da[a]++;
    }
    for (int i = 0; i < k; i++)
    {
        int b;
        cin >> b;
        b--;
        edges[i].second = b;
        db[b]++;
    }
    int res = 0;
    for (auto &[a, b] : edges)
    {
        res += k - (da[a] + db[b] - 1);
    }
    cout << res / 2 << '\n';
    // for (auto &i : graph)
    // {
    //     for (auto &j : i)
    //         cout << j << ' ';
    //     cout << '\n';
    // }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
