// B. Восточная выставка
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Вы и ваши друзья живёте в n домах. Каждый дом расположен на 2D плоскости в точке
// с целыми координатами. Несколько домов могут быть расположены в одной точке.
// Мэр города хочет узнать у вас возможные места для постройки здания Восточной
// выставки. Найдите количество мест (точек с целыми координатами) таких, что суммарное
// расстояние от всех домов до выставки будет минимальным. Здание выставки может быть
// построено в той же точке, что и какой-то дом. Расстояние между двумя точками
// (x1, y1) и (x2, y2) считается по формуле |x1 − x2| + |y1 − y2|, где |x| — модуль
// величины x.

// Входные данные
// В первой строке находится единственное целое число t (1 ≤ t ≤ 1000) — число наборов
// входных данных.

// В первой строке каждого теста находится единственное целое число n (1 ≤ n ≤ 1000).
// В следующих n строках находятся позиции домов (x_i, y_i) (0 ≤ x_i, y_i ≤ 10^9).

// Гарантируется, что сумма n не превосходит 1000.

// Выходные данные
// Для каждого набора входных данных выведите единственное число — количество различных
// позиций для здания выставки. Здание выставки может быть построено в той же точке,
// что и какой-то дом.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 3
// 0 0
// 2 0
// 1 2
// 4
// 1 0
// 0 2
// 2 3
// 3 1
// 4
// 0 0
// 0 1
// 1 0
// 1 1
// 2
// 0 0
// 1 1
// 2
// 0 0
// 2 0
// 2
// 0 0
// 0 0
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 4
// 4
// 4
// 3
// 1
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> ax, ay;
    for (int i = 0; i < n; i++)
    {
        int x, y;
        cin >> x >> y;
        ax.push_back(x);
        ay.push_back(y);
    }
    sort(ax.begin(), ax.end());
    sort(ay.begin(), ay.end());

    if (n % 2)
    {
        cout << "1\n";
        return;
    }
    else
        cout << (ax[n / 2] - ax[n / 2 - 1] + 1) * (ay[n / 2] - ay[n / 2 - 1] + 1) << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
