// C. Сумма кубов
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вам дано целое положительное число x. Проверьте, представимо ли число x
// в виде суммы кубов двух целых положительных чисел.

// Формально, вам нужно проверить, существует ли два целых числа a и b (1 ≤ a, b),
// таких что a^3 + b^3 = x.

// Например, если x = 35, то подходят числа a = 2 и b = 3 (2^3 + 3^3 = 8 + 27 = 35).
// Если же x = 4, то ни одна пара чисел a и b не подходит.

// Входные данные
// В первой строке находится одно целое число t (1 ≤ t ≤ 100) — количество наборов
// входных данных. Далее следуют t наборов входных данных.

// Каждый набор входных данных состоит из одного целого положительного числа x
// (1 ≤ x ≤ 10^12).

// Обратите внимание, что числа в некоторых наборах входных данных не помещаются
// в 32-битный целочисленный тип, поэтому вы должны использовать как минимум
// 64-битный целочисленный тип вашего языка программирования.

// Выходные данные
// Для каждого набора входных данных в отдельной строке выведите:

// - «YES», если число x представимо в виде суммы кубов двух целых положительных чисел;
// - «NO» в противном случае.

// Вы можете выводить «YES» и «NO» в любом регистре (например, строки yEs, yes, Yes
// и YES будут распознаны как положительный ответ).

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 7
// 1
// 2
// 4
// 34
// 35
// 16
// 703657519796
// ======================================================================
// Выходные данные
// ======================================================================
// NO
// YES
// NO
// NO
// YES
// YES
// YES
// ======================================================================

// Примечание
// Число 1 не представимо в виде суммы двух кубов.

// Число 2 представимо в виде 1^3 + 1^3.

// Число 4 не представимо в виде суммы двух кубов.

// Число 34 не представимо в виде суммы двух кубов.

// Число 35 представимо в виде 2^3 + 3^3.

// Число 16 представимо в виде 2^3 + 2^3.

// Число 703657519796 представимо в виде 5779^3 + 7993^3.

#include <bits/stdc++.h>
using namespace std;

#define int long double

void solve()
{
    int n;
    cin >> n;
    for (int i = 1; i <= cbrt(n); i++)
    {
        int t = round(cbrt(n - i * i * i));
        if (t > 0 && t * t * t + i * i * i == n)
        {
            cout << "YES\n";
            return;
        }
    }
    cout << "NO\n";
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
