// E. Случайная победа
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// В Берляндии проводится чемпионат, в котором участвует n игроков. У игрока с номером i
// есть a_i (a_i ≥ 1) фишек.

// Чемпионат состоит из n − 1 игры, которые проводятся по следующим правилам:

// - в каждой игре выбирается два случайных игрока с ненулевым количеством фишек;
// - победителем игры считается игрок, у которого больше фишек (при равенстве победитель
//   выбирается случайно);
// - победивший игрок забирает себе все фишки проигравшего.

// Последний игрок с ненулевым количеством фишек считается победителем чемпионата.

// Все случайные решения, которые принимаются во время чемпионата, принимаются
// равновероятно и независимо.

// Например, если n = 4, a = [1, 2, 4, 3], то один из вариантов развития игры
// следующий (могли быть и другие варианты):

// - во время первой игры были выбраны первый и четвёртый игроки. Количество фишек
//   у четвёртого игрока больше, поэтому он забирает фишки первого игрока. Теперь
//   a = [0, 2, 4, 4];
// - во время второй игры были выбраны четвёртый и третий игроки. Количество фишек
//   у них одинаково, но случайным образом третий игрок стал победителем. Теперь
//   a = [0, 2, 8, 0];
// - во время третьей игры были выбраны второй и третий игроки. Количество фишек
//   у третьего игрока больше, поэтому он забирает фишки второго игрока. Теперь
//   a = [0, 0, 10, 0];
// - третий игрок объявляется победителем чемпионата.

// Победители чемпионата получат именные призы. Поэтому судьи хотят заранее узнать,
// какие игроки имеют шанс на победу, то есть имеют ненулевую вероятность выиграть
// чемпионат. Вам было поручено найти всех таких игроков.

// Входные данные
// В первой строке находится одно целое число t (1 ≤ t ≤ 10^4) — количество наборов
// входных данных. Далее следуют t наборов входных данных.

// Первая строка каждого набора входных данных состоит из одного целого положительного
// числа n (1 ≤ n ≤ 2·10^5) — количества игроков в чемпионате.

// Во второй строке каждого набора входных данных находятся n целых положительных чисел
// a1, a2, …, a_n (1 ≤ a_i ≤ 10^9) — количества фишек у игроков.

// Гарантируется, что сумма n по всем наборам входных данных не превышает 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите количество игроков, которые имеют
// ненулевую вероятность выиграть чемпионат. На следующей строке выведите номера этих
// игроков в возрастающем порядке. Игроки пронумерованы начиная с единицы в порядке
// следования во входных данных.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 2
// 4
// 1 2 4 3
// 5
// 1 1 1 1 1
// ======================================================================
// Выходные данные
// ======================================================================
// 3
// 2 3 4
// 5
// 1 2 3 4 5
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<pair<int, int>> a(n + 1, {1e18, 1e18});
    vector<int> pref(n + 2, 0);
    map<int, vector<int>> m;
    for (int i = 0; i < n; i++)
    {
        cin >> a[i].first;
        a[i].second = i + 1;
        // m[a[i]].push_back(i + 1);
    }

    sort(a.begin(), a.end());
    vector<int> res;
    for (int i = 0; i < n; i++)
        pref[i + 1] = pref[i] + a[i].first;
    a[n].first = a[n - 1].first;
    for (int i = n; i > 0; i--)
    {
        if (pref[i] >= a[i].first)
            res.push_back(a[i - 1].second);
        else
            break;
    }
    cout << res.size() << '\n';
    sort(res.begin(), res.end());
    for (auto &i : res)
        cout << i << ' ';
    cout << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}

//   1 2 3 4
// 0 1 3 6 10 11
//         4

//   2 3 3 3
// 0 2 5 8
