// D. Эпическая трансформация
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вам задан массив a длины n, состоящий из целых чисел. Вы можете применять следующую
// операцию, состоящую из нескольких шагов, над массивом a ноль или более раз:

// - вы выбираете два различных числа в массиве a_i и a_j;
// - вы удаляете i-й и j-й элементы из массива.

// Например, если n = 6 и a = [1, 6, 1, 1, 4, 4], то вы можете произвести следующую
// последовательность операций:

// - выбираем i = 1, j = 5. Массив a становится равным [6, 1, 1, 4];
// - выбираем i = 1, j = 2. Массив a становится равным [1, 4].

// Каким может быть минимальный размер массива после применения к нему некоторой
// последовательности операций?

// Входные данные
// Первая строка содержит одно целое число t (1 ≤ t ≤ 10^4) — количество наборов
// входных данных. Далее следуют t наборов входных данных.

// Первая строка каждого набора входных данных содержит одно целое число n
// (1 ≤ n ≤ 2·10^5) — длина массива a.

// Вторая строка каждого набора входных данных содержит n целых чисел a1, a2, …, a_n
// (1 ≤ a_i ≤ 10^9).

// Гарантируется, что сумма n по всем наборам входных данных не превышает 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — минимальный возможный
// размер массива после применения к нему некоторой последовательности операций.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 6
// 1 6 1 1 4 4
// 2
// 1 2
// 2
// 1 1
// 5
// 4 5 4 5 4
// 6
// 2 3 2 1 3 1
// ======================================================================
// Выходные данные
// ======================================================================
// 0
// 0
// 2
// 1
// 0
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    map<int, int> m;
    int mx = 0, mn = 0;
    for (int i = 0; i < n; i++)
    {
        int x;
        cin >> x;
        m[x]++;
        mn++;
        if (m[x] > mx)
        {
            mn -= m[x];
            mn += mx;
            mx = m[x];
        }
    }
    if (mn < mx)
        cout << mx - mn << '\n';
    else
    {
        if (n % 2 == 0)
            cout << "0\n";
        else
            cout << "1\n";
    }
    // cout << mn << ' ' << mx << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
