// C. Очередная задача про колоду карт
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// У вас есть колода из n карт, пронумерованных сверху вниз, т. е. у верхней карты
// индекс 1, а у нижней — n. У каждой карты есть цвет: цвет i-й карты равен a_i.

// Вам нужно обработать q запросов: j-й запрос описывается одним целым числом t_j.
// Для каждого запроса вам нужно:

// - найти самую верхнюю карту в колоде с цветом t_j, т. е. карту с минимальным
//   индексом;
// - вывести индекс найденной карты;
// - вытащить данную карту и положить её сверху колоды.

// Входные данные
// В первой строке заданы два целых числа n и q (2 ≤ n ≤ 3·10^5; 1 ≤ q ≤ 3·10^5) —
// количество карт в колоде и количество запросов.

// Во второй строке заданы n целых чисел a1, a2, …, a_n (1 ≤ a_i ≤ 50) — цвета карт.

// В третьей строке заданы q целых чисел t1, t2, …, t_q (1 ≤ t_j ≤ 50) — цвета
// в запросах. Гарантируется, что в запросах используются только цвета,
// представленные в колоде.

// Выходные данные
// Выведите q целых чисел — ответы на все запросы.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 7 5
// 2 1 1 4 3 3 1
// 3 2 1 1 4
// ======================================================================
// Выходные данные
// ======================================================================
// 5 2 3 1 5
// ======================================================================

// Примечание
// Описание примера:

// - текущая колода [2, 1, 1, 4, 3, 3, 1] и верхняя карта цвета t1 = 3
//   на позиции 5;
// - текущая колода [3, 2, 1, 1, 4, 3, 1] и верхняя карта цвета t2 = 2
//   на позиции 2;
// - текущая колода [2, 3, 1, 1, 4, 3, 1] и верхняя карта цвета t3 = 1
//   на позиции 3;
// - текущая колода [1, 2, 3, 1, 4, 3, 1] и верхняя карта цвета t4 = 1
//   на позиции 1;
// - текущая колода [1, 2, 3, 1, 4, 3, 1] и верхняя карта цвета t5 = 4
//   на позиции 5.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, q;
    cin >> n >> q;
    list<int> a(n);
    for (auto &i : a)
        cin >> i;
    while (q--)
    {
        int x, c = 1;
        cin >> x;
        for (auto i = a.begin(); i != a.end(); i++, c++)
        {
            if (*i == x)
            {
                int t = *i;
                a.erase(i);
                a.push_front(t);
                break;
            }
        }
        cout << c << ' ';
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
