// D. Одинаковые разницы
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вам дан массив a из n целых чисел. Посчитайте количество пар индексов (i, j),
// таких что i < j и a_j − a_i = j − i.

// Входные данные
// В первой строке содержится одно целое число t (1 ≤ t ≤ 10^4). Далее следуют t
// наборов входных данных.

// В первой строке каждого набора входных данных находится одно целое число n
// (1 ≤ n ≤ 2·10^5).

// Во второй строке каждого набора входных данных находятся n целых чисел
// a1, a2, …, a_n (1 ≤ a_i ≤ n) — массив a.

// Гарантируется, что сумма n по всем наборам входных данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — количество пар
// индексов (i, j), таких что i < j и a_j − a_i = j − i.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 6
// 3 5 1 4 6 6
// 3
// 1 2 3
// 4
// 1 3 3 4
// 6
// 1 6 3 4 5 6
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 3
// 3
// 10
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    unordered_map<int, int> m;
    for (int i = 1; i <= n; i++)
    {
        int x;
        cin >> x;
        m[x - i]++;
    }
    int res = 0;
    for (auto &i : m)
    {
        res += (i.second - 1) * i.second;
    }
    cout << res / 2 << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
