// B. Я ненавижу 1111
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Вам дано целое число x. Можете ли вы получить x, просуммировав некоторое количество
// чисел 11, 111, 1111, 11111, …? (Вы можете использовать любое число из них любое
// количество раз).

// Например,

// - 33 = 11 + 11 + 11
// - 144 = 111 + 11 + 11 + 11

// Входные данные
// Первая строка ввода содержит одно целое число t (1 ≤ t ≤ 10000) — количество
// наборов входных данных.

// Первая и единственная строка каждого набора входных данных содержит одно целое
// число x (1 ≤ x ≤ 10^9) — число, которое вы должны получить.

// Выходные данные
// Для каждого набора входных данных вы должны вывести одну строку. Если вы можете
// получить x, выведите «YES» (без кавычек). В противном случае выведите «NO».

// Вы можете вывести каждую букву из «YES» и «NO» в любом регистре (верхнем или нижнем).

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 3
// 33
// 144
// 69
// ======================================================================
// Выходные данные
// ======================================================================
// YES
// YES
// NO
// ======================================================================

// Примечание
// Способы получения 33 и 144 были представлены в условии. Можно показать, что мы не
// можем представить 69 таким образом.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int x;
    cin >> x;
    for (int i = 0; i <= 11; i++)
        if (x >= 111 * i && (x - 111 * i) % 11 == 0)
        {
            cout << "YES\n";
            return;
        }
    cout << "NO\n";
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
