// C1. Настойки (простая версия)
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Это простая версия задачи. Единственное отличие в том, что в этой версии n ≤ 2000.
// Вы можете делать взломы, только если решены обе версии задачи.

// В линию выстроены n настоек, причём настойка 1 находится слева, а настойка n —
// справа. Каждая настойка увеличит ваше здоровье на a_i, если её выпить. a_i может
// быть отрицательным, что означает, что настойка уменьшит ваше здоровье.

// Вы начинаете с 0 здоровья и будете идти слева направо, от первой настойки
// до последней. Для каждой настойки вы можете выбрать, выпить ли её. Вы должны
// следить за тем, чтобы ваше здоровье всегда было неотрицательным.

// Какое наибольшее количество настоек вы можете выпить?

// Входные данные
// Первая строка содержит одно целое число n (1 ≤ n ≤ 2000) — количество настоек.

// Следующая строка содержит n целых чисел a1, a2, …, a_n (−10^9 ≤ a_i ≤ 10^9),
// которые обозначают изменения здоровья после употребления данных настоек.

// Выходные данные
// Выведите одно целое число — максимальное количество настоек, которое вы можете
// выпить, чтобы ваше здоровье всегда было неотрицательным.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 4 -4 1 -3 1 -3
// ======================================================================
// Выходные данные
// ======================================================================
// 5
// ======================================================================

// Примечание
// В примере вы можете выпить 5 настоек, приняв настойки 1, 3, 4, 5 и 6.
// Невозможно выпить все 6 настоек, потому что в какой-то момент ваше здоровье
// станет отрицательным.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;
    vector<vector<int>> dp(n + 1, vector<int>(n + 1, -1e18));
    dp[0][0] = 0;
    for (int i = 1; i <= n; i++)
        for (int k = 0; k <= i; k++)
        {
            if (k > 0 && dp[i - 1][k - 1] + a[i - 1] >= 0)
                dp[i][k] = max(dp[i - 1][k - 1] + a[i - 1], dp[i - 1][k]);
            else
                dp[i][k] = dp[i - 1][k];
        }

    for (int i = n; i >= 0; i--)
        if (dp[n][i] != -1e18)
        {
            cout << i;
            return;
        }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
