// C. Сложные скалы
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вы — дизайнер игр, и хотите создать полосу препятствий. Игрок будет идти слева
// направо. У вас уже есть n высот гор, и вы хотите расположить эти высоты так,
// чтобы абсолютная разность между высотами первой и последней гор была как можно
// меньше.

// Кроме того, вы хотите сделать игру сложной, а поскольку идти в гору или по равнине
// сложнее, чем спускаться по склону, то сложность уровня будет равна количеству гор i
// (1 ≤ i < n) таких, что h_i ≤ h_{i+1}, где h_i — высота i-й горы. Вы не хотите
// потратить впустую ни одну из смоделированных гор, поэтому должны использовать их все.

// Из всех вариантов, минимизирующих |h1 − h_n|, найдите самый сложный. Если существует
// несколько порядков, удовлетворяющих этим требованиям, вы можете найти любой.

// Входные данные
// Первая строка будет содержать одно целое число t (1 ≤ t ≤ 100) — количество наборов
// входных данных. Затем следуют t наборов входных данных.

// Первая строка каждого набора входных данных содержит одно целое число n
// (2 ≤ n ≤ 2·10^5) — количество гор.

// Вторая строка каждого набора входных данных содержит n целых чисел h1, h2, …, h_n
// (1 ≤ h_i ≤ 10^9), где h_i — высота i-й горы.

// Гарантируется, что сумма n по всем наборам входных данных не превышает 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите n целых чисел — заданные высоты в порядке,
// который максимизирует сложность уровня среди всех порядков, минимизирующих |h1 − h_n|.

// Если существует несколько порядков, удовлетворяющих этим требованиям, вы можете
// вывести любой.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 2
// 4
// 4 2 1 2
// 2
// 3 1
// ======================================================================
// Выходные данные
// ======================================================================
// 2 4 1 2
// 1 3
// ======================================================================

// Примечание
// В первом наборе входных данных:

// Игрок начинает с высоты 2, затем поднимается на высоту 4, увеличивая сложность на 1.
// После этого он спускается на высоту 1, и сложность не меняется, потому что он
// спускается вниз. Наконец, игрок поднимется на высоту 2, и сложность увеличится на 1.
// Абсолютная разность между начальной и конечной высотой равна 0, а следовательно
// минимальна. Трудность максимальна при данных условиях.

// Во втором наборе входных данных:

// Игрок начинает с высоты 1, затем поднимается до высоты 3, увеличивая сложность на 1.
// Абсолютная разность между начальной и конечной высотой равна 2, и она минимально
// возможная, так как это единственные высоты. Трудность максимальна.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;
    sort(a.begin(), a.end());
    int min_dt = 1e9, mdtinx = 0;
    for (int i = 0; i < n - 1 && n > 2; i++)
    {
        if (a[i + 1] - a[i] < min_dt)
        {
            min_dt = a[i + 1] - a[i];
            mdtinx = i + 1;
        }
    }
    for (int i = mdtinx; i < n; i++)
        cout << a[i] << ' ';
    for (int i = 0; i < mdtinx; i++)
        cout << a[i] << ' ';
    cout << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
