// F. Интересная функция
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вам заданы два целых числа l и r, где l < r. Будем прибавлять 1 к l до тех пор,
// пока результат не окажется равным r. Таким образом, будет сделано ровно r − l
// прибавлений единицы. Для каждого такого прибавления посмотрим на количество цифр,
// которые будут изменены при этом прибавлении. Например:

// - если l = 909, то прибавление единицы приведёт к результату 910 и будут изменены
//   2 цифры;
// - если к l = 9 прибавить единицу, то результат будет равен 10 и будут изменены тоже
//   2 цифры;
// - если к l = 489999 прибавить единицу, то результат будет равен 490000 и будут
//   изменены 5 цифр.

// Изменённые цифры всегда образуют некоторый суффикс десятичной записи результата.

// Выведите суммарное количество изменённых цифр, если требуется из l получить r,
// прибавляя каждый раз 1.

// Входные данные
// В первой строке находится целое число t (1 ≤ t ≤ 10^4). Далее следуют t наборов
// входных данных.

// Каждый набор входных данных характеризуется двумя целыми числами l и r
// (1 ≤ l < r ≤ 10^9).

// Выходные данные
// Для каждого набора входных данных вычислите суммарное количество изменённых цифр,
// если требуется из l получить r, прибавляя каждый раз единицу.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 1 9
// 9 10
// 10 20
// 1 1000000000
// ======================================================================
// Выходные данные
// ======================================================================
// 8
// 2
// 11
// 1111111110
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int l, r;
    cin >> l >> r;
    int res = r - l, c = 1;
    while (pow(10, c) <= r)
    {
        res += ((int)(r / pow(10, c)) - (int)(l / pow(10, c)));
        c++;
    }
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
