// C. Количество пар
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вам задан массив a, состоящий из n целых чисел. Найдите количество пар индексов
// (i, j) (1 ≤ i < j ≤ n), для которых сумма a_i + a_j больше или равна l и меньше
// или равна r (то есть l ≤ a_i + a_j ≤ r).

// Например, если n = 3, a = [5, 1, 2], l = 4 и r = 7, то подходят две пары:

// - i = 1 и j = 2 (4 ≤ 5 + 1 ≤ 7);
// - i = 1 и j = 3 (4 ≤ 5 + 2 ≤ 7).

// Входные данные
// В первой строке находится целое число t (1 ≤ t ≤ 10^4). Далее следуют t наборов
// входных данных.

// В первой строке каждого набора входных данных находятся три целых числа n, l, r
// (1 ≤ n ≤ 2·10^5, 1 ≤ l ≤ r ≤ 10^9) — количество чисел в массиве и ограничения
// на сумму в паре.

// Во второй строке находится n целых чисел a1, a2, …, a_n (1 ≤ a_i ≤ 10^9).

// Гарантируется, что сумма n по всем наборам входных данных не превышает 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — количество пар
// индексов (i, j) (i < j), для которых l ≤ a_i + a_j ≤ r.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 3 4 7
// 5 1 2
// 5 5 8
// 5 1 2 4 3
// 4 100 1000
// 1 1 1 1
// 5 9 13
// 2 5 5 1 1
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// 7
// 0
// 1
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long
#define all(a) a.begin(), a.end()

void solve()
{
    int n, l, r;
    cin >> n >> l >> r;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;
    sort(all(a));
    int res = 0;
    for (int i = 0; i < n; i++)
    {
        res += upper_bound(all(a), r - a[i]) - a.begin();
        res -= lower_bound(all(a), l - a[i]) - a.begin();
        if (l <= 2 * a[i] && a[i] * 2 <= r)
            res--;
    }

    cout << res / 2 << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
