// B. Маленькая пони и ларец гармонии
// ограничение по времени на тест4 секунды
// ограничение по памяти на тест256 мегабайт

// Принцесса Twilight пришла к Celestia в замок, где раньше жила Luna, чтобы исследовать
// ларец элементов гармонии.

// Последовательность положительных целых чисел b_i называется гармонической тогда
// и только тогда, когда наибольший общий делитель любых двух её элементов равен 1.
// Согласно древней книге, ключ от ларца — это гармоническая последовательность b_i,
// минимизирующая значение выражения:

// ∑_{i=1}^{n} |a_i - b_i|.

// Вам дана последовательность a_i. Помогите принцессе Twilight найти ключ от ларца.

// Входные данные
// Первая строка содержит целое число n (1 ≤ n ≤ 100) — количество элементов
// в последовательностях a и b. Следующая строка содержит n целых чисел
// a1, a2, …, a_n (1 ≤ a_i ≤ 30).

// Выходные данные
// Выведите ключ — последовательность b_i, которая минимизирует сумму, описанную выше.
// Если существует несколько правильных последовательностей, выведите любую.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 1 1 1 1 1
// ======================================================================
// Выходные данные
// ======================================================================
// 1 1 1 1 1

// ======================================================================
// Входные данные
// ======================================================================
// 5
// 1 6 4 2 8
// ======================================================================
// Выходные данные
// ======================================================================
// 1 5 3 1 8
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

int primes[] = {2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59};

void solve()
{
    // Код
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
