// B. Сложить и умножить
// ограничение по времени на тест3 секунды
// ограничение по памяти на тест512 мегабайт

// Дано бесконечное множество, сгенерированное следующим образом:

// - 1 принадлежит множеству.
// - Если x принадлежит множеству, то x·a и x + b также принадлежат множеству.

// Например, если a = 3 и b = 6, то первые пять элементов множества равны:

// 1,
// 3 (1 лежит в множестве, поэтому 1·a = 3 лежит в множестве),
// 7 (1 лежит в множестве, поэтому 1 + b = 7 лежит в множестве),
// 9 (3 лежит в множестве, поэтому 3·a = 9 лежит в множестве),
// 13 (7 лежит в множестве, поэтому 7 + b = 13 лежит в множестве).

// Даны положительные целые числа a, b, n. Выясните, принадлежит ли n множеству.

// Входные данные
// Каждый тест содержит несколько наборов входных данных. Первая строка содержит одно
// целое число t (1 ≤ t ≤ 10^5) – количество наборов входных данных. Далее следует
// описание наборов входных данных.

// Строка, описывающая набор входных данных, содержит три целых числа n, a, b
// (1 ≤ n, a, b ≤ 10^9), разделённых пробелом.

// Выходные данные
// Для каждого набора входных данных выведите «Yes», если n принадлежит множеству,
// и «No» иначе. Вы можете выводить каждую букву в любом регистре (строчную или заглавную).

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 24 3 5
// 10 3 6
// 2345 1 4
// 19260817 394 485
// 19260817 233 264
// ======================================================================
// Выходные данные
// ======================================================================
// Yes
// No
// Yes
// No
// Yes
// ======================================================================

// Примечание
// В первом наборе 24 генерируется следующим образом:

// - 1 лежит в множестве, поэтому 3 и 6 лежат в множестве;
// - 3 лежит в множестве, поэтому 9 и 8 лежат в множестве;
// - 8 лежит в множестве, поэтому 24 и 13 лежат в множестве.

// Таким образом, 24 принадлежит множеству.

// Первые пять элементов множества из второго набора входных данных описаны в условии.
// Можно заметить, что 10 не в их числе.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, a, b;
    cin >> n >> a >> b;
    if (b == 1)
    {
        cout << "Yes\n";
        return;
    }
    if (a == 1)
    {
        if ((n - 1) % b == 0)
            cout << "Yes\n";
        else
            cout << "No\n";
        return;
    }
    int find = n % b;
    int cur = 1;
    while (cur <= n)
    {
        if (cur % b == find)
        {
            cout << "Yes\n";
            return;
        }
        cur *= a;
    }
    cout << "No\n";
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
