// C. Парное программирование
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест512 мегабайт

// Монокарп и Поликарп изучают новые приемы программирования. Сейчас они решили
// попробовать парное программирование.

// Известно, что они проработали вместе n + m минут, работая над одним файлом.
// Каждую минуту ровно один из них делал одно изменение в файле. До начала их работы
// в файле было k строк.

// За одну минуту любой из них может выполнить одно из двух действий: добавить новую
// строку в конец файла или изменить одну его строку.

// Суммарно Монокарп работал n минут и выполнил последовательность действий
// [a1, a2, …, a_n], где a_i = 0, если он добавил новую строку в конец файла,
// или a_i > 0, если он изменил строку с номером a_i. Действия Монокарп производил
// именно в таком порядке: сначала a1, затем a2 и так далее до a_n.

// Суммарно Поликарп работал m минут и выполнил последовательность действий
// [b1, b2, …, b_m], где b_j = 0, если он добавил новую строку в конец файла,
// или b_j > 0, если он изменил строку с номером b_j. Действия Поликарп производил
// именно в таком порядке: сначала b1, затем b2 и так далее до b_m.

// Восстановите их общую последовательность действий длины n + m, такую, в которой
// все действия были бы корректными — то есть не должно быть изменений ещё не
// существующих строк. Имейте в виду, что в общей последовательности действия
// Монокарпа должны образовывать подпоследовательность [a1, a2, …, a_n], а Поликарпа —
// подпоследовательность [b1, b2, …, b_m]. Монокарп и Поликарп могут сменять друг
// друга за компьютером произвольное количество раз.

// Рассмотрим пример. Пусть изначально k = 3. Монокарп сначала изменил строку с номером 2,
// а затем добавил новую строку (то есть n = 2, a = [2, 0]). Поликарп же сначала
// добавил новую строку, а затем изменил строку с номером 5 (то есть m = 2, b = [0, 5]).

// Так как изначальная длина файла равна 3, для того, чтобы Поликарп смог изменить
// строку с номером 5, необходимо сначала добавить две новые строки. Примером правильных
// последовательностей изменений в таком случае будет [0, 2, 0, 5] или [2, 0, 0, 5].
// Последовательности изменений [0, 0, 5, 2] (нарушен порядок действий) и [0, 5, 2, 0]
// (нельзя отредактировать строку 5) не являются корректными.

// Входные данные
// В первой строке задано целое число t (1 ≤ t ≤ 1000) — количество наборов входных
// данных в тесте. Далее следуют t наборов входных данных. Перед каждым набором
// входных данных записана пустая строка.

// Каждый набор входных данных состоит из трёх строк. В первой строке заданы три
// целых числа k, n, m (0 ≤ k ≤ 100, 1 ≤ n, m ≤ 100) — изначальное количество строк
// в файле и длины массивов изменений Монокарпа и Поликарпа соответственно.

// Вторая строка содержит n целых чисел a1, a2, …, a_n (0 ≤ a_i ≤ 300).

// Третья строка содержит m целых чисел b1, b2, …, b_m (0 ≤ b_j ≤ 300).

// Выходные данные
// Для каждого набора входных данных выведите через пробел элементы любой корректной
// объединённой последовательности действий Монокарпа и Поликарпа длины n + m
// или -1, если такой последовательности не существует.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5

// 3 2 2
// 2 0
// 0 5

// 4 3 2
// 2 0 5
// 0 6

// 0 2 2
// 1 0
// 2 3

// 5 4 4
// 6 0 8 0
// 0 7 0 9

// 5 4 1
// 8 7 8 0
// 0
// ======================================================================
// Выходные данные
// ======================================================================
// 2 0 0 5
// 0 2 0 6 5
// -1
// 0 6 0 7 0 8 0 9
// -1
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int k, n, m;
    cin >> k >> n >> m;
    vector<int> a(n), b(m);
    list<int> result;
    for (auto &i : a)
        cin >> i;
    for (auto &i : b)
        cin >> i;
    int ia = 0, ib = 0;
    while (ia < n || ib < m)
    {
        if ((ia < n && a[ia] > k && ib >= m) || (ib < m && b[ib] > k && ia >= n) || (ia < n && ib < m && a[ia] > k && b[ib] > k))
        {
            cout << "-1\n";
            return;
        }
        while (ia < n && (a[ia] <= k || a[ia] == 0))
        {
            k += a[ia] == 0 ? 1 : 0;
            result.push_back(a[ia]);
            ia++;
        }
        while (ib < m && (b[ib] <= k || b[ib] == 0))
        {
            k += b[ib] == 0 ? 1 : 0;
            result.push_back(b[ib]);
            ib++;
        }
    }
    for (auto i : result)
        cout << i << ' ';
    cout << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
