// C. Ряды монет
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Алиса и Боб играют в игру на матрице, состоящей из 2 строк и m столбцов.
// В ячейке в i-й строке в j-м столбце лежит a_{i,j} монет.

// Изначально Алиса и Боб стоят в ячейке (1,1). Они собираются пройти какой-то
// последовательностью ходов в ячейку (2,m).

// Возможные ходы следующие:

// - Пойти направо — из некоторой ячейки (x,y) в (x,y+1);
// - Пойти вниз — из некоторой ячейки (x,y) в (x+1,y).

// Сначала Алиса делает все свои ходы, пока не достигнет (2,m). Она собирает монеты
// во всех клетках, которые она посещает (включая стартовую).

// Когда Алиса заканчивает, Боб начинает свой путь. Он также делает ходы, чтобы достичь
// (2,m), и собирает монеты во всех клетках, которые он посетил, а Алиса нет.

// Счёт в игре равен суммарному количеству монет, которые собрал Боб.

// Алиса хочет минимизировать счёт. Боб хочет максимизировать счёт. Какой будет счёт
// в игре, если оба игрока играют оптимально?

// Входные данные
// В первой строке записано одно целое число t (1 ≤ t ≤ 10^4) — количество наборов
// входных данных.

// Затем следуют описания t наборов входных данных.

// В первой строке каждого набора записано одно целое число m (1 ≤ m ≤ 10^5) —
// количество столбцов в матрице.

// В i-й из следующих 2 строк записаны m целых чисел a_{i,1}, a_{i,2}, …, a_{i,m}
// (1 ≤ a_{i,j} ≤ 10^4) — количество монет в ячейке в i-м ряду в j-м столбце матрицы.

// Сумма m по всем наборам входных данных не превосходит 10^5.

// Выходные данные
// На каждый набор входных данных выведите одно целое число — счёт игры, если оба
// игрока играют оптимально.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 3
// 3
// 1 3 7
// 3 5 1
// 3
// 1 3 9
// 3 5 1
// 1
// 4
// 7
// ======================================================================
// Выходные данные
// ======================================================================
// 7
// 8
// 0
// ======================================================================

// Примечание
// Пути для наборов входных данных из примеров изображены ниже. Путь Алисы раскрашен
// красным, а путь Боба — синим.

#include <bits/stdc++.h>
using namespace std;

#define int long long

int inpt(vector<int> &pref, int n)
{
    for (int i = 0; i < n; i++)
    {
        int x;
        cin >> x;
        pref[i + 1] = pref[i] + x;
    }
    return pref[n];
}

void solve()
{
    int n;
    cin >> n;
    vector<int> pref_a(n + 1, 0), pref_b(n + 1, 0); // , a(n), b(n);
    int max_a = inpt(pref_a, n);
    int max_b = inpt(pref_b, n);

    int best_result = 1e18;
    for (int i = 0; i < n; i++)
        best_result = min(best_result, max(max_a - pref_a[i + 1], max_b - (max_b - pref_b[i])));
    cout << best_result << '\n';
}
// 0 1 4 11
// 0 3 8 9

int32_t
main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
