// B. Такси
// ограничение по времени на тест3 seconds
// ограничение по памяти на тест256 megabytes

// После окончания уроков n групп школьников вышли на улицу и собрались ехать домой
// к Поликарпу на празднование его дня рождения. Известно, что i-я группа состоит
// из s_i друзей (1 ≤ s_i ≤ 4), которые не хотят расставаться по пути к Поликарпу.
// Решено ехать на такси. Каждая машина может вместить не более четырёх пассажиров.
// Какое минимальное количество машин потребуется школьникам, если каждая группа должна
// целиком находиться в одной из машин такси (но одна машина может вмещать более чем
// одну группу)?

// Входные данные
// В первой строке записано целое число n (1 ≤ n ≤ 10^5) — количество групп школьников.
// Вторая строка содержит последовательность целых чисел s1, s2, …, s_n (1 ≤ s_i ≤ 4).
// Числа записаны через пробел, s_i — количество ребят в i-й группе.

// Выходные данные
// Выведите единственное число — минимальное необходимое количество такси, чтобы отвезти
// всех ребят к Поликарпу.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 1 2 4 3 3
// ======================================================================
// Выходные данные
// ======================================================================
// 4

// ======================================================================
// Входные данные
// ======================================================================
// 8
// 2 3 4 4 2 1 3 1
// ======================================================================
// Выходные данные
// ======================================================================
// 5
// ======================================================================

// Примечание
// В первом тесте возможно следующее распределение по четырём машинам:

// - третья группа (из четырёх школьников),
// - четвёртая группа (из трёх школьников),
// - пятая группа (из трёх школьников),
// - первая и вторая группы (из одного и двух школьников соответственно).

// Существуют и другие способы расположиться в четырёх машинах.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, res = 0;
    cin >> n;
    unordered_map<int, int> m;
    for (int i = 0; i < n; i++)
    {
        int x;
        cin >> x;
        m[x]++;
    }

    res += m[4];
    res += m[3];
    m[1] = max(0LL, m[1] - m[3]);
    res += m[2] / 2;
    if (m[2] % 2 != 0)
    {
        res++;
        m[1] = max(0LL, m[1] - 2);
    }
    if (m[1] > 0)
        res += (m[1] + 3) / 4;

    cout << res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
