// B. Делись на 25!
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Задано целое положительное число n. За 1 ход можно выбрать любую его цифру и удалить
// её (т. е. выбирается некоторая позиция в числе и удаляется стоящая в этой позиции
// цифра). Операцию нельзя произвести, если осталась всего одна цифра. Если получившееся
// число содержит ведущие нули, то они автоматически удаляются.

// Например, если из числа 32925 удалить 3-ю цифру, то результатом операции станет
// число 3225, а если из числа 20099050 удалить первую цифру, то результатом операции
// станет число 99050 (следующие за первой цифрой 2 нуля удаляются автоматически).

// Какое наименьшее число ходов необходимо совершить, чтобы получившееся число делилось
// на 25 и было положительным? Гарантируется, что для всех n, заданных во входных
// данных, ответ существует. Гарантируется, что число n задано без ведущих нулей.

// Входные данные
// В первой строке записано одно целое число t (1 ≤ t ≤ 10^4) — количество наборов
// входных данных. Далее следуют t наборов входных данных.

// Каждый набор входных данных состоит из одной строки, содержащей одно целое число n
// (25 ≤ n ≤ 10^18). Гарантируется, что для всех n, заданных во входных данных, ответ
// существует. Гарантируется, что число n задано без ведущих нулей.

// Выходные данные
// Для каждого набора входных данных в отдельной строке выведите целое число k (k ≥ 0) —
// наименьшее число ходов, которые нужно сделать, чтобы число стало делиться на 25.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 100
// 71345
// 3259
// 50555
// 2050047
// ======================================================================
// Выходные данные
// ======================================================================
// 0
// 3
// 1
// 3
// 2
// ======================================================================

// Примечание
// В первом наборе входных данных уже задано число, которое делится на 25.

// Во втором наборе входных данных можно удалить цифры 1, 3 и 4, тогда получится число 75.

// В третьем наборе входных данных достаточно удалить последнюю цифру — получится число 325.

// В четвёртом наборе входных данных необходимо удалить три последние цифры — получится число 50.

// В пятом наборе входных данных достаточно удалить цифры 4 и 7.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    string s;
    cin >> s;
    int minres = s.size();
    for (int r = 0; r < s.size(); r++)
    {
        for (int l = 0; l < r; l++)
        {
            string t = "";
            t.push_back(s[l]);
            t.push_back(s[r]);
            if ((s[l] == '0' && s[r] == '0') || (stoi(t) % 25 == 0))
                minres = min(minres, (r - l - 1) + ((int)s.size() - r) - 1);
        }
    }
    cout << minres << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
