// C. Отравленный кинжал
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Монокарп играет в очередную компьютерную игру. В этой игре его персонаж должен
// убить дракона. Битва с драконом длится 10^5 секунд, в течение которых Монокарп
// атакует дракона отравленным кинжалом. i-я атака происходит в начале a_i-й секунды
// от начала боя. Сам кинжал не наносит урона, но накладывает эффект яда на дракона,
// который наносит 1 урона в течение следующих k секунд (начиная с секунды, когда
// дракону был нанесён удар кинжалом). Однако если дракон уже был отравлен ядом,
// то клинок обновляет эффект яда (т.е. отменяет действующий яд и накладывает новый).

// Например, предположим, что k = 4, и Монокарп наносит удар дракону в секунды 2, 4 и 10.
// Тогда эффект яда накладывается в начале 2-й секунды и наносит 1 урона в течение
// 2-й и 3-й секунд; затем, в начале 4-й секунды, эффект яда накладывается повторно,
// поэтому он наносит 1 урона в течение секунд 4, 5, 6 и 7; затем, на 10-й секунде,
// снова накладывается эффект яда, и он наносит 1 урона в течение секунд 10, 11, 12 и 13.
// В общей сложности дракон получает 10 единиц урона.

// Монокарп знает, что у дракона h очков здоровья, и если он нанесёт дракону хотя бы h
// урона во время битвы — он убьёт дракона. Монокарп ещё не определился с силой яда,
// который он будет использовать во время боя, поэтому он хочет найти минимально
// возможное значение k (количество секунд, в течение которых длится действие яда),
// которого достаточно, чтобы нанести дракону как минимум h урона.

// Входные данные
// Первая строка содержит одно целое число t (1 ≤ t ≤ 1000) — количество наборов
// входных данных.

// Первая строка каждого набора содержит два целых числа n и h (1 ≤ n ≤ 100; 1 ≤ h ≤ 10^18) —
// количество атак Монокарпа и количество урона, которое необходимо нанести.

// Вторая строка каждого набора содержит n целых чисел a1, a2, …, a_n (1 ≤ a_i ≤ 10^9; a_i < a_{i+1}),
// где a_i — номер секунды i-й атаки.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — минимальное значение
// параметра k, при котором Монокарп нанесёт дракону хотя бы h урона.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 2 5
// 1 5
// 3 10
// 2 4 10
// 5 3
// 1 2 4 5 7
// 4 1000
// 3 25 64 1337
// ======================================================================
// Выходные данные
// ======================================================================
// 3
// 4
// 1
// 470
// ======================================================================

// Примечание
// В первом примере для k = 3 урон наносится в секунды [1, 2, 3, 5, 6, 7].

// Во втором примере для k = 4 урон наносится в секунды [2, 3, 4, 5, 6, 7, 10, 11, 12, 13].

// В третьем примере для k = 1 урон наносится в секунды [1, 2, 4, 5, 7].

#include <bits/stdc++.h>
using namespace std;

#define int long long

bool check(vector<int> &a, int m, int h, int n)
{
    int total_dmg = m;
    for (int i = 0; i < n - 1; i++)
    {
        if (a[i] + m > a[i + 1]) // 4 10   6  7
            total_dmg += a[i + 1] - a[i];
        else
            total_dmg += m;
    }
    return total_dmg >= h;
}

void solve()
{
    int n, h;
    cin >> n >> h;
    int l = 0, r = 4e18;
    vector<int> dmg(n);
    for (auto &i : dmg)
        cin >> i;

    while (r > l + 1)
    {
        int m = (l + r) / 2;
        if (check(dmg, m, h, n))
            r = m;
        else
            l = m;
    }
    cout << r << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
