// C. Покраска массива
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вам дан массив a из n натуральных чисел. Вы должны выбрать натуральное число d
// и покрасить все элементы массива в два цвета. Те элементы, которые делятся на d,
// будут покрашены в красный цвет, а те, которые не делятся — в синий.

// Назовём раскраску красивой, если в полученном массиве нет двух соседних элементов
// одинакового цвета. Ваша задача — выбрать такое значение d, чтобы массив оказался
// красивым, или сказать, что это невозможно.

// Входные данные
// В первой строке задано одно целое число t (1 ≤ t ≤ 1000) — количество наборов
// входных данных.

// В первой строке каждого набора входных данных задано одно целое число n
// (2 ≤ n ≤ 100) — количество элементов массива.

// Во второй строке каждого набора входных данных заданы n целых чисел
// a1, a2, …, a_n (1 ≤ a_i ≤ 10^18).

// Выходные данные
// На каждый набор входных данных выведите одно целое число. Если такого числа d,
// при котором будет получена красивая раскраска, не существует, выведите 0.
// Иначе выведите любое подходящее целое число d (1 ≤ d ≤ 10^18).

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 5
// 1 2 3 4 5
// 3
// 10 5 15
// 3
// 100 10 200
// 10
// 9 8 2 6 6 2 8 6 5 4
// 2
// 1 3
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// 0
// 100
// 0
// 3
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;
    vector<int> g(a.begin(), a.end() + 2);
    for (int i = 0; i < n; i++)
        g[i % 2] = gcd(a[i], g[i % 2]);

    vector<bool> good(2, 1);
    for (int i = 0; i < n; i++)
    {
        good[i % 2] = good[i % 2] && (a[i] % g[(i % 2) ^ 1] > 0);
    }
    long long ans = 0;
    for (int i = 0; i < 2; i++)
        if (good[i])
            ans = max(ans, g[i ^ 1]);
    cout << ans << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }

    return 0;
}
