// C. Получи четную строку
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Строка a = a1 a2 … an называется чётной, если она состоит из конкатенации (соединения)
// строк длины 2, состоящих из одинаковых символов. Иными словами, строка a чётная,
// если одновременно выполняются два условия:

// - чётна её длина n;
// - для всех нечётных i (1 ≤ i ≤ n − 1) выполнено a_i = a_{i+1}.

// Например, следующие строки являются чётными: «» (пустая строка), «tt», «aabb»,
// «oooo» и «ttrrrroouuuuuuuukk». Следующие строки чётными не являются: «aaa», «abab»
// и «abba».

// Задана строка s, состоящая из строчных латинских букв. Необходимо найти, какое
// минимальное количество символов нужно удалить из строки s, чтобы она стала чётной.
// Удалённые символы не обязаны идти подряд.

// Входные данные
// В первой строке входных данных записано целое число t (1 ≤ t ≤ 10^4) — количество
// наборов входных данных в тесте.

// Далее следуют описания наборов входных данных.

// Каждый набор входных данных состоит из одной строки s (1 ≤ |s| ≤ 2·10^5), где |s| —
// длина строки s. Строка состоит из строчных букв латинского алфавита.

// Гарантируется, что сумма |s| по всем наборам входных данных не превышает 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите единственное число — минимальное
// количество символов, которые необходимо удалить, чтобы строка s стала чётной.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// aabbdabdccc
// zyx
// aaababbb
// aabbcc
// oaoaaaoo
// bmefbmuyw
// ======================================================================
// Выходные данные
// ======================================================================
// 3
// 3
// 2
// 0
// 2
// 7
// ======================================================================

// Примечание
// В первом наборе входных данных можно удалить символы под номерами 6, 7 и 9, получив
// чётную строку «aabbddcc».

// Во втором наборе входных данных каждый символ встречается ровно один раз, поэтому
// для того, чтобы получить чётную строку, необходимо удалить все символы из строки.

// В третьем наборе входных данных можно получить чётную строку «aaaabb», удалив,
// например, 4-й и 6-й символы, или строку «aabbbb», удалив 5-й символ и любой
// из первых трёх.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    string s;
    cin >> s;
    int n = s.size();
    vector<bool> a(26, 0);
    int good = 0;
    for (int i = 0; i < n; i++)
    {
        good += a[s[i] - 'a'] * 2;
        if (a[s[i] - 'a'])
            a.assign(26, 0);
        else
            a[s[i] - 'a'] = !a[s[i] - 'a'];
    }
    cout << n - good << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
