// F. Съедая конфеты
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Есть n конфет, разложенных слева направо на столе, конфеты пронумерованы слева
// направо. Вес i-й конфеты равняется w_i. Алиса и Боб едят конфеты.

// Алиса может съесть любое количество конфет слева (она ест их подряд и не может
// пропускать конфеты).

// Боб может съесть любое количество конфет справа (он ест их подряд и не может
// пропускать конфеты).

// Если Алиса съела конфету, то Боб уже не сможет её съесть (и наоборот).

// Они хотят поделить конфеты честно. Поэтому суммарные веса съеденных ими конфет
// должны быть равны. Какое наибольшее суммарное количество конфет они могут съесть
// в таком случае?

// Входные данные
// Первая строка входных данных содержит целое число t (1 ≤ t ≤ 10^4) — количество
// наборов входных данных.

// Первая строка каждого набора содержит единственное целое число n (1 ≤ n ≤ 2·10^5) —
// количество конфет на столе.

// Вторая строка каждого набора содержит n чисел w1, w2, …, w_n (1 ≤ w_i ≤ 10^4) —
// веса конфет от самой левой до самой правой.

// Гарантируется, что сумма n по всем наборам входных данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора выведите единственное число — максимальное количество конфет,
// которое могут съесть Алиса и Боб, соблюдая условие.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 3
// 10 20 10
// 6
// 2 1 4 2 4 1
// 5
// 1 2 4 8 16
// 9
// 7 3 20 5 15 1 11 8 10
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// 6
// 0
// 7
// ======================================================================

// Примечание
// В первом примере Алиса съест одну конфету слева, а Боб съест одну конфету справа.
// Нет лучшего способа съесть набор конфет одинакового веса. Ответ 2, так как они
// съедят суммарно две конфеты.

// Во втором примере Алиса съест первые три конфеты слева (суммарным весом 7),
// а Боб съест первые три конфеты справа (суммарным весом 7). Они не могут съесть
// больше конфет, так как все конфеты съедены. Ответ равен 6, так как они съели
// суммарно шесть конфет.

// В третьем примере Алиса и Боб не могут съесть наборы конфет одинакового ненулевого
// веса, поэтому ответ равен 0.

// В четвёртом примере Алиса съест конфеты весом [7, 3, 20], а Боб съест конфеты
// весом [10, 8, 11, 1], каждый из них съест набор конфет суммарным весом 30.
// Лучшего способа съесть конфеты нет, поэтому ответ 7.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;
    int res = 0, l = 0, r = n, cur_l_s = 0, cur_r_s = 0;
    for (int l = 0; l < r; l++)
    {
        cur_l_s += a[l];
        while (r - 1 > l && cur_l_s > cur_r_s)
        {
            r--;
            cur_r_s += a[r];
        }

        if (cur_l_s == cur_r_s)
            res = l + 1 + (n - r);
    }
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
