// A. Ранклист
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Завершилось очередное соревнование по программированию. К вам в руки попала таблица
// с финальными результатами этого соревнования. Для каждой команды в ней было указано
// количество задач, решённых данной командой, а также суммарное штрафное время данной
// команды по всем решённым ей задачам. Однако ни для одной команды в этой таблице
// не было указано её финальное место.

// Вам известны правила, по которым можно сравнить результаты двух заданных команд.
// Пусть команда a решила p_a задач с суммарным штрафным временем t_a, а команда b
// решила p_b задач с суммарным штрафным временем t_b. Тогда команда a займёт более
// высокое итоговое место, чем команда b, если она решила больше задач на соревновании,
// либо она решила такое же количество задач, но с меньшим суммарным временем. Другими
// словами, команда a окажется выше команды b в финальной таблице результатов, если
// p_a > p_b, либо p_a = p_b и при этом t_a < t_b.

// При этом считается, что команды, решившие одинаковое количество задач с одинаковым
// штрафным временем, делят между собой все соответствующие места. Более формально,
// пусть есть группа из x команд, которые решили одинаковое количество задач с одинаковым
// штрафным временем. Пусть также y команд выступили лучше команд из этой группы. Тогда
// все команды из группы разделят между собой y + 1, y + 2, …, y + x места. Команды,
// результат которых хуже, чем у команд из группы, получат свои места в итоговой
// таблице, начиная с y + x + 1 места.

// Вашей задачей будет посчитать, какое количество команд из заданного списка разделило
// между собой k-е место.

// Входные данные
// В первой строке заданы два целых числа n и k (1 ≤ k ≤ n ≤ 50). Далее в n строках
// следует описание команд: i-я строка содержит два целых числа p_i и t_i
// (1 ≤ p_i, t_i ≤ 50) — количество решённых задач и суммарное штрафное время i-й
// команды соответственно. Все числа в строках разделены пробелами.

// Выходные данные
// В единственной строке выведите искомое количество команд, занявших k-е место
// в итоговой таблице результатов.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 7 2
// 4 10
// 4 10
// 4 10
// 3 20
// 2 1
// 2 1
// 1 10
// ======================================================================
// Выходные данные
// ======================================================================
// 3

// ======================================================================
// Входные данные
// ======================================================================
// 5 4
// 3 1
// 3 1
// 5 3
// 3 1
// 3 1
// ======================================================================
// Выходные данные
// ======================================================================
// 4
// ======================================================================

// Примечание
// Итоговая таблица для первого примера:

// - 1–3 места — 4 решённых задачи, штрафное время равно 10;
// - 4 место — 3 решённые задачи, штрафное время равно 20;
// - 5–6 места — 2 решённые задачи, штрафное время равно 1;
// - 7 место — 1 решённая задача, штрафное время равно 10.

// По таблице видно, что второе место разделили команды, решившие 4 задачи со штрафным
// временем 10. Всего есть 3 такие команды.

// Итоговая таблица для второго примера:

// - 1 место — 5 решённых задач, штрафное время равно 3;
// - 2–5 места — 3 решённые задачи, штрафное время равно 1.

// По таблице видно, что четвёртое место разделили команды, решившие 3 задачи
// со штрафным временем 1. Всего есть 4 такие команды.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, k;
    cin >> n >> k;
    vector<pair<int, int>> a(n);
    for (auto &i : a)
        cin >> i.first >> i.second;
    sort(a.begin(), a.end(), [](pair<int, int> a, pair<int, int> b)
         { return a.first > b.first || a.first == b.first && a.second < b.second; });
    int l = 0, r = 0, res = 0;
    while (r < n)
    {
        while (r < n && a[l].first == a[r].first && a[l].second == a[r].second)
            r++;
        if (r >= k)
        {
            res = r - l;
            break;
        }
        l = r;
    }
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
