// E. Запросы на поедание конфет
// ограничение по времени на тест3.5 секунд
// ограничение по памяти на тест256 мегабайт

// У Тимура есть n конфет. В i-й конфете количество сахара равно a_i. Так, съев i-ю
// конфету, Тимур потребляет количество сахара, равное a_i.

// Тимур задаст вам q запросов о своих конфетах. Для j-го запроса вы должны ответить,
// какое минимальное количество конфет ему нужно съесть, чтобы потребить количество
// сахара, большее или равное x_j. Выведите -1, если невозможно получить такое
// количество. Другими словами, нужно вывести минимально возможное k такое, что,
// съев k конфет, Тимур получит количество сахара не менее x_j, или сказать, что
// такого k не существует.

// Обратите внимание, что он не может съесть одну и ту же конфету дважды, а запросы
// не зависят друг от друга (Тимур может использовать одну и ту же конфету в разных
// запросах).

// Входные данные
// Первая строка содержит единственное целое число t (1 ≤ t ≤ 1000) — количество
// наборов входных данных. Далее следуют описания наборов.

// Первая строка каждого набора содержит 2 целых числа n и q (1 ≤ n, q ≤ 1.5·10^5) —
// количество конфет, которые есть у Тимура, и количество запросов соответственно.

// Вторая строка каждого набора содержит n целых чисел a1, a2, …, a_n (1 ≤ a_i ≤ 10^4) —
// количество сахара в каждой конфете соответственно.

// Затем следуют q строк. Каждая из q содержит единственное целое число x_j
// (1 ≤ x_j ≤ 2·10^9) — количество сахара, которое хочет получить Тимур.

// Гарантируется, что сумма n и сумма q по всем наборам входных данных не превосходит 1.5·10^5.

// Выходные данные
// Для каждого набора входных данных выведите q строк. В j-й строке выведите количество
// конфет, которое нужно съесть Тимуру, чтобы получить количество сахара, большее
// или равное x_j. Выведите -1, если получить такое количество невозможно.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 3
// 8 7
// 4 3 3 1 1 4 5 9
// 1
// 10
// 50
// 14
// 15
// 22
// 30
// 4 1
// 1 2 3 4
// 3
// 1 2
// 5
// 4
// 6
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 2
// -1
// 2
// 3
// 4
// 8
// 1
// 1
// -1
// ======================================================================

// Примечание
// В первом наборе входных данных примера:

// - В первом запросе Тимур может съесть любую конфету, и он наберёт нужное количество.
// - Во втором запросе Тимур может получить количество не менее 10, съев 7-ю и 8-ю
//   конфету, таким образом потребив количество сахара, равное 14.
// - На третий запрос нет возможного ответа.
// - В четвёртом запросе Тимур может получить количество как минимум 14, съев 7-ю
//   и 8-ю конфету, таким образом потребив количество сахара, равное 14.

// Во втором наборе входных данных примера:

// - Для единственного запроса второго набора входных данных мы можем выбрать третью
//   конфету, из которой Тимур получает количество сахара, равное 3. Также можно
//   получить тот же ответ, выбрав четвёртую конфету.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, q;
    cin >> n >> q;
    vector<int> a(n), pref(n + 1, 0);
    for (auto &i : a)
        cin >> i;
    sort(a.rbegin(), a.rend());
    for (int i = 0; i < n; i++)
        pref[i + 1] = pref[i] + a[i];

    while (q--)
    {
        int x;
        cin >> x;
        int l = 0, r = n + 1;
        while (r > l + 1)
        {
            int m = (l + r) / 2;
            if (pref[m] >= x)
                r = m;
            else
                l = m;
        }

        cout << (r != n + 1 ? r : -1) << '\n';
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
