// B. Обмен обувью
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Группе студентов наскучило носить одну и ту же обувь каждый день, поэтому они
// решили обменяться обувью. В этой задаче пара обуви неразделима и понимается
// как один объект.

// В группе n студентов, и вам дан массив s в неубывающем порядке, где s_i — размер
// обуви i-го студента. Обмен обувью называется корректным, если никто не получит
// свою обувь, и каждый студент получит обувь не меньшего размера, чем его собственная.

// Вам нужно вывести перестановку p целых чисел {1, 2, …, n}, описывающую корректный
// обмен обувью: i-й студент получит обувь p_i-го студента (p_i ≠ i). Если решения
// не существует, выведите −1.

// Перестановкой называется массив, состоящий из n различных чисел от 1 до n
// в произвольном порядке. Например, [2, 3, 1, 5, 4] — перестановка, а [1, 2, 2]
// не перестановка (2 встречается дважды), и [1, 3, 4] тоже не перестановка (n = 3,
// но в массиве есть 4).

// Входные данные
// Во входных данных находятся несколько наборов входных данных. В первой строке
// находится одно целое число t (1 ≤ t ≤ 1000) — количество наборов входных данных.
// Далее следуют наборы входных данных.

// Первая строка каждого набора входных данных содержит целое число n (1 ≤ n ≤ 10^5) —
// количество студентов.

// Вторая строка каждого набора содержит n целых чисел s1, s2, …, s_n
// (1 ≤ s_i ≤ 10^9; для всех 1 ≤ i < n выполняется s_i ≤ s_{i+1}) — размеры обуви.

// Гарантируется, что сумма значений n по всем наборам входных данных не превосходит 10^5.

// Выходные данные
// Для каждого набора входных данных выведите ответ в следующем формате.

// Если корректного обмена не существует, выведите −1.

// Если корректный ответ существует, выведите n целых чисел: перестановку p чисел
// 1, 2, …, n, описывающую корректный обмен обувью, где i-й студент получит обувь
// p_i-го студента. Если существуют несколько решений, выведите любое.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 2
// 5
// 1 1 1 1 1
// 6
// 3 6 8 13 15 21
// ======================================================================
// Выходные данные
// ======================================================================
// 5 1 2 3 4
// -1
// ======================================================================

// Примечание
// В первом примере любая перестановка p чисел 1, …, n, где p_i ≠ i, описывает
// корректный обмен, так как у всех одинаковый размер обуви, и все могут носить
// обувь любого размера.

// Во втором примере можно показать, что корректного обмена обувью не существует.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    map<int, int> m;
    for (int i = 0; i < n; i++)
    {
        int x;
        cin >> x;
        if (m.contains(x))
            m[x]++;
        else
            m.insert({x, 1});
    }
    list<int> res;
    for (auto i : m)
    {
        if (i.second == 1)
        {
            cout << "-1\n";
            return;
        }
        else
        {
            int s = res.size();
            res.push_back(s + i.second);
            for (int j = s + 1; j < s + i.second; j++)
                res.push_back(j);
        }
    }
    for (auto i : res)
        cout << i << ' ';
    cout << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
