// D. Друзья и ресторан
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Компания из n друзей решила сходить в ресторан. Каждый из друзей планирует сделать
// заказ на x_i бурлей, а всего у него есть y_i бурлей (1 ≤ i ≤ n).

// Компания решила разбить посещение ресторана на несколько дней. Каждый день в ресторан
// отправляется некоторая группа из хотя бы двух друзей. Каждый из друзей посещает
// ресторан не более одного раза (то есть эти группы не пересекаются). Эти группы должны
// удовлетворять условию: суммарный бюджет каждой группы должен быть не меньше суммы,
// которую собираются потратить друзья из группы в ресторане. Другими словами, сумма
// всех значений x_i в группе не должна превышать сумму значений y_i в группе.

// Какое максимальное количество дней друзья могут посещать ресторан?

// Например, пусть есть n = 6 друзей, для которых x = [8, 3, 9, 2, 4, 5],
// а y = [5, 3, 1, 4, 5, 10]. Тогда:

// - Первый и шестой друзья могут пойти в ресторан в первый день. Они потратят
//   в ресторане 8 + 5 = 13 бурлей, а их суммарный бюджет составляет 5 + 10 = 15 бурлей.
//   Так как 15 ≥ 13, то они в самом деле могут образовать группу.
// - Друзья с номерами 2, 4, 5 могут образовать вторую группу. Они потратят
//   в ресторане 3 + 2 + 4 = 9 бурлей, а их общий бюджет составит 3 + 4 + 5 = 12 бурлей
//   (12 ≥ 9).
// - Можно показать, что образовать большее число групп так, чтобы в каждой группе
//   было хотя бы два друга и можно было оплатить счёт, они не смогут.

// Таким образом, максимальное количество групп, на которое могут разбиться друзья,
// равно 2. Друзья будут посещать ресторан максимум два дня. Отметим, что 3-й из друзей
// не посетит ресторан вообще.

// Выведите максимальное количество дней посещения ресторана по заданным n, x и y.

// Входные данные
// Первая строка входных данных содержит целое число t (1 ≤ t ≤ 10^4) — количество
// наборов входных данных в тесте.

// Далее следуют описания наборов входных данных.

// В первой строке каждого набора входных данных записано единственное целое число n
// (2 ≤ n ≤ 10^5) — количество друзей.

// Во второй строке каждого набора входных данных записано ровно n целых чисел
// x1, x2, …, x_n (1 ≤ x_i ≤ 10^9). Значение x_i соответствует количеству бурлей,
// которое друг под номером i планирует потратить в ресторане.

// В третьей строке каждого набора входных данных записано ровно n целых чисел
// y1, y2, …, y_n (1 ≤ y_i ≤ 10^9). Значение y_i соответствует количеству бурлей,
// которое есть у друга под номером i.

// Гарантируется, что сумма значений n по всем наборам входных данных не превышает 10^5.

// Выходные данные
// Для каждого набора входных данных выведите максимальное количество дней посещения
// ресторана. Если друзья не могут образовать даже одну группу для посещения,
// то выведите 0.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 6
// 8 3 9 2 4 5
// 5 3 1 4 5 10
// 4
// 1 2 3 4
// 1 1 2 2
// 3
// 2 3 7
// 1 3 10
// 6
// 2 3 6 9 5 7
// 3 2 7 10 6 10
// 6
// 5 4 2 1 8 100
// 1 1 1 1 1 200
// 6
// 1 4 1 2 4 2
// 1 3 3 2 3 4
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// 0
// 1
// 3
// 1
// 3
// ======================================================================

// Примечание
// Первый набор входных данных разобран в условии.

// Во втором наборе входных данных примера друзья не могут образовать хотя бы одну
// группу из двух или более человек.

// В третьем наборе входных данных один из способов посещать ресторан в течение одного
// дня — отправиться группой из всех трёх друзей (1 + 3 + 10 ≥ 2 + 3 + 7). Заметим,
// что возможности разбиться на две группы у них нет.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> x(n), y(n);
    vector<pair<int, int>> d(n);
    for (auto &i : x)
        cin >> i;
    for (auto &i : y)
        cin >> i;

    for (int i = 0; i < n; i++)
    {
        d[i].first = y[i] - x[i];
        d[i].second = i;
    }

    sort(d.rbegin(), d.rend());

    int r = n - 1, res = 0;

    for (int l = 0; l < n; l++)
    {
        while (r > l && d[l].first + d[r].first < 0)
            r--;
        if (r <= l)
            break;
        res++;
        r--;
    }
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
