// D. Взаимно простые
// ограничение по времени на тест3 секунды
// ограничение по памяти на тест256 мегабайт

// Дан массив из n целых положительных чисел a1, a2, …, a_n (1 ≤ a_i ≤ 1000).
// Выведите максимальное значение i + j такое, что a_i и a_j взаимно просты†,
// или −1, если таких i и j не существует.

// Например, рассмотрим массив [1, 3, 5, 2, 4, 7, 7]. Максимальное значение i + j,
// которое можно получить, равно 5 + 7, так как a5 = 4 и a7 = 7 являются взаимно
// простыми.

// † Два целых числа p и q являются взаимно простыми, если единственное положительное
// целое число, которое является делителем их обоих, равно 1 (их наибольший общий
// делитель равен 1).

// Входные данные
// Входные данные состоят из нескольких наборов. Первая строка содержит целое число t
// (1 ≤ t ≤ 10) — количество наборов. Далее следует их описание.

// Первая строка каждого набора содержит целое число n (2 ≤ n ≤ 2·10^5) — количество
// элементов в массиве.

// Следующая строка содержит n разделённых пробелами положительных чисел a1, a2, …, a_n
// (1 ≤ a_i ≤ 1000) — элементы массива.

// Гарантируется, что сумма n по всем тестовым случаям не превышает 2·10^5.

// Выходные данные
// Для каждого набора выведите одно целое число — максимальное значение i + j такое,
// что i и j удовлетворяют условию, что a_i и a_j взаимно просты, или выведите −1,
// если не существует таких i и j.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 3
// 3 2 1
// 7
// 1 3 5 2 4 7 7
// 5
// 1 2 3 4 5
// 3
// 2 2 4
// 6
// 5 4 3 15 12 16
// 5
// 1 2 2 3 6
// ======================================================================
// Выходные данные
// ======================================================================
// 6
// 12
// 9
// -1
// 10
// 7
// ======================================================================

// Примечание
// Для первого примера можно выбрать i = j = 3, при этом сумма индексов равна 6,
// так как 1 и 1 взаимно просты.

// Для второго примера можно выбрать i = 7 и j = 5, при этом сумма индексов равна
// 7 + 5 = 12, так как 7 и 4 являются взаимно простыми.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(1001, -1);
    for (int i = 1; i <= n; i++)
    {
        int x;
        cin >> x;
        a[x] = max(a[x], i);
    }
    int res = -1;
    for (int l = 1; l < 1001; l++)
        for (int r = l; r < 1001; r++)
            if (a[l] != -1 && a[r] != -1 && gcd(l, r) == 1)
                res = max(res, a[l] + a[r]);
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    const int SIZE_P = 2e3;

    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
