// E. Scuza
// ограничение по времени на тест3 секунды
// ограничение по памяти на тест256 мегабайт

// У Тимура есть лестница с n ступеньками. Ступенька i выше предыдущей на a_i метров.
// Первая ступенька на a_1 метр выше земли, а земля находится на высоте 0 метров.

// У Тимура есть q запросов, каждый из которых обозначается целым числом k1, …, k_q.
// Для каждого запроса k_i выведите максимально возможную высоту, на которую Тимур
// может подняться, поднимаясь по ступенькам, если длина его ног k_i. Тимур может
// подняться на j-ю ступеньку только в том случае, если длина его ног не меньше a_j.
// Другими словами, k_i ≥ a_j для каждой ступеньки j, на которую он хочет подняться.

// Обратите внимание, что вы должны ответить на каждый запрос независимо.

// Входные данные
// Первая строка содержит одно целое число t (1 ≤ t ≤ 100) — количество наборов
// входных данных.

// Первая строка каждого набора содержит два целых числа n, q (1 ≤ n, q ≤ 2·10^5) —
// количество ступенек и количество запросов соответственно.

// Вторая строка каждого набора содержит n целых чисел (1 ≤ a_i ≤ 10^9) —
// разницы в высотах ступенек.

// Третья строка каждого набора содержит q целых чисел (0 ≤ k_i ≤ 10^9) —
// числа для каждого запроса.

// Гарантируется, что сумма n по всем наборам не превосходит 2·10^5,
// сумма q по всем наборам не превосходит 2·10^5.

// Выходные данные
// Для каждого набора выведите q целых чисел — ответ на каждый запрос.

// Обратите внимание, что ответ на некоторые запросы не помещается в 32-битный
// целочисленный тип, поэтому вы должны использовать как минимум 64-битный
// целочисленный тип в вашем языке программирования (например, long long для C++).

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 3
// 4 5
// 1 2 1 5
// 1 2 4 9 10
// 2 2
// 1 1
// 0 1
// 3 1
// 1000000000 1000000000 1000000000
// 1000000000
// ======================================================================
// Выходные данные
// ======================================================================
// 1 4 4 9 9
// 0 2
// 3000000000
// ======================================================================

// Примечание
// Рассмотрим первый пример, изображённый в условии.

// - Если длина ног Тимура 1, то он может подняться только на ступеньку 1,
//   поэтому максимальная высота, на которую он может забраться, равна 1 метру.
// - Если длина ног Тимура 2 или 4, то он может подняться только по ступенькам 1, 2 и 3,
//   поэтому максимальная высота равна 1 + 2 + 1 = 4 метра.
// - Если длина ног Тимура составляет 9 или 10, то он может подняться по всей лестнице,
//   так что максимальная высота равна 1 + 2 + 1 + 5 = 9 метров.

// В первом запросе второго тестового примера у Тимура длина ног равна 0,
// поэтому он не может подняться даже на одну ступеньку.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, q;
    cin >> n >> q;
    vector<int> a(n), pref(n + 1, 0), res(q), mx(n + 1, 0);
    for (int i = 0; i < n; i++)
    {
        cin >> a[i];
        pref[i + 1] = pref[i] + a[i];
        mx[i + 1] = max(mx[i], a[i]);
    }

    for (int i = 0; i < q; i++)
    {
        int d;
        cin >> d;

        int l = 0, r = n + 1;
        while (r > l + 1)
        {
            int m = (l + r) / 2;
            if (d >= mx[m])
                l = m;
            else
                r = m;
        }

        res[i] = pref[l];
    }
    for (auto i : res)
        cout << i << ' ';
    cout << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
