// B. Li Hua и узор
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// У Li Hua есть узор размером n × n, каждая клетка которого либо синяя, либо красная.
// Он может выполнить ровно k операций. За одну операцию он выбирает клетку и меняет
// её цвет с красного на синий или с синего на красный. Каждая клетка может быть выбрана
// сколько угодно раз. Можно ли сделать узор, который соответствует его же повороту
// на 180°?

// Предположим, что вы Li Hua. Пожалуйста, решите эту задачу.

// Входные данные
// Первая строка содержит одно целое число t (1 ≤ t ≤ 100) — количество наборов
// входных данных.

// Первая строка каждого набора входных данных содержит два целых числа n, k
// (1 ≤ n ≤ 10^3, 0 ≤ k ≤ 10^9) — размер шаблона и количество операций.

// Каждая из следующих n строк содержит n целых чисел a_{i,j} (a_{i,j} ∈ {0, 1}) —
// начальный цвет клетки: 0 для синей и 1 для красной.

// Гарантируется, что сумма n по всем наборам входных данных не превышает 10^3.

// Выходные данные
// Для каждого набора входных данных выведите «YES», если возможно получить узор,
// соответствующий его повороту на 180°, применив ровно k операций, и «NO» в противном
// случае.

// Вы можете выводить каждую букву в любом регистре (строчную или заглавную). Например,
// строки «yEs», «yes», «Yes» и «YES» будут приняты как положительный ответ.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 3
// 4 0
// 1 1 1 1
// 0 0 0 1
// 1 0 1 0
// 1 1 1 1
// 4 3
// 1 0 1 1
// 1 0 0 0
// 0 1 0 1
// 1 1 0 1
// 5 4
// 0 0 0 0 0
// 0 1 1 1 1
// 0 1 0 0 0
// 1 1 1 1 1
// 0 0 0 0 0
// ======================================================================
// Выходные данные
// ======================================================================
// NO
// YES
// YES
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, k;
    cin >> n >> k;
    vector<vector<int>> a(n, vector<int>(n, 0));
    for (auto &i : a)
        for (auto &j : i)
            cin >> j;

    int notgood = 0;
    for (int y = 0; y < n; y++)
        for (int x = 0; x < n; x++)
            if (a[y][x] != a[n - y - 1][n - x - 1])
                notgood++;
    if (notgood / 2 <= k && ((k - notgood / 2) % 2 == 0 || n % 2 != 0))
        cout << "YES\n";
    else
        cout << "NO\n";
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
