// B. Максимальная сумма
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Дан массив a1, a2, …, a_n, в котором все элементы различны.

// Вы должны выполнить ровно k операций с ним. Во время каждой операции вы выполняете
// ровно одно из следующих двух действий (вы самостоятельно выбираете, какое именно):

// - найти два минимальных элемента в массиве и удалить их;
// - найти максимальный элемент в массиве и удалить его.

// Вы должны вычислить максимальную возможную сумму элементов в полученном массиве.

// Входные данные
// Первая строка содержит одно целое число t (1 ≤ t ≤ 10^4) — количество наборов
// входных данных.

// Каждый набор входных данных состоит из двух строк:

// - первая строка содержит два целых числа n и k (3 ≤ n ≤ 2·10^5; 1 ≤ k ≤ 99999; 2k < n)
//   — количество элементов и операций соответственно;
// - вторая строка содержит n целых чисел a1, a2, …, a_n (1 ≤ a_i ≤ 10^9; все a_i
//   различны) — элементы массива.

// Дополнительное ограничение на входные данные: сумма n не превышает 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — максимальную
// возможную сумму элементов в полученном массиве.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 5 1
// 2 5 1 10 6
// 5 2
// 2 5 1 10 6
// 3 1
// 1 2 3
// 6 1
// 15 22 12 10 13 11
// 6 2
// 15 22 12 10 13 11
// 5 1
// 999999996 999999999 999999997 999999998 999999995
// ======================================================================
// Выходные данные
// ======================================================================
// 21
// 11
// 3
// 62
// 46
// 3999999986
// ======================================================================

// Примечание
// В первом наборе входных данных применение первой операции приводит к следующему
// результату:

// - два минимума равны 1 и 2; их удаление оставляет массив [5, 10, 6] с суммой 21;
// - максимум равен 10; его удаление оставляет массив [2, 5, 1, 6] с суммой 14.

// 21 — лучший ответ.

// Во втором наборе входных данных оптимально сначала удалить два минимума, а затем
// максимум.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, k;
    cin >> n >> k;
    vector<int> a(n), pref(n + 1, 0);
    for (auto &i : a)
        cin >> i;

    sort(a.begin(), a.end());
    for (int i = 0; i < n; i++)
        pref[i + 1] = pref[i] + a[i];

    int best_res = 0;
    for (int x = 0; x <= k; x++)
    {
        int r = n - (k - x), l = 2 * x;
        best_res = max(best_res, pref[r] - pref[l]);
    }
    cout << best_res << '\n';
}
// 6
//    0  1  2  3  4  5
//    15 22 12 10 13 11
//    10 11 12 13 15 22
//  0 10 21 33 45 60 82
//  0 1  2  3  4  5  6

//   1 2 5 6 10
// 0 1 3 8 14 24
// 24 - 0 - 8
// 24 - 1 - 14

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
