// D. Фестиваль деревянных и玩具
// ограничение по времени на тест3 секунды
// ограничение по памяти на тест256 мегабайт

// В одном небольшом городке есть мастерская, специализирующаяся на работах по дереву.
// Так как город маленький, в ней работают всего три резчика.

// Скоро в городе планируется фестиваль деревянных игрушек. Работники мастерской хотят
// к нему подготовиться.

// Они знают, что n человек придёт в мастерскую с просьбой сделать деревянную игрушку.
// Люди разные и могут хотеть разные игрушки. Для простоты обозначим паттерн игрушки,
// которую хочет i-й человек, за a_i (1 ≤ a_i ≤ 10^9).

// Каждый из резчиков может заранее выбрать какой-то паттерн x (1 ≤ x ≤ 10^9),
// разные резчики могут выбрать разные паттерны. x — натуральное число. За время
// подготовки к фестивалю резчики идеально отработают технику выполнения игрушки
// выбранного паттерна, что позволит им мгновенно вырезать её из дерева. Чтобы сделать
// игрушку паттерна y резчику, выбравшему паттерн x, понадобится |x − y| времени,
// ведь чем больше игрушка похожа на ту, что он умеет делать мгновенно, тем быстрее
// резчик справится с работой.

// В день фестиваля, когда очередной человек зайдёт в мастерскую с просьбой сделать
// деревянную игрушку, резчики могут выбрать, кто из них примется за работу. При этом
// резчики очень умелые люди и могут одновременно выполнять заказы для разных людей.

// Так как люди не любят ждать, резчики хотят выбрать паттерны для подготовки таким
// образом, чтобы максимальное время ожидания среди всех людей было как можно меньше.

// Выведите наилучшее максимальное время ожидания, которого смогут добиться резчики.

// Входные данные
// В первой строке входных данных содержится целое число t (1 ≤ t ≤ 10^4) — количество
// наборов входных данных в тесте.

// Далее следуют описания наборов.

// В первой строке каждого набора содержится единственное целое число n (1 ≤ n ≤ 2·10^5) —
// количество людей, которые придут в мастерскую.

// Во второй строке каждого набора содержится n целых чисел a1, a2, a3, …, a_n
// (1 ≤ a_i ≤ 10^9) — паттерны игрушек.

// Сумма значений n по всем наборам входных данных не превосходит 2·10^5.

// Выходные данные
// Выведите t чисел, каждое из которых является ответом на соответствующий набор —
// наилучшее максимальное время ожидания, которого смогут добиться резчики.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 6
// 1 7 7 9 9 9
// 6
// 5 4 2 1 30 60
// 9
// 14 19 37 59 1 4 4 98 73
// 1
// 2
// 6
// 3 10 1 17 15 11
// ======================================================================
// Выходные данные
// ======================================================================
// 0
// 2
// 13
// 0
// 1
// ======================================================================

// Примечание
// В первом примере входных данных резчики могут выбрать паттерны 1, 7, 9 для подготовки.

// Во втором примере входных данных резчики могут выбрать паттерны 3, 30, 60 для подготовки.

// В третьем примере входных данных резчики могут выбрать паттерны 14, 50, 85 для подготовки.

#include <bits/stdc++.h>
using namespace std;

#define int long long

bool check(vector<int> &a, int n, int mid)
{
    int r = 0, t = 0;
    int c;
    while (r < n)
    {
        c = a[r] + 2 * mid;
        while (r < n && a[r] <= c)
            r++;
        t++;
    }
    return t <= 3;
}

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;

    sort(a.begin(), a.end());
    // for (auto &i : a)
    //     cout << i << ' ';
    // cout << '\n';

    int l = -1, r = 2e10;
    while (r > l + 1)
    {
        int m = (l + r) / 2;
        if (check(a, n, m))
            r = m;
        else
            l = m;
    }
    cout << r << '\n';

    // for (int i = 0; i + 1 < n; i++)
    //     cout << a[i + 1] - a[i] << ' ';
}

// 2 5 60

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
