// C. Стать максимумом
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вам дан массив целых чисел a длины n.

// Одна операция состоит из:

// - Выбора индекса i такого, что 1 ≤ i ≤ n − 1 и a_i ≤ a_{i+1}.
// - Увеличения a_i на 1.

// Найдите максимально возможное значение max(a1, a2, …, a_n), которое можно получить,
// выполнив эту операцию не более k раз.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 100) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// Первая строка каждого набора входных данных содержит два целых числа n и k
// (2 ≤ n ≤ 1000, 1 ≤ k ≤ 10^8) — длина массива a и максимальное количество операций,
// которое можно выполнить.

// Вторая строка каждого набора входных данных содержит n целых чисел a1, a2, …, a_n
// (1 ≤ a_i ≤ 10^8) — элементы массива a.

// Гарантируется, что сумма n по всем наборам входных данных не превышает 1000.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — максимально возможный
// максимум массива после выполнения не более k операций.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 3 4
// 1 3 3
// 5 6
// 1 3 4 5 1
// 4 13
// 1 1 3 179
// 5 3
// 4 3 2 2 2
// 5 6
// 6 5 4 1 5
// 2 17
// 3 5
// ======================================================================
// Выходные данные
// ======================================================================
// 4
// 7
// 179
// 5
// 7
// 6
// ======================================================================

// Примечание
// В первом наборе входных данных одной возможной оптимальной последовательностью
// операций является: [1, 3, 3] → [2, 3, 3] → [2, 4, 3] → [3, 4, 3] → [4, 4, 3].

// Во втором наборе входных данных одной возможной оптимальной последовательностью
// операций является: [1, 3, 4, 5, 1] → [1, 4, 4, 5, 1] → [1, 5, 4, 5, 1] →
// [1, 5, 5, 5, 1] → [1, 5, 6, 5, 1] → [1, 6, 6, 5, 1] → [1, 7, 6, 5, 1].

#include <bits/stdc++.h>
using namespace std;

#define int long long

bool check(int i, int m, int n, int k, vector<int> &a)
{
    int cst = 0;
    for (int j = i; j < n; j++)
    {
        int r = m - j + i;
        if (!r || a[j] >= r)
            break;
        if (j == n - 1)
            return false;
        if (a[j] < r)
            cst += r - a[j];
        if (cst > k)
            return 0;
    }
    return cst <= k;
}

void solve()
{
    int n, k, mx = 0;
    cin >> n >> k;
    vector<int> a(n);
    for (auto &i : a)
    {
        cin >> i;
        mx = max(mx, i);
    }
    int res = mx;
    for (int i = 0; i < n; i++)
    {
        int l = mx, r = mx + k + 1;
        while (r > l + 1)
        {
            int m = (l + r) / 2;
            if (check(i, m, n, k, a))
            {
                res = max(res, m);
                l = m;
            }
            else
                r = m;
        }
    }
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
