// D. Шарики мороженого
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Тёма решил увлечься приготовлением мороженого. Он достаточно преуспел в этом деле
// и научился хорошо делать мороженое в рожке ровно из двух шариков.

// До увлечения мороженым Тёма увлекался математикой. Поэтому он заинтересовался,
// какое минимальное количество шариков ему нужно иметь, чтобы из них можно было
// приготовить ровно n различных видов мороженого.

// Шарики мороженого бывают разных вкусов: 1, 2, 3, …. Тёма может приготовить
// мороженое из двух шариков любого вкуса (возможно, одинакового).

// Два мороженых считаются различными, если множества вкусов их шариков отличаются.
// Например {1, 2} = {2, 1}, но {1, 1} ≠ {1, 2}.

// Например, имея следующие шарики мороженого: {1, 1, 2}, можно приготовить всего
// два вида мороженого: {1, 1} и {1, 2}.

// Обратите внимание, что Тёме не нужно делать все стаканчики мороженого одновременно.
// Это означает, что он делает стаканчики мороженого независимо друг от друга. Также,
// чтобы сделать следующий стаканчик {x, x} для некоторого x, Тёме нужно иметь как
// минимум 2 шарика типа x.

// Помогите Тёме ответить на этот вопрос. Можно показать, что ответ всегда существует.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке входных
// данных содержится одно целое число t (1 ≤ t ≤ 10^4) — количество наборов входных
// данных. Далее следует описание наборов входных данных.

// В первой строке каждого набора входных данных содержится единственное целое число n
// (1 ≤ n ≤ 10^18) — количество видов мороженого, которое хочет получить Тёма.

// Выходные данные
// Для каждого набора входных данных выведите единственное число — минимальное
// количество шариков, которое необходимо купить Тёме.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 1
// 3
// 6
// 179
// 1000000000000000000
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// 3
// 4
// 27
// 2648956421
// ======================================================================

// Примечание
// В первом примере достаточно иметь следующие типы шариков: {1, 1}. Обратите внимание,
// что множество {1} недостаточно, так как нам нужно как минимум 2 шарика типа 1,
// чтобы сделать такой стаканчик {1, 1}.

// Во втором примере невозможно сделать это с 2 шариками, но это можно сделать
// с помощью следующих шариков: {1, 2, 3}.

// В третьем примере оптимальным ответом является {1, 2, 3, 4}, поэтому мы можем
// получить следующие стаканчики мороженого: {1, 2}, {1, 3}, {1, 4}, {2, 3}, {2, 4},
// {3, 4}.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    int l = 1, r = 1e10;
    while (r > l + 1)
    {
        int m = (l + r) / 2;
        int t = ((m * (m - 1)) / 2);
        if (t > n)
            r = m;
        else
            l = m;
    }
    cout << l + (n - (l * (l - 1)) / 2) << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
