// E. Построение аквариума
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вы любите рыб, поэтому решили построить аквариум. У вас есть кусок коралла,
// состоящий из n колонн, i-я из которых имеет высоту a_i единиц. Затем вы построите
// вокруг коралла аквариум следующим образом:

// - Выберите целое число h ≥ 1 — высоту аквариума. Постройте стены высотой h
//   с обеих сторон аквариума.
// - Затем заполните аквариум водой так, чтобы высота каждой колонны была равна h,
//   если только коралл не выше h; в этом случае в эту колонну вода добавляться
//   не должна.

// Например, с a = [3, 1, 2, 4, 6, 2, 5] и высотой h = 4, вы потратите в общей
// сложности w = 8 единиц воды, как показано на рисунке.

// Вы можете использовать не более x единиц воды для заполнения аквариума,
// но вы хотите построить наибольший возможный аквариум. Какое наибольшее значение h
// вы можете выбрать?

// Входные данные
// Первая строка содержит одно целое число t (1 ≤ t ≤ 10^4) — количество наборов
// входных данных.

// Первая строка каждого набора содержит два положительных целых числа n и x
// (1 ≤ n ≤ 2·10^5; 1 ≤ x ≤ 10^9) — количество колонн коралла и максимальное
// количество воды, которое вы можете использовать.

// Вторая строка каждого набора содержит n целых чисел, разделённых пробелом,
// a_i (1 ≤ a_i ≤ 10^9) — высоты колонн коралла.

// Сумма n по всем наборам входных данных не превышает 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите одно положительное целое число h (h ≥ 1) —
// максимальную высоту аквариума, для заполнения которого вам потребуется не более x
// единиц воды.

// Можно доказать, что при таких ограничениях всегда существует такое значение h.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 7 9
// 3 1 2 4 6 2 5
// 3 10
// 1 1 1
// 4 1
// 1 4 3 4
// 6 1984
// 2 6 5 9 1 8
// 1 1000000000
// 1
// ======================================================================
// Выходные данные
// ======================================================================
// 4
// 4
// 2
// 335
// 1000000001
// ======================================================================

// Примечание
// Первый пример изображён в условии. При h = 4 нам потребуется 8 единиц воды,
// но если увеличить h до 5, нам потребуется 13 единиц воды, что больше, чем x = 9.
// Поэтому оптимальное значение h = 4.

// Во втором примере мы можем выбрать h = 4 и добавить 3 единицы к каждой колонне,
// используя в общей сложности 9 единиц воды. Можно показать, что это оптимально.

// В третьем примере мы можем выбрать h = 2 и использовать всю нашу воду,
// поэтому это оптимально.

#include <bits/stdc++.h>
using namespace std;

#define int long long

bool check(vector<int> &a, int x, int m)
{
    int r = 0;
    for (auto &i : a)
    {
        if (i >= m)
            break;
        r += m - i;
    }
    return r <= x;
}

void solve()
{
    int n, x;
    cin >> n >> x;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;
    sort(a.begin(), a.end());
    int l = 1, r = 1e10;
    while (r > l + 1)
    {
        int m = (l + r) / 2;
        if (check(a, x, m))
            l = m;
        else
            r = m;
    }
    cout << l << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
