// E. Ива и Пав
// ограничение по времени на тест5 секунд
// ограничение по памяти на тест256 мегабайт

// Ива дала Паву массив a из n элементов.

// Пусть f(l, r) = a_l & a_{l+1} & … & a_r (здесь & обозначает побитовое И).

// Обратите внимание, что f(l, r) не определено, если l > r.

// Ива также дала Паву q запросов.

// Каждый запрос состоит из 2 чисел, k и l, и она хочет, чтобы Пав нашёл наибольший
// индекс r (l ≤ r ≤ n), такой что f(l, r) ≥ k.

// Пав хочет решить эту задачу быстро, потому что он не хочет расстроить Иву.
// Он нуждается в вашей помощи.

// Входные данные
// Первая строка содержит одно целое число t (1 ≤ t ≤ 10^4) — количество наборов
// входных данных.

// Первая строка каждого набора содержит одно целое число n (1 ≤ n ≤ 2·10^5) —
// длину массива a.

// Вторая строка каждого набора содержит n целых чисел a1, a2, …, a_n
// (1 ≤ a_i ≤ 10^9) — элементы массива a.

// Третья строка каждого набора содержит одно целое число q (1 ≤ q ≤ 10^5) —
// количество запросов, которые Ива дала Паву.

// Следующие q строк каждого набора содержат по два числа, l и k
// (1 ≤ l ≤ n, 1 ≤ k ≤ 10^9) — левая граница для отрезка и целое число k,
// описанное в условии.

// Гарантируется, что сумма n по всем наборам не превышает 2·10^5.
// Также гарантируется, что сумма q по всем наборам не превышает 2·10^5.

// Выходные данные
// Для каждого запроса выведите максимальный индекс r (l ≤ r ≤ n) такой, что
// a_l & a_{l+1} & … & a_r ≥ k.

// Если такого r не существует, выведите −1.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 3
// 5
// 15 14 17 42 34
// 3
// 1 7
// 2 15
// 4 5
// 5
// 7 5 3 1 7
// 4
// 1 7
// 5 7
// 2 3
// 2 2
// 7
// 19 20 15 12 21 7 11
// 4
// 1 15
// 4 4
// 7 12
// 5 7
// ======================================================================
// Выходные данные
// ======================================================================
// 2 -1 5
// 1 5 2 2
// 2 6 -1 5
// ======================================================================

// Примечание
// В первом наборе примера n = 5, и массив a = [15, 14, 17, 42, 34].

// Первый запрос просит найти наибольший индекс r, такой что f(1, r) ≥ 7.

// f(1, 1) = 15, f(1, 2) = 14, f(1, 3) = 0, f(1, 4) = 0, f(1, 5) = 0,
// поэтому ответ r = 2.

// Второй запрос просит найти f(2, r) ≥ 15. Поскольку такой r не существует,
// ответ −1.

// Третий запрос просит найти f(4, r) ≥ 5. f(4, 4) = 42, f(4, 5) = 34,
// поэтому ответ r = 5.

// Во втором наборе примера n = 5, и массив a = [7, 5, 3, 1, 7].

// Для первого запроса, f(1, r) ≥ 7.

// f(1, 1) = 7, f(1, 2) = 5, f(1, 3) = 1, f(1, 4) = 1, f(1, 5) = 1,
// поэтому ответ на этот запрос 1.

// Для второго запроса, f(5, r) ≥ 7.

// f(5, 5) = 7, поэтому ответ 5.

// Для третьего запроса, f(2, r) ≥ 3.

// f(2, 2) = 5, f(2, 3) = 1, f(2, 4) = 1, f(2, 5) = 1,
// поэтому ответ 2.

#include <bits/stdc++.h>
using namespace std;

// #define int long long

struct SegTree
{
public:
    SegTree(int x, vector<int> &a)
    {
        while (size < x)
            size *= 2;
        tree.assign(2 * size - 1, 0);
        build(a);
    };

    void build(vector<int> &a) { build(a, 0, 0, size); };

    int get(int l, int r) { return get(l, r, 0, 0, size); }

private:
    void build(vector<int> &a, int x, int lx, int rx)
    {
        if (rx - lx == 1)
        {
            if (lx < a.size())
                tree[x] = a[lx];
        }
        else
        {
            int m = (lx + rx) / 2;
            build(a, 2 * x + 1, lx, m);
            build(a, 2 * x + 2, m, rx);
            tree[x] = tree[2 * x + 1] & tree[2 * x + 2];
        }
    }

    int get(int l, int r, int x, int lx, int rx)
    {
        if (lx >= l && rx <= r)
            return tree[x];
        if (rx <= l || lx >= r)
            return (1LL << 31) - 1;

        int m = (lx + rx) / 2;
        int r1 = get(l, r, 2 * x + 1, lx, m), r2 = get(l, r, 2 * x + 2, m, rx);
        return r1 & r2;
    }

    vector<unsigned int> tree;
    int size = 1;
};

void solve()
{
    int n, q;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;
    SegTree st(n, a);
    cin >> q;

    while (q--)
    {
        int res = -1, l, k;
        cin >> l >> k;
        l--;

        res = (a[l] >= k ? l + 1 : -1);
        int rx = n + 1, lx = l;
        while (rx > lx + 1)
        {
            int m = (lx + rx) / 2;
            if (st.get(l, m) >= k)
            {
                lx = m;
                res = max(res, m);
            }
            else
                rx = m;
        }
        cout << res << ' ';
    }
    cout << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
