// C. Чередуй!
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Дана двоичная строка s. Двоичная строка — это строка, состоящая из символов 0 и/или 1.

// Вы можете производить следующую операцию со строкой s любое количество раз (даже ноль):

// - выбрать целое число i такое, что 1 ≤ i ≤ |s|, затем удалить символ s_i.

// Вам нужно сделать строку s чередующейся, т.е. после выполнения операций каждые два
// соседних символа в s должны быть разными.

// Ваша задача — вычислить два значения:

// - минимальное количество операций, необходимых для того, чтобы сделать строку s
//   чередующейся;
// - количество различных кратчайших последовательностей операций, которые делают строку s
//   чередующейся. Две последовательности операций считаются различными, если хотя бы
//   в одной операции выбранное целое число i отличается в этих двух последовательностях.

// Входные данные
// Первая строка содержит одно целое число t (1 ≤ t ≤ 10^4) — количество наборов
// входных данных.

// Каждый набор входных данных состоит из одной строки, содержащей строку s
// (1 ≤ |s| ≤ 2·10^5). Строка s состоит только из символов 0 и/или 1.

// Дополнительное ограничение на входные данные:

// - суммарная длина строк s по всем наборам входных данных не превышает 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите два целых числа: минимальное количество
// операций, которые вам нужно выполнить, и количество различных кратчайших
// последовательностей операций. Поскольку второе число может быть большим,
// выведите его остаток по модулю 998244353.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 3
// 10010
// 111
// 0101
// ======================================================================
// Выходные данные
// ======================================================================
// 1 2
// 2 6
// 0 1
// ======================================================================

// Примечание
// В первом наборе входных данных примера кратчайшими последовательностями операций
// являются:

// - [2] (удалить 2-й символ);
// - [3] (удалить 3-й символ).

// Во втором наборе входных данных примера кратчайшими последовательностями операций
// являются:

// - [2, 1] (удалить 2-й символ, затем удалить 1-й символ);
// - [2, 2];
// - [1, 1];
// - [1, 2];
// - [3, 1];
// - [3, 2].

// В третьем наборе входных данных примера единственной кратчайшей последовательностью
// операций является [] (пустая последовательность).

#include <bits/stdc++.h>
using namespace std;

#define int long long

const int MOD = 998244353;

void solve(vector<int> &faa)
{
    string s;
    cin >> s;
    vector<int> a(s.size(), 0);
    for (int i = 1; i < s.size(); i++)
    {
        if (s[i] == s[i - 1])
            a[i] = a[i - 1] + 1;
        else
            a[i] = 0;
    }
    int res1 = 0, res2 = 1;
    for (int i = 0; i < s.size(); i++)
    {
        if (i + 1 == s.size() || (i + 1 < s.size() && a[i + 1] == 0))
        {
            res1 += a[i];
            res2 = (res2 * (a[i] + 1)) % MOD;
        }
    }

    cout << res1 << ' ' << (res2 * faa[res1]) % MOD << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    vector<int> faa(2e5 + 1, 1);
    for (int i = 2; i <= 2e5; i++)
        faa[i] = faa[i - 1] * i % MOD;

    while (t--)
    {
        solve(faa);
    }
    return 0;
}
