// A. Циншань любит строки 2
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// У Циншань есть строка s, которая содержит только 0 и 1.

// Строка a длины k является хорошей тогда и только тогда, когда

// a_i ≠ a_{k-i+1} для всех i = 1, 2, …, k.

// Например, 10, 1010, 111000 — хорошие строки, а 11, 101, 001, 001100 — плохие.

// Циншань хочет сделать s хорошей. Для этого она может проделать следующую операцию
// не более 300 раз (возможно, ноль):

// - вставить 01 в любое место строки s (получив новую строку s).

// Скажите, возможно ли сделать s хорошей. Если это возможно, то приведите
// последовательность операций, которая делает строку s хорошей.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 100) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// Первая строка каждого набора входных данных содержит единственное целое число n
// (1 ≤ n ≤ 100) — длину строки s соответственно.

// Вторая строка каждого набора входных данных содержит строку s длины n.

// Гарантируется, что s состоит только из 0 и 1.

// Выходные данные
// Для каждого набора входных данных, если невозможно сделать s хорошей, выведите −1.

// В противном случае в первой строке выведите p (0 ≤ p ≤ 300) — количество операций.

// Затем выведите p целых чисел во второй строке. Целое число i должно быть индексом x_i
// (0 ≤ x_i ≤ n + 2i − 2) — позицией, в которую необходимо вставить 01 в текущем s.
// Если x_i = 0, то 01 вставляется в начало s. В противном случае 01 вставляется сразу
// после x_i-го символа s.

// Можно показать, что при данных ограничениях, если ответ существует, то всегда
// найдётся ответ, требующий не более 300 операций.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 2
// 01
// 3
// 000
// 4
// 1111
// 6
// 001110
// 10
// 0111001100
// 3
// 001
// ======================================================================
// Выходные данные
// ======================================================================
// 0

// -1
// -1
// 2
// 6 7
// 1
// 10
// -1
// ======================================================================

// Примечание
// В первом наборе входных данных можно выполнить ноль операций и получить s = 01,
// что является хорошей строкой.

// Другим правильным решением является выполнение одной операции: (вставленная 01
// подчёркнута)

// 0011

// получаем s = 0011, что является хорошей строкой.

// Во втором и третьем наборах входных данных сделать s хорошей невозможно.

// В четвёртом наборе входных данных можно выполнить две операции:

// 00111001
// 0011100011

// и получить s = 0011100011, что является хорошей строкой.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    string s;
    cin >> n >> s;
    vector<int> res;
    list<int> lst;
    int cnt = 0;
    for (auto &i : s)
    {
        cnt += (i == '0' ? 1 : -1);
        lst.push_back(i - '0');
    }
    if (cnt)
    {
        cout << "-1\n";
        return;
    }
    int d = 0;
    bool ok = true;
    while (!lst.empty())
    {
        int t = lst.back() + lst.front();
        if (t == 1)
        {
            d++;
            lst.pop_back();
            lst.pop_front();
        }
        else if (t == 0)
        {
            ok = false;
            res.push_back(n - d);
            lst.push_back(0);
            lst.push_back(1);
            n += 2;
        }
        else
        {
            ok = false;
            res.push_back(d);
            lst.push_front(1);
            lst.push_front(0);
            n += 2;
        }
    }
    if (ok)
        cout << "0\n";
    else
        cout << res.size() << '\n';
    for (auto &i : res)
        cout << i << ' ';
    cout << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
