// C. Ярик и массив
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Подотрезок — это непрерывная часть массива.

// Ярик недавно нашёл массив a из n элементов, и ему стало очень интересно найти
// сумму непустого подотрезка с максимальной суммой. Но Ярик не любит числа одной
// чётности, стоящие рядом, так что у подотрезка, который он выберет, чётности
// соседних элементов должны различаться.

// Например, массив [1, 2, 3] подойдёт, но [1, 2, 4] не подойдёт, так как 2 и 4 —
// чётные числа и стоят рядом.

// Вам нужно помочь Ярику и вывести максимальную сумму такого подотрезка.

// Входные данные
// Первая строка содержит одно целое число t (1 ≤ t ≤ 10^4) — количество наборов
// входных данных. Далее следуют описания этих наборов.

// В первой строке каждого набора дано одно целое число n (1 ≤ n ≤ 2·10^5) —
// длина массива.

// Во второй строке каждого набора даны n целых чисел a1, a2, …, a_n (−10^3 ≤ a_i ≤ 10^3) —
// элементы массива.

// Гарантируется, что сумма n по всем наборам входных данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора данных выведите одно число — ответ на задачу.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 7
// 5
// 1 2 3 4 5
// 4
// 9 9 8 8
// 6
// -1 4 -1 0 5 -4
// 4
// -1 2 4 -3
// 1
// -1000
// 3
// 101 -99 101
// 20
// -10 5 -8 10 6 -10 7 9 -2 -6 7 2 -4 6 -1 7 -6 -7 4 1
// ======================================================================
// Выходные данные
// ======================================================================
// 15
// 17
// 8
// 4
// -1000
// 101
// 10
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;

    vector<int> dp(n, -1e4), pref(n + 1, 0);
    for (int i = 0; i < n; i++)
        pref[i + 1] = pref[i] + a[i];
    int l = 0, min_val = 1e8, res = -1e8;
    for (int r = 0; r < n; r++)
    {
        if (r > 0 && (a[r - 1] + a[r]) % 2 == 0)
        {
            l = r;
            min_val = 1e8;
        }
        min_val = min(min_val, pref[r]);
        res = max(res, pref[r + 1] - min_val);
    }
    // for (auto &i : dp)
    //     cout << i << ' ';
    // cout << '\n';
    // cout << *max_element(dp.begin(), dp.end()) << '\n';
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
// 0 -1 3 2 2 7 3