// C. Игра с массивом
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вам дан массив a из n целых положительных чисел. За одну операцию вы должны выбрать
// некоторую пару (i, j) такую, что 1 ≤ i < j ≤ |a|, и добавить |a_i − a_j| к концу a
// (то есть увеличить n на 1 и сделать новый элемент a_n равным |a_i − a_j|).
// Ваша задача — минимизировать и вывести минимальный элемент a после выполнения k операций.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 1000) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// Первая строка каждого набора входных данных содержит два целых числа n и k
// (2 ≤ n ≤ 2·10^3, 1 ≤ k ≤ 10^9) — длину массива и количество операций,
// которое необходимо выполнить.

// Вторая строка каждого набора входных данных содержит n целых чисел a1, a2, …, a_n
// (1 ≤ a_i ≤ 10^18) — элементы массива a.

// Гарантируется, что сумма n^2 по всем наборам входных данных не превосходит 4·10^6.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — наименьшее возможное
// значение минимума массива a после выполнения k операций.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 5 2
// 3 9 7 15 1
// 4 3
// 7 4 15 12
// 6 2
// 42 47 50 54 62 79
// 2 1
// 500000000000000000 1000000000000000000
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 0
// 3
// 500000000000000000
// ======================================================================

// Примечание
// В первом наборе входных данных после любых k = 2 операций минимальное значение a
// будет равно 1.

// Во втором наборе входных данных оптимальная стратегия состоит в том, чтобы сначала
// выбрать i = 1, j = 2 и добавить |a1 − a2| = 3 к концу a, получив a = [7, 4, 15, 12, 3].
// Затем выбрать i = 3, j = 4 и добавить |a3 − a4| = 3 к концу a, получив
// a = [7, 4, 15, 12, 3, 3]. В последней операции выбрать i = 5, j = 6 и добавить
// |a5 − a6| = 0 в конец a. Тогда минимальный элемент a станет равным 0.

// В третьем наборе входных данных оптимальная стратегия состоит в том, чтобы сначала
// выбрать i = 2, j = 3 и добавить |a2 − a3| = 3 к концу a. Любая вторая операция
// всё равно не приведёт к тому, чтобы минимальное значение a стало меньше 3.
#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, k;
    cin >> n >> k;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;
    if (k >= 3)
        cout << "0\n";
    else
    {
        sort(a.begin(), a.end());
        int res = a[0];
        for (int i = 0; i < n - 1; i++)
            res = min(res, a[i + 1] - a[i]);

        if (k == 1)
        {
            cout << res << '\n';
            return;
        }
        for (int i = 0; i < n; i++)
        {
            for (int j = i + 1; j < n; j++)
            {
                int d = a[j] - a[i];

                auto it = lower_bound(a.begin(), a.end(), d);

                if (it != a.end())
                    res = min(res, *it - d);
                if (it != a.begin())
                    res = min(res, d - *(it - 1));
            }
        }
        cout << res << '\n';
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
