// C. Удаление некрасивых пар
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Влад нашёл строку s из n строчных латинских букв, и он хочет сделать её как можно
// короче.

// Для этого он может любое число раз удалять из s любые два соседних символа, если
// они различны. Например, если s = "racoon", то удалив одну пару символов, он может
// получить строку "coon", "roon", "raon" и "raco", но не может получить "racn"
// (потому что удалённые буквы были одинаковы) или "rcon" (потому что удалённые буквы
// не были соседними).

// Какой минимальной длины может добиться Влад, применив любое число удалений?

// Входные данные
// В первой строке входных данных содержится одно целое число t (1 ≤ t ≤ 10^4) —
// количество наборов входных данных. Далее следуют описания наборов.

// Первая строка каждого набора содержит одно целое число n (1 ≤ n ≤ 2·10^5) —
// длину строки s.

// Вторая строка каждого набора содержит строку s из n строчных латинских букв.

// Гарантируется, что сумма n по всем наборам входных данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора выведите единственное число — минимальную длину строки s
// после удаления пар соседних символов, значения которых различны.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 10
// 4
// aabc
// 5
// abaca
// 10
// avbvvcvvvd
// 7
// abcdefg
// 5
// dabbb
// 8
// aacebeaa
// 7
// bbbbacc
// 6
// dacfcc
// 6
// fdfcdc
// 9
// dbdcfbbdc
// ======================================================================
// Выходные данные
// ======================================================================
// 0
// 1
// 2
// 1
// 1
// 0
// 1
// 0
// 0
// 1
// ======================================================================

// Примечание
// В первом наборе выходных данных примера нужно действовать следующим образом:
// "aabc" → "ac" → "". Обратите внимание, что при другом порядке удалений строка
// не станет пустой.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    string s;
    cin >> n >> s;
    int mx = 0;
    unordered_map<char, int> m;
    for (auto &i : s)
    {
        m[i]++;
        mx = max(mx, m[i]);
    }
    if (mx == s.size())
    {
        cout << mx << '\n';
        return;
    }
    if (mx * 2 > s.size() + s.size() % 2)
    {
        cout << mx - (n - mx) << '\n';
        return;
    }
    cout << s.size() % 2 << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
