// D. Прыжки по отрезкам
// ограничение по времени на тест5 секунд
// ограничение по памяти на тест256 мегабайт

// Поликарп разрабатывает уровень для игры. Уровень состоит из n отрезков на числовой
// прямой, i-й отрезок начинается в точке с координатой l_i и заканчивается в точке
// с координатой r_i.

// Игрок начинает уровень в точке с координатой 0. За один ход он может переместиться
// на любую точку, расстояние до которой не больше k. После своего i-го хода игрок
// должен оказаться в i-м отрезке, то есть в такой координате x, что l_i ≤ x ≤ r_i.
// То есть:

// - После первого хода он должен оказаться внутри первого отрезка (от l1 до r1);
// - После второго хода он должен оказаться внутри второго отрезка (от l2 до r2);
// - ...
// - После n-го хода он должен оказаться внутри n-го отрезка (от l_n до r_n).

// Уровень считается пройденным, если игрок добрался до n-го отрезка, следуя правилам,
// описанным выше. Немного подумав, Поликарп понял, что при некоторых k пройти уровень
// невозможно.

// Поликарп не хочет, чтобы уровень был слишком простым, поэтому просит вас определить
// минимальное целое число k, при котором его возможно пройти.

// Входные данные
// Первая строка содержит одно целое число t (1 ≤ t ≤ 10^4) — количество наборов
// входных данных. Далее следуют описания наборов.

// Первая строка каждого набора содержит одно целое число n (1 ≤ n ≤ 2·10^5) —
// количество отрезков на уровне.

// Далее следуют n строк, i-я из которых содержит два числа l_i и r_i (0 ≤ l_i ≤ r_i ≤ 10^9) —
// границы i-го отрезка. Отрезки могут пересекаться.

// Гарантируется, что сумма n по всем наборам входных данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите единственное целое число — минимальное
// целое k, при котором возможно пройти уровень.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 5
// 1 5
// 3 4
// 5 6
// 8 10
// 0 1
// 3
// 0 2
// 0 1
// 0 3
// 3
// 3 8
// 10 18
// 6 11
// 4
// 10 20
// 0 5
// 15 17
// 2 2
// ======================================================================
// Выходные данные
// ======================================================================
// 7
// 0
// 5
// 13
// ======================================================================

// Примечание
// В третьем примере игрок может сделать следующие ходы:

// - Переместиться из точки 0 в точку 5 (3 ≤ 5 ≤ 8);
// - Переместиться из точки 5 в точку 10 (10 ≤ 10 ≤ 18);
// - Переместиться из точки 10 в точку 7 (6 ≤ 7 ≤ 11).

// Обратите внимание, что последним ходом игрок мог не перемещаться и всё равно
// пройти уровень.

#include <bits/stdc++.h>
using namespace std;

#define int long long

bool check(vector<pair<int, int>> &a, int m, int n)
{
    int cur_pos_l = 0, cur_pos_r = 0;
    for (int i = 0; i < n; i++)
    {
        pair<int, int> k = a[i];
        cur_pos_l = max(cur_pos_l - m, k.first);
        cur_pos_r = min(cur_pos_r + m, k.second);
        if (cur_pos_l > cur_pos_r)
        {
            return false;
        }
    }

    return true;
}

void solve()
{
    int n;
    cin >> n;
    vector<pair<int, int>> a(n);
    for (auto &i : a)
        cin >> i.first >> i.second;
    int l = -1, r = 1e9;
    while (r > l + 1)
    {
        int m = (l + r) / 2;
        if (check(a, m, n))
            r = m;
        else
            l = m;
    }
    cout << r << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
