// A. Ладья
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Как вы, вероятно, знаете, шахматы — это игра, которая ведётся на доске с 64 клетками,
// расположенными в сетке 8×8. Столбцы этой доски обозначены буквами от a до h,
// а строки — цифрами от 1 до 8. Каждая клетка описывается столбцом и строкой,
// к которым она принадлежит.

// Ладья — это фигура в игре шахматы. За ход она может перемещаться на любое ненулевое
// количество клеток по горизонтали или вертикали. Ваша задача — найти все возможные
// ходы для ладьи на пустой шахматной доске.

// Входные данные
// Первая строка входных данных содержит одно целое число t (1 ≤ t ≤ 64) — количество
// наборов входных данных. Далее следует описание наборов входных данных.

// Каждый набор входных данных содержит одну строку из двух символов — описание клетки,
// на которой расположена ладья. Первый символ — это буква от a до h, обозначение столбца,
// и второй символ — это цифра от 1 до 8, обозначение строки.

// Одна и та же позиция может встречаться в более чем одном наборе входных данных.

// Выходные данные
// Для каждого набора входных данных выведите описания всех клеток, куда может пойти
// ладья, в том же формате, что и во входных данных.

// В ответе для каждого набора входных данных вы можете выводить клетки в любом порядке.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 1
// d5
// ======================================================================
// Выходные данные
// ======================================================================
// d1
// d2
// b5
// g5
// h5
// d3
// e5
// f5
// d8
// a5
// d6
// d7
// c5
// d4
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    string s;
    cin >> s;
    for (int i = 1; i <= 8; i++)
    {
        if (s[1] - '0' == i)
            continue;
        cout << s[0] << i << '\n';
    }
    for (char i = 'a'; i <= 'h'; i++)
    {
        if (s[0] == i)
            continue;
        cout << i << s[1] << '\n';
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
