// F. Приветствия
// ограничение по времени на тест5 секунд
// ограничение по памяти на тест256 мегабайт

// На числовой прямой находятся n человек; i-й человек находится в точке a_i
// и хочет попасть в точку b_i. Для каждого человека a_i < b_i, и начальные и конечные
// точки всех людей различны. (То есть все 2n чисел a1, a2, …, a_n, b1, b2, …, b_n
// различны.)

// Все люди начнут двигаться одновременно со скоростью 1 единица в секунду, пока
// не достигнут своей конечной точки b_i. Когда два человека встречаются в одной
// точке, они поздороваются один раз. Сколько будет приветствий?

// Обратите внимание, что человек всё ещё может поздороваться с другими людьми,
// даже если они достигли своей конечной точки.

// Входные данные
// Первая строка ввода содержит одно целое число t (1 ≤ t ≤ 10^4) — количество
// наборов входных данных. Затем следуют описания наборов входных данных.

// Первая строка каждого набора входных данных содержит одно целое число n
// (1 ≤ n ≤ 2·10^5) — количество людей.

// Затем следуют n строк, i-я из которых содержит два целых числа a_i и b_i
// (−10^9 ≤ a_i < b_i ≤ 10^9) — начальные и конечные позиции каждого человека.

// Для каждого набора входных данных все 2n чисел a1, a2, …, a_n, b1, b2, …, b_n
// различны.

// Сумма n по всем наборам входных данных не превышает 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число, обозначающее
// количество приветствий, которые произойдут.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 2
// 2 3
// 1 4
// 6
// 2 6
// 3 9
// 4 5
// 1 8
// 7 10
// -2 100
// 4
// -10 10
// -5 5
// -12 12
// -13 13
// 5
// -4 9
// -2 5
// 3 4
// 6 7
// 8 10
// 4
// 1 2
// 3 4
// 5 6
// 7 8
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 9
// 6
// 4
// 0
// ======================================================================

// Примечание
// В первом наборе входных данных два человека встретятся в точке 3
// и поздороваются.
#include <bits/stdc++.h>
using namespace std;

#define int long long

struct SegTree
{
    void init(int n)
    {
        size = 1;
        while (size < n)
            size *= 2;
        tree.assign(2 * size - 1, 0);
    }
    void set(int i, int v)
    {
        set(i, v, 0, 0, size);
    }

    int get(int l, int r) { return get(l, r, 0, 0, size); }

private:
    vector<int> tree;
    int size = 1;

    void set(int i, int v, int x, int lx, int rx)
    {
        if (rx - lx == 1)
        {
            tree[x] += v;
            return;
        }
        int m = (rx + lx) / 2;
        if (i < m)
            set(i, v, 2 * x + 1, lx, m);
        else
            set(i, v, 2 * x + 2, m, rx);

        tree[x] = tree[2 * x + 1] + tree[2 * x + 2];
    }

    int get(int l, int r, int x, int lx, int rx)
    {
        if (lx >= l && rx <= r)
            return tree[x];
        if (lx >= r || l >= rx)
            return 0;
        int m = (rx + lx) / 2;
        int r1 = get(l, r, 2 * x + 1, lx, m), r2 = get(l, r, 2 * x + 2, m, rx);
        return r1 + r2;
    }
};

void solve()
{
    int n;
    cin >> n;
    vector<pair<int, int>> a(n);
    vector<int> allb(n);

    for (int i = 0; i < n; i++)
    {
        cin >> a[i].first >> a[i].second;
        allb[i] = a[i].second;
    }

    sort(a.begin(), a.end());
    sort(allb.begin(), allb.end());
    allb.erase(unique(allb.begin(), allb.end()), allb.end());

    auto get_compressed = [&](int val)
    {
        return lower_bound(allb.begin(), allb.end(), val) - allb.begin();
    };

    int sz = allb.size();
    SegTree st;
    st.init(sz + 1);
    int res = 0;

    for (int i = 0; i < n; i++)
    {
        int cb = get_compressed(a[i].second);
        res += st.get(cb + 1, sz);
        st.set(cb, 1);
    }
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
