// E. Романтические стаканы
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// У Юлии есть n стаканов, расположенных в линию. В i-м стакане a_i единиц сока.
// Юлия пьёт только из стаканов с нечётными номерами, в то время как её партнёр пьёт
// только из стаканов с чётными номерами.

// Чтобы произвести впечатление на своего партнёра, Юлия хочет найти непрерывный
// подмассив этих стаканов, такой, что у Юлии и её партнёра будет одинаковое количество
// сока, если учитывать только стаканы в этом подмассиве. Пожалуйста, помогите ей в этом.

// Формально, определите, существуют ли два индекса l, r такие, что 1 ≤ l ≤ r ≤ n,
// и a_l + a_{l+2} + a_{l+4} + … + a_r = a_{l+1} + a_{l+3} + … + a_{r-1},
// если l и r имеют одинаковую чётность, и a_l + a_{l+2} + … + a_{r-1} = a_{l+1} + a_{l+3} + … + a_r
// в противном случае.

// Входные данные
// Первая строка содержит одно целое число t (1 ≤ t ≤ 10^4) — количество наборов
// входных данных.

// Первая строка каждого набора содержит одно целое число n (1 ≤ n ≤ 2·10^5) —
// общее количество стаканов.

// Вторая строка каждого набора содержит n целых чисел a1, a2, …, a_n (1 ≤ a_i ≤ 10^9) —
// количество сока в каждом стакане.

// Сумма n по всем тестам не превышает 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите «YES», если существует подмассив,
// удовлетворяющий условию, и «NO» в противном случае.

// Вы можете вывести ответ в любом регистре (например, строки «yEs», «yes», «Yes»
// и «YES» будут распознаны как положительный ответ).

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 3
// 1 3 2
// 6
// 1 1 1 1 1 1
// 10
// 1 6 9 8 55 3 14 2 7 2
// 8
// 1 2 11 4 1 5 1 2
// 6
// 2 6 1 5 7 8
// 9
// 2 5 10 4 4 9 6 7 8
// ======================================================================
// Выходные данные
// ======================================================================
// YES
// YES
// NO
// YES
// NO
// YES
// ======================================================================

// Примечание
// В первом тесте Юлия может выбрать l = 1 и r = 3. Тогда она выпьет a1 + a3 = 1 + 2 = 3
// единицы, а её партнёр выпьет a2 = 3 единицы сока.

// Во втором тесте Юлия может выбрать l = 2 и r = 5. Тогда она выпьет a3 + a5 = 1 + 1 = 2
// единицы, а её партнёр выпьет a2 + a4 = 1 + 1 = 2 единицы сока.

// В третьем тесте ни один такой непрерывный подмассив не подходит.

// В четвёртом тесте Юлия может выбрать l = 2 и r = 8. Тогда она выпьет
// a3 + a5 + a7 = 11 + 1 + 1 = 13 единиц, а её партнёр выпьет
// a2 + a4 + a6 + a8 = 2 + 4 + 5 + 2 = 13 единиц сока.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;

    int s = 0;
    set<int> m;
    for (int i = 0; i < n; i++)
    {
        s += a[i] * (i % 2 == 0 ? 1 : -1);
        if (m.contains(s) || s == 0)
        {
            cout << "YES\n";
            return;
        }
        m.insert(s);
    }
    cout << "NO\n";

    // for (auto &i : a)
    //     cout << i << ' ';
    // cout << '\n';
    // for (auto &j : pref)
    //     cout << j << ' ';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    cout.tie(0);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
