// C. Разбиение массива
// ограничение по времени на тест3 секунды
// ограничение по памяти на тест256 мегабайт

// У Аллена есть массив a1, a2, …, a_n. Для каждого положительного целого числа k,
// которое является делителем n, Аллен делает следующее:

// Он разбивает массив на n/k непересекающихся подмассивов длины k. Другими словами,
// он разбивает массив на следующие подмассивы:
// [a1, a2, …, a_k], [a_{k+1}, a_{k+2}, …, a_{2k}], …, [a_{n−k+1}, a_{n−k+2}, …, a_n].

// Аллен получает одно очко, если существует некоторое положительное целое число m
// (m ≥ 2), такое что, если он заменит каждый элемент массива на его остаток при делении
// на m, тогда все подмассивы будут одинаковыми.

// Помогите Аллену найти количество очков, которое он заработает.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. Первая строка содержит
// одно целое число t (1 ≤ t ≤ 10^4) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// Первая строка каждого набора входных данных содержит одно целое число n
// (1 ≤ n ≤ 2·10^5) — длина массива a.

// Вторая строка каждого набора входных данных содержит n целых чисел
// a1, a2, …, a_n (1 ≤ a_i ≤ n) — элементы массива a.

// Гарантируется, что сумма n по всем наборам входных данных не превышает 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — количество очков,
// которое заработает Аллен.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 8
// 4
// 1 2 1 4
// 3
// 1 2 3
// 5
// 1 1 1 1 1
// 6
// 1 3 1 1 3 1
// 6
// 6 2 6 2 2 2
// 6
// 2 6 3 6 6 6
// 10
// 1 7 5 1 4 3 1 3 1 4
// 1
// 1
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// 1
// 2
// 4
// 4
// 1
// 2
// 1
// ======================================================================

// Примечание
// В первом наборе входных данных k = 2 приносит очко, так как Аллен может выбрать
// m = 2, и оба подмассива будут равны [1, 0]. k = 4 также приносит очко, так как
// независимо от выбора m у Аллена будет только один подмассив, и следовательно,
// все подмассивы будут равны.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;
    int res = 0;
    for (int i = 1; i <= n; i++)
    {
        if (n % i == 0)
        {
            int g = 0;
            for (int k = 0; i + k < n; k++)
                g = __gcd(g, abs(a[i + k] - a[k]));
            res += g != 1;
        }
    }
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
