// C. Влад и сумма сумм цифр
// ограничение по времени на тест0.5 секунд
// ограничение по памяти на тест256 мегабайт

// Обратите внимание, что ограничение по времени в этой задаче составляет всего 0.5 секунды на тест.

// Владислав записал целые числа от 1 до n, включительно, на доске. Затем он заменил
// каждое число суммой его цифр.

// Какова сумма чисел на доске сейчас?

// Например, если n = 12, то изначально числа на доске равны:
// 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12.
// Затем после замены числа становятся равными:
// 1, 2, 3, 4, 5, 6, 7, 8, 9, 1, 2, 3.
// Сумма этих чисел равна 1 + 2 + 3 + 4 + 5 + 6 + 7 + 8 + 9 + 1 + 2 + 3 = 51.
// Таким образом, для n = 12 ответ равен 51.

// Входные данные
// Первая строка содержит целое число t (1 ≤ t ≤ 10^4) — количество наборов входных данных.

// Единственная строка каждого набора входных данных содержит одно целое число n
// (1 ≤ n ≤ 2·10^5) — наибольшее число, записанное Владиславом.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — сумму чисел в конце процесса.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 7
// 12
// 1
// 2
// 3
// 1434
// 2024
// 200000
// ======================================================================
// Выходные данные
// ======================================================================
// 51
// 1
// 3
// 6
// 18465
// 28170
// 4600002
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve(vector<int> &pref)
{
    int n;
    cin >> n;
    cout << pref[n] << '\n';
}

int calc(int x)
{
    int res = 0;
    for (int t = x; t; t /= 10)
        res += t % 10;
    return res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    vector<int> pref(2 * 1e5 + 1, 0);

    for (int i = 1; i < 2 * 1e5 + 1; i++)
        pref[i] = pref[i - 1] + calc(i);

    while (t--)
    {
        solve(pref);
    }
    return 0;
}