// D. Найди различные!
// ограничение по времени на тест5 секунд
// ограничение по памяти на тест256 мегабайт

// Вам дан массив a из n целых чисел, а также q запросов.

// Каждый запрос представлен двумя числами l и r (1 ≤ l ≤ r ≤ n). Ваша задача для
// каждого запроса найти такие два индекса i и j (или сообщить, что их не существует), что:

// - l ≤ i ≤ r;
// - l ≤ j ≤ r;
// - a_i ≠ a_j.

// Иными словами, вам нужно для каждого запроса найти пару различных элементов среди
// a_l, a_{l+1}, …, a_r или сообщить, что такой пары не существует.

// Входные данные
// Первая строка входных данных содержит одно целое число t (1 ≤ t ≤ 10^4) — количество
// наборов входных данных. Далее следуют описания наборов.

// Первая строка каждого набора содержит одно целое число n (2 ≤ n ≤ 2·10^5) — длину
// массива a.

// Вторая строка каждого набора содержит n целых чисел a1, a2, …, a_n (1 ≤ a_i ≤ 10^6) —
// элементы массива a.

// Третья строка каждого набора содержит одно целое число q (1 ≤ q ≤ 2·10^5) —
// количество запросов.

// Следующие q строк содержат по два целых числа l и r (1 ≤ l < r ≤ n) — границы запроса.

// Гарантируется, что сумма значений n по всем наборам не превышает 2·10^5. Аналогично,
// сумма значений q по всем наборам не превышает 2·10^5.

// Выходные данные
// Для каждого запроса выведите два числа: искомые i и j (l ≤ i, j ≤ r), для которых
// a_i ≠ a_j. Если такой пары не существует, выведите i = −1 и j = −1.

// Вы можете разделять выводы для наборов входных данных пустыми строками. Это не
// является обязательным требованием.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 5
// 1 1 2 1 1
// 3
// 1 5
// 1 2
// 1 3
// 6
// 30 20 20 10 10 20
// 5
// 1 2
// 2 3
// 2 4
// 2 6
// 3 5
// 4
// 5 2 3 4
// 4
// 1 2
// 1 4
// 2 3
// 2 4
// 5
// 1 4 3 2 4
// 5
// 1 5
// 2 4
// 3 4
// 3 5
// 4 5
// 5
// 2 3 1 4 2
// 7
// 1 2
// 1 4
// 1 5
// 2 4
// 2 5
// 3 5
// 4 5
// ======================================================================
// Выходные данные
// ======================================================================
// 2 3
// -1 -1
// 1 3

// 2 1
// -1 -1
// 4 2
// 4 6
// 5 3

// 1 2
// 1 2
// 2 3
// 3 2

// 1 3
// 2 4
// 3 4
// 5 3
// 5 4

// 1 2
// 4 2
// 1 3
// 2 3
// 3 2
// 5 4
// 5 4
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, q;
    cin >> n;
    vector<int> a(n), p(n, -1);
    for (auto &i : a)
        cin >> i;
    for (int i = 1; i < n; i++)
    {
        p[i] = p[i - 1];
        if (a[i] != a[i - 1])
            p[i] = i - 1;
    }

    cin >> q;
    while (q--)
    {
        int l, r;
        cin >> l >> r;
        r--;
        l--;
        if (p[r] >= l)
            cout << p[r] + 1 << ' ' << r + 1 << '\n';
        else
            cout << "-1 -1\n";
    }
    cout << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
