// B. Уравняй
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// У Васи есть два хобби — прибавлять перестановки† к массивам и находить самый часто
// встречающийся элемент. Недавно он нашёл массив a и решил узнать, какое максимальное
// количество элементов, равных одинаковому числу, в массиве a он может получить после
// того, как прибавит какую-то перестановку к массиву a.

// Более формально, Вася может выбрать какую-то перестановку p1, p2, p3, …, p_n длины n,
// после чего изменить элементы массива a по правилу a_i := a_i + p_i. После этого Вася
// считает, сколько раз каждое число встречается в массиве a, и берёт максимум по этим
// значениям. Вам нужно определить, какое максимальное значение он может получить.

// † Перестановкой длины n является массив, состоящий из n различных целых чисел от 1
// до n в произвольном порядке. Например, [2, 3, 1, 5, 4] — перестановка, но [1, 2, 2]
// не перестановка (2 встречается в массиве дважды) и [1, 3, 4] тоже не перестановка
// (n = 3, но в массиве встречается 4).

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. Первая строка содержит
// одно целое число t (1 ≤ t ≤ 2·10^4) — количество наборов входных данных. Далее
// следует описание наборов входных данных.

// Первая строка каждого набора входных данных содержит одно целое число n
// (1 ≤ n ≤ 2·10^5) — длина массива a.

// Вторая строка каждого набора входных данных содержит n целых чисел a1, a2, …, a_n
// (1 ≤ a_i ≤ 10^9) — элементы массива a.

// Гарантируется, что сумма n по всем наборам входных данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите одно число — максимальное количество
// элементов, равных одинаковому числу, после операции прибавления перестановки.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 7
// 2
// 1 2
// 4
// 7 1 4 1
// 3
// 103 102 104
// 5
// 1 101 1 100 1
// 5
// 1 10 100 1000 1
// 2
// 3 1
// 3
// 1000000000 999999997 999999999
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// 2
// 3
// 2
// 1
// 1
// 2
// ======================================================================

// Примечание
// В первом наборе входных данных оптимально выбрать p = [2, 1]. Тогда после применения
// операции массив a будет равен [3, 3], в котором число 3 встречается дважды, поэтому
// ответ равен 2.

// Во втором наборе входных данных одним из оптимальных вариантов является p = [2, 3, 1, 4].
// После применения операции массив a будет равен [9, 4, 5, 5]. Так как число 5
// встречается дважды, то ответ равен 2.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;
    set<int> st(a.begin(), a.end());
    vector<int> t(st.rbegin(), st.rend());
    int l = 0, r = 0, cur, best_res = 1;

    while (r < t.size() && l <= r)
    {
        cur = t[l] + 1;
        while (r < t.size() && cur - t[r] <= n)
            r++;
        best_res = max(best_res, r - l);
        l++;
    }
    cout << best_res << '\n';
}

// 7 4 1
//

// 5
// 1 101 1 100 1
// 101 100 1 1 1
// 102 102

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
