// C. LR-остатки
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вам задан массив a длины n, положительное целое число m и строка команд из n символов.
// Каждая команда — это либо символ 'L', либо символ 'R'.

// Обработайте все n команд в порядке их записи в строке s. Обработка команды
// производится следующим образом:

// - сначала выведите остаток от произведения значений всех элементов массива a
//   при делении на m,
// - затем, если команда равна 'L', то удалите из массива a крайний левый элемент,
//   если команда равна 'R', то удалите из массива a крайний правый элемент.

// Обратите внимание, что после каждого хода длина массива a уменьшается на 1
// и после обработки всех команд он окажется пустым.

// Напишите программу, которая совершит обработку всех команд в порядке из записи
// в строке s (слева направо).

// Входные данные
// В первой строке записано целое число t (1 ≤ t ≤ 10^4) — количество наборов
// входных данных в тесте. Далее следуют описания t наборов входных данных.

// Каждый набор входных данных задаётся тремя строками.

// Первая строка содержит два целых числа n и m (1 ≤ n ≤ 2·10^5, 1 ≤ m ≤ 10^4) —
// начальная длина массива a и значение, по которому надо брать остаток.

// Вторая строка содержит n целых чисел a1, a2, …, a_n (1 ≤ a_i ≤ 10^4) —
// элементы массива a.

// Третья строка состоит из n букв 'L' и 'R' — строка команд s.

// Гарантируется, что сумма значений n по всем наборам входных данных теста
// не превосходит 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите n целых чисел b1, b2, …, b_n,
// где b_i — остаток при делении произведения всех элементов текущего состояния
// массива a на m в начале выполнения i-й команды.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 4 6
// 3 1 4 2
// LRRL
// 5 1
// 1 1 1 1 1
// LLLLL
// 6 8
// 1 2 3 4 5 6
// RLLLRR
// 1 10000
// 10000
// R
// ======================================================================
// Выходные данные
// ======================================================================
// 0 2 4 1
// 0 0 0 0 0
// 0 0 0 4 4 4
// 0
// ======================================================================

// Примечание
// В первом наборе входных данных примера:

// - 3·1·4·2 mod 6 = 24 mod 6 = 0;
// - s1 = 'L', так что удалим первый элемент и получим массив [1, 4, 2];
// - 1·4·2 mod 6 = 8 mod 6 = 2;
// - s2 = 'R', так что удалим последний элемент и получим массив [1, 4];
// - 1·4 mod 6 = 4 mod 6 = 4;
// - s3 = 'R', так что удалим последний элемент и получим массив [1];
// - 1 mod 6 = 1;
// - s4 = 'L', так что удалим первый элемент и получим пустой массив.

#include <bits/stdc++.h>
using namespace std;

#define int long long

int find(int a, int m)
{
    for (int i = 1; i < m; i++)
    {
        if ((a * i) % m == 1)
            return i;
    }
    return -1;
}

void solve()
{
    int n, m;
    cin >> n >> m;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;

    string c;
    cin >> c;
    int l = 0, r = n - 1;
    stack<int> res;
    for (int i = 0; i < n - 1; i++)
        if (c[i] == 'L')
            l++;
        else
            r--;

    res.push(a[l] % m);
    for (int i = n - 2; i >= 0; i--)
    {
        if (c[i] == 'L')
        {
            l--;
            res.push((res.top() * a[l]) % m);
        }
        else
        {
            r++;
            res.push((res.top() * a[r] % m));
        }
    }
    while (!res.empty())
    {
        int t = res.top();
        cout << t << ' ';
        res.pop();
    }
    cout << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
