// C. Количество значений k
// ограничение по времени на тест5 секунд
// ограничение по памяти на тест256 мегабайт

// Вам даны три положительных целых числа a, b и l (a, b, l > 0).

// Можно показать, что всегда существует способ выбрать неотрицательные (т.е. ≥ 0)
// целые числа k, x и y таким образом, что l = k · a^x · b^y.

// Ваша задача — найти количество различных возможных значений k для всех таких способов.

// Входные данные
// Первая строка содержит целое число t (1 ≤ t ≤ 10^4) — количество наборов входных данных.

// Следующие t строк содержат три целых числа, a, b и l (2 ≤ a, b ≤ 100, 1 ≤ l ≤ 10^6) —
// описание набора входных данных.

// Выходные данные
// Выведите t строк, где i-я (1 ≤ i ≤ t) строка содержит целое число — ответ на i-й
// набор входных данных.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 11
// 2 5 20
// 2 5 21
// 4 6 48
// 2 3 72
// 3 5 75
// 2 2 1024
// 3 7 83349
// 100 100 1000000
// 7 3 2
// 2 6 6
// 17 3 632043
// ======================================================================
// Выходные данные
// ======================================================================
// 6
// 1
// 5
// 12
// 6
// 11
// 24
// 4
// 1
// 3
// 24
// ======================================================================

// Примечание
// В первом наборе входных данных примера a = 2, b = 5, l = 20. Возможные значения k
// (и соответствующие x, y) следующие:

// - Выберите k = 1, x = 2, y = 1. Тогда k · a^x · b^y = 1 · 2^2 · 5^1 = 20 = l.
// - Выберите k = 2, x = 1, y = 1. Тогда k · a^x · b^y = 2 · 2^1 · 5^1 = 20 = l.
// - Выберите k = 4, x = 0, y = 1. Тогда k · a^x · b^y = 4 · 2^0 · 5^1 = 20 = l.
// - Выберите k = 5, x = 2, y = 0. Тогда k · a^x · b^y = 5 · 2^2 · 5^0 = 20 = l.
// - Выберите k = 10, x = 1, y = 0. Тогда k · a^x · b^y = 10 · 2^1 · 5^0 = 20 = l.
// - Выберите k = 20, x = 0, y = 0. Тогда k · a^x · b^y = 20 · 2^0 · 5^0 = 20 = l.

// Во втором наборе входных данных примера a = 2, b = 5, l = 21. Обратите внимание,
// что l = 21 не делится ни на a = 2, ни на b = 5. Поэтому мы можем установить только
// x = 0, y = 0, что соответствует k = 21.

// В третьем наборе входных данных примера a = 4, b = 6, l = 48. Возможные значения k
// (и соответствующие x, y) следующие:

// - Выберите k = 2, x = 1, y = 1. Тогда k · a^x · b^y = 2 · 4^1 · 6^1 = 48 = l.
// - Выберите k = 3, x = 2, y = 0. Тогда k · a^x · b^y = 3 · 4^2 · 6^0 = 48 = l.
// - Выберите k = 8, x = 0, y = 1. Тогда k · a^x · b^y = 8 · 4^0 · 6^1 = 48 = l.
// - Выберите k = 12, x = 1, y = 0. Тогда k · a^x · b^y = 12 · 4^1 · 6^0 = 48 = l.
// - Выберите k = 48, x = 0, y = 0. Тогда k · a^x · b^y = 48 · 4^0 · 6^0 = 48 = l.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int a, b, l;
    cin >> a >> b >> l;
    int res = 0;

    set<int> sx, sy, sk;
    for (int x = 0; x <= 100000; x++)
    {
        int ax = pow(a, x);
        if (ax > l)
            break;
        for (int y = 0; y <= 100000; y++)
        {
            int by = pow(b, y);
            if (by > l)
                break;
            if (l % (ax * by) == 0 && (l / (ax * by)) != 0 && (ax * by * (l / (ax * by)) == l))
            {
                res++;
                sx.insert(x);
                sy.insert(y);
                sk.insert(l / (ax * by));
            }
        }
    }
    cout << max({sx.size(), sy.size(), sk.size()}) << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
