// B. Еще одна задача о монетах
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// У вас есть 5 различных типов монет, каждый из которых имеет значение, равное одному
// из первых 5 треугольных чисел: 1, 3, 6, 10 и 15. Все типы монет имеются
// в неограниченном количестве. Ваша задача — определить, какого минимального
// количества монет достаточно, чтобы набрать сумму ровно n.

// Можно показать, что ответ всегда существует.

// Входные данные
// В первой строке находится одно целое число t (1 ≤ t ≤ 10^4) — количество наборов
// входных данных. Далее следует описание наборов входных данных.

// В единственной строке каждого набора входных данных содержится одно целое число n
// (1 ≤ n ≤ 10^9) — требуемое значение.

// Выходные данные
// Для каждого набора входных данных выведите одно число — минимальное необходимое
// количество монет.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 14
// 1
// 2
// 3
// 5
// 7
// 11
// 12
// 14
// 16
// 17
// 18
// 20
// 98
// 402931328
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 2
// 1
// 3
// 2
// 2
// 2
// 3
// 2
// 3
// 2
// 2
// 8
// 26862090
// ======================================================================

// Примечание
// В первом наборе тестовых данных, где n = 1, ответ 1, поскольку достаточно
// использовать одну монету стоимости 1.

// В четвёртом наборе входных данных, где n = 5, ответ 3, который может быть достигнут,
// используя две монеты стоимости 1 и одну монету стоимости 3.

// В седьмом наборе входных данных, где n = 12, ответ 2, который может быть достигнут,
// используя две монеты стоимости 6.

// В девятом наборе входных данных, где n = 16, ответ 2, который может быть достигнут,
// используя одну монету стоимости 1 и одну монету стоимости 15. Альтернативным
// решением может быть использование одной монеты стоимости 10 и одной монеты
// стоимости 6.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve(vector<int> &dp)
{
    int n;
    cin >> n;
    if (n <= 100)
    {
        cout << dp[n] << '\n';
        return;
    }

    int cn15 = n / 15, res = 1e18;
    for (int i = max(0LL, cn15 - 4); i < cn15; i++)
    {
        int r = n - 15 * i;
        if (r <= 100)
            res = min(res, i + dp[r]);
    }

    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    vector<int> dp(101, 1e10);
    dp[0] = 0;
    for (int i = 1; i <= 100; i++)
    {
        dp[i] = dp[i - 1] + 1;
        if (i >= 3)
            dp[i] = min(dp[i], dp[i - 3] + 1);
        if (i >= 6)
            dp[i] = min(dp[i], dp[i - 6] + 1);
        if (i >= 10)
            dp[i] = min(dp[i], dp[i - 10] + 1);
        if (i >= 15)
            dp[i] = min(dp[i], dp[i - 15] + 1);
    }
    while (t--)
    {
        solve(dp);
    }
    return 0;
}

// 0 1 2 3 4
// 0 1 2