// B. Рудольф и 121
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// У Рудольфа есть массив a из n целых чисел, элементы которого пронумерованы от 1 до n.

// За одну операцию он может выбрать индекс i (2 ≤ i ≤ n − 1) и присвоить:

// - a_{i−1} = a_{i−1} − 1;
// - a_i = a_i − 2;
// - a_{i+1} = a_{i+1} − 1.

// Рудольф может применить эту операцию любое число раз. Любой индекс i может быть
// использован ноль или более раз.

// Может ли он с помощью этой операции сделать все элементы массива равными нулю?

// Входные данные
// Первая строка входных данных содержит одно целое число t (1 ≤ t ≤ 10^4) —
// количество наборов входных данных в тесте.

// Первая строка каждого набора содержит одно целое число n (3 ≤ n ≤ 2·10^5) —
// количество элементов массива.

// Вторая строка каждого набора содержит n целых чисел a1, a2, …, a_n
// (0 ≤ a_j ≤ 10^9) — элементы массива.

// Гарантируется, что сумма значений n по всем наборам входных данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите «YES», если с помощью описанных операций
// можно сделать все элементы массива нулями. Иначе выведите «NO».

// Вы можете выводить каждую букву в любом регистре (строчную или заглавную). Например,
// строки «yEs», «yes», «Yes» и «YES» будут приняты как положительный ответ.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 7
// 5
// 1 3 5 5 2
// 5
// 2 4 4 5 1
// 5
// 0 1 3 3 1
// 6
// 5 6 0 2 3 0
// 4
// 1 2 7 2
// 3
// 7 1 0
// 4
// 1 1 1 1
// ======================================================================
// Выходные данные
// ======================================================================
// YES
// NO
// YES
// NO
// NO
// NO
// NO
// ======================================================================

// Примечание
// В первом примере исходный массив равен [1, 3, 5, 5, 2], чтобы сделать все его
// элементы равными нулю, Рудольф может действовать так:

// - применить операцию на i = 4 и получить массив [1, 3, 4, 3, 1];
// - применить операцию на i = 3 и получить массив [1, 2, 2, 2, 1];
// - применить операцию на i = 2 и получить массив [0, 0, 1, 2, 1];
// - применить операцию на i = 4 и получить массив [0, 0, 0, 0, 0].

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n + 3, 0);
    for (int i = 0; i < n; i++)
        cin >> a[i];

    int i = 0;
    while (i < n)
    {
        int tm = a[i];
        a[i] = 0;
        a[i + 1] -= 2 * tm;
        a[i + 2] -= tm;
        if (a[i] < 0 || a[i + 1] < 0 || a[i + 2] < 0)
        {
            cout << "NO\n";
            return;
        }
        i++;
    }
    cout << "YES\n";
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
