// A. 1-3-5
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест512 мегабайт

// В Берляндии обычно используются монеты номиналом в 1, 3 и 5 бурлей (бурли — местная
// валюта).

// Еве нужно заплатить ровно n бурлей в магазине. У неё бесконечное количество монет
// всех трёх типов. Однако ей не нравится платить монетами номиналом в 1 бурль.

// Помогите Еве рассчитать минимальное количество монет номиналом в 1 бурль, которые
// ей нужно использовать, если она должна заплатить ровно n бурлей. Обратите внимание,
// что она может потратить любое количество монет номиналом в 3 и/или 5 бурлей.

// Входные данные
// Первая строка содержит одно целое число t (1 ≤ t ≤ 100) — количество наборов
// входных данных.

// Каждый набор входных данных состоит из одной строки, содержащей одно целое число n
// (1 ≤ n ≤ 100).

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — минимальное
// количество монет номиналом в 1 бурль, которые должна использовать Ева.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 7
// 8
// 42
// 2
// 11
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 0
// 0
// 2
// 0
// ======================================================================

// Примечание
// В первом наборе входных данных Ева может использовать 1 монету номиналом в 1 бурль
// и 2 монеты номиналом в 3 бурля.

// Во втором наборе входных данных Ева может использовать 1 монету номиналом в 3 бурля
// и 1 монету номиналом в 5 бурлей.

// В третьем наборе входных данных Ева может использовать 14 монет номиналом в 3 бурля.

// В четвёртом наборе входных данных Ева может использовать 2 монеты номиналом
// в 1 бурль.

// В пятом наборе входных данных Ева может использовать 2 монеты номиналом в 3 бурля
// и 1 монету номиналом в 5 бурлей.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    const int INF = 1e9;
    cin >> n;
    vector<int> dp(n + 1, 1e9);
    dp[0] = 0;
    for (int i = 0; i <= n; i++)
    {
        if (n - 5 >= i)
            dp[i + 5] = min(dp[i + 5], dp[i] + 1);
        if (n - 3 >= i)
            dp[i + 3] = min(dp[i + 3], dp[i] + 1);
    }
    int r = n;
    while (r > 0 && dp[r] == INF)
        r--;
    cout << (n - r) << '\n';

    // for (auto &i : dp)
    //     cout << i << ' ';
    // cout << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
