// C. Сад Бейзила
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Есть ряд из n цветов, у i-го из них изначально высота h_i метров.

// Каждую секунду порыв ветра слева будет понижать высоты некоторых цветов.

// А именно, каждую секунду, для каждого i от 1 до n в этом порядке, происходит
// следующее:

// - Если i = n или h_i > h_{i+1}, значение h_i меняется на max(0, h_i − 1).

// Сколько секунд пройдёт перед тем, как h_i = 0 будет впервые верно для всех 1 ≤ i ≤ n?

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 10^4) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// Первая строка каждого набора входных данных содержит одно целое число n
// (1 ≤ n ≤ 10^5) — количество цветов.

// Вторая строка каждого набора входных данных содержит n целых чисел
// h1, h2, …, h_n (1 ≤ h_i ≤ 10^9) — высоты цветов.

// Гарантируется, что сумма n по всем наборам входных данных не превышает 10^5.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — количество секунд,
// которое пройдёт перед тем, как h_i = 0 будет впервые верно для всех 1 ≤ i ≤ n.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 3
// 1 1 2
// 2
// 3 1
// 1
// 9
// 5
// 7 4 4 3 2
// ======================================================================
// Выходные данные
// ======================================================================
// 4
// 3
// 9
// 7
// ======================================================================

// Примечание
// В первом наборе входных данных высоты цветов меняются следующим образом:
// [1, 1, 2] → [1, 1, 1] → [1, 1, 0] → [1, 0, 0] → [0, 0, 0].

// Во втором наборе входных данных высоты цветов меняются следующим образом:
// [3, 1] → [2, 0] → [1, 0] → [0, 0].

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;
    int res = a[n - 1];
    for (int i = n - 2; i >= 0; i--)
        res = max(res + 1, a[i]);
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
