// D. Right Left Wrong
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Влад нашёл полоску из n клеток, пронумерованных слева направо от 1 до n.
// На i-й клетке записаны положительное целое число a_i и буква s_i, все s_i
// равны либо 'L', либо 'R'.

// Влад предлагает вам попробовать набрать максимально возможное количество очков,
// сделав любое (возможно нулевое) количество операций.

// За одну операцию вы можете выбрать два индекса l и r (1 ≤ l < r ≤ n),
// такие что s_l = 'L' и s_r = 'R', и сделать следующее:

// - прибавить к текущему счёту a_l + a_{l+1} + … + a_{r-1} + a_r очков;
// - заменить s_i на '.' для всех l ≤ i ≤ r, то есть выбирать эти индексы
//   вы больше не сможете.

// Для примера рассмотрим следующую полоску:

// 3 5 1 4 3 2
// L R L L L R

// Можно сначала выбрать l = 1, r = 2 и добавить к своему счёту 3 + 5 = 8.
// Затем выбрать l = 3, r = 6 и прибавить к счёту 1 + 4 + 3 + 2 = 10.
// В результате невозможно выполнить ещё одну операцию, а итоговый счёт равен 18.

// Какой максимальный счёт можно набрать?

// Входные данные
// Первая строка содержит одно целое число t (1 ≤ t ≤ 10^4) — количество наборов
// входных данных.

// Первая строка каждого набора содержит одно целое число n (2 ≤ n ≤ 2·10^5) —
// длину полоски.

// Вторая строка каждого набора содержит n целых чисел a1, a2, …, a_n (1 ≤ a_i ≤ 10^5) —
// числа, записанные на полоске.

// Третья строка каждого набора содержит строку s из n символов 'L' и 'R'.

// Гарантируется, что сумма значений n по всем наборам входных данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — максимальное
// возможное количество очков, которое можно набрать.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 6
// 3 5 1 4 3 2
// LRLLLR
// 2
// 2 8
// LR
// 2
// 3 9
// RL
// 5
// 1 2 3 4 5
// LRLRR
// ======================================================================
// Выходные данные
// ======================================================================
// 18
// 10
// 0
// 22
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

struct Node
{
    int price;
    char vl;
};

void solve()
{
    int n;
    cin >> n;
    vector<Node> a(n);
    for (auto &i : a)
        cin >> i.price;
    for (auto &i : a)
        cin >> i.vl;

    vector<int> pref(n + 2, 0);
    for (int i = 0; i < n; i++)
        pref[i + 1] = pref[i] + a[i].price;

    int r = n - 1, l = 0, res = 0;
    while (l < r)
    {
        while (r >= 0 && l < r && a[r].vl != 'R')
            r--;

        while (l <= n && l < r && a[l].vl != 'L')
            l++;

        if (a[l].vl == 'L' && a[r].vl == 'R')
            res += pref[r + 1] - pref[l];
        r--;
        l++;
    }
    // for (auto i : pref)
    //     cout << i << " ";
    // cout << '\n';
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
