// C. Робин Гуд в городе
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// В Шервуде мы судим человека не по его богатству, а по его заслугам.
// Оглянитесь вокруг: богатые становятся богаче, а бедные — беднее. Нам нужно отнять
// у богатых и отдать бедным. Нам нужен Робин Гуд!

// В городе живут n человек. Сейчас богатство i-го человека составляет a_i золота.
// Но угадайте что? Самый богатый человек только что нашёл дополнительную бочку золота!

// Более формально, найдите a_j = max(a_1, a_2, …, a_n), измените a_j на a_j + x,
// где x — это количество золота в бочке. Если есть несколько максимумов, можно взять
// любой из них.

// Человек несчастен, если его богатство строго ниже половины среднего богатства*.
// Если строго больше половины общего населения n несчастны, Робин Гуд появится
// по народному требованию.

// Определите минимальное значение x, необходимое для появления Робина Гуда,
// или выведите −1, если это невозможно.

// * Среднее богатство определяется как общее богатство, делённое на общее население n,
// то есть (∑ a_i) / n, результат является вещественным числом.

// Входные данные
// Первая строка входных данных содержит одно целое число t (1 ≤ t ≤ 10^4) —
// количество наборов входных данных.

// Первая строка каждого набора входных данных содержит целое число n (1 ≤ n ≤ 2·10^5) —
// общее население.

// Вторая строка каждого набора входных данных содержит n целых чисел a1, a2, …, a_n
// (1 ≤ a_i ≤ 10^6) — богатство каждого человека.

// Гарантируется, что сумма n по всем наборам входных данных не превышает 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — минимальное количество
// золота, которое самый богатый человек должен найти, чтобы Робин Гуд пришёл в город.
// Если это невозможно, выведите −1.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 1
// 2
// 2
// 2 19
// 3
// 1 3 20
// 4
// 1 2 3 4
// 5
// 1 2 3 4 5
// 6
// 1 2 1 1 1 25
// ======================================================================
// Выходные данные
// ======================================================================
// -1
// -1
// 0
// 15
// 16
// 0
// ======================================================================

// Примечание
// В первом наборе входных данных невозможно, чтобы один человек был несчастным.

// Во втором наборе входных данных всегда есть 1 счастливый человек (самый богатый).

// В третьем наборе входных данных дополнительное золото не требуется, поэтому ответ 0.

// В четвёртом наборе входных данных после добавления 15 золота среднее богатство
// становится 25/4, и половина этого среднего составляет 25/8, в результате чего
// 3 человека оказываются несчастными.

// В пятом наборе входных данных после добавления 16 золота среднее богатство
// становится 31/5, в результате чего 3 человека оказываются несчастными.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, s = 0;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
    {
        cin >> i;
        s += i;
    }
    if (n < 3)
    {
        cout << "-1\n";
        return;
    }
    sort(a.begin(), a.end());
    int l = -1, r = 2e18;
    while (r > l + 1)
    {
        int x = (l + r) / 2;
        // Человек несчастен, если его богатство строго ниже половины среднего богатства*
        // среднее богатство это сред арифм то есть
        //  (S + x) / n
        // а половина от ср богатства это
        // (S + x) / (n * 2)
        // домнажаем что бы не работать с дробью и вот итговая формула
        if (a[n / 2] * 2 * n < s + x)
            r = x;
        else
            l = x;
    }
    cout << r << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
