// C. Аня и 1100
// ограничение по времени на тест3 секунды
// ограничение по памяти на тест256 мегабайт

// Перебирая вещи в дальнем ящике, Аня нашла красивую строку s, состоящую только
// из нулей и единиц.

// Теперь она хочет сделать её ещё красивее, выполнив над ней q операций.

// Каждая операция характеризуется двумя целыми числами i (1 ≤ i ≤ |s|) и v (v ∈ {0, 1})
// и означает, что i-му символу строки присваивается значение v (то есть осуществляется
// присваивание s_i = v).

// Но Аня любит число 1100, поэтому после каждого запроса просит вас сообщить ей,
// присутствует ли в её строке подстрока «1100» (то есть существует такое
// 1 ≤ i ≤ |s| − 3, что s_i s_{i+1} s_{i+2} s_{i+3} = 1100).

// Входные данные
// Первая строка содержит одно целое число t (1 ≤ t ≤ 10^4) — количество наборов
// входных данных.

// Первая строка каждого набора тестовых данных содержит строку s
// (1 ≤ |s| ≤ 2·10^5), состоящую только из символов «0» и «1». Здесь |s| обозначает
// длину строки s.

// Следующая строка каждого набора содержит целое число q (1 ≤ q ≤ 2·10^5) —
// количество запросов.

// Следующие q строк содержат по два целых числа i (1 ≤ i ≤ |s|) и v (v ∈ {0, 1}),
// характеризующих запрос.

// Гарантируется, что сумма |s| по всем наборам входных данных не превышает 2·10^5.
// Также гарантируется, что сумма q по всем наборам входных данных не превышает 2·10^5.

// Выходные данные
// Для каждого запроса выведите «YES», если «1100» присутствует в строке Ани,
// иначе выведите «NO».

// Вы можете выводить каждую букву в любом регистре (строчную или заглавную). Например,
// строки «yEs», «yes», «Yes» и «YES» будут приняты как положительный ответ.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 100
// 4
// 1 1
// 2 0
// 2 0
// 3 1
// 1100000
// 3
// 6 1
// 7 1
// 4 1
// 111010
// 4
// 1 1
// 5 0
// 4 1
// 5 0
// 0100
// 4
// 3 1
// 1 1
// 2 0
// 2 1
// ======================================================================
// Выходные данные
// ======================================================================
// NO
// NO
// NO
// NO
// YES
// YES
// NO
// NO
// YES
// YES
// YES
// NO
// NO
// NO
// NO
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

bool check(string &s, int idx)
{
    if (idx < 0 || idx + 3 >= s.size())
    {
        return false;
    }
    return s[idx] == '1' && s[idx + 1] == '1' && s[idx + 2] == '0' && s[idx + 3] == '0';
}

void solve()
{
    string s;
    int q, cnt = 0;
    cin >> s >> q;
    for (int i = 0; i + 3 < s.size(); i++)
        if (check(s, i))
            cnt++;

    while (q--)
    {
        int i;
        char v;
        cin >> i >> v;
        i--;
        if (s[i] != v)
        {
            for (int start = i - 3; start <= i; start++)
                if (check(s, start))
                    cnt--;

            s[i] = v;

            for (int start = i - 3; start <= i; start++)
                if (check(s, start))
                    cnt++;
        }
        cout << (cnt > 0 ? "YES\n" : "NO\n");
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
