// C. Неинтересное число
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вам дано число n длины не больше 10^5.

// Вы можете любое количество раз сделать с ним следующее: выбрать одну из его цифр,
// возвести её в квадрат и заменить получившейся исходную цифру. При этом результат
// должен быть цифрой (то есть, если вы выбрали цифру x, то значение x^2 должно быть
// меньше 10).

// Можно ли такими действиями получить из исходного числа такое, которое будет
// делиться нацело на 9?

// Входные данные
// Первая строка содержит целое число t (1 ≤ t ≤ 10^4) — количество наборов
// входных данных.

// Единственная строка каждого набора содержит число n, без ведущих нулей. Длина числа
// не превосходит 10^5.

// Гарантируется, что сумма длин чисел по всем наборам входных данных не превосходит 10^5.

// Выходные данные
// Для каждого набора входных данных выведите «YES», если с помощью описанных операций
// можно получить число, делящееся на 9, и «NO» иначе.

// Вы можете выводить каждую букву в любом регистре (строчную или заглавную). Например,
// строки «yEs», «yes», «Yes» и «YES» будут приняты как положительный ответ.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 9
// 123
// 322
// 333333333333
// 9997
// 5472778912773
// 1234567890
// 23
// 33
// 52254522632
// ======================================================================
// Выходные данные
// ======================================================================
// NO
// YES
// YES
// NO
// NO
// YES
// NO
// YES
// YES
// ======================================================================

// Примечание
// В первом примере из числа 123 возможно получить только 123, 143, 129 и 149,
// ни одно из них не делится на 9.

// Во втором примере нужно заменить вторую цифру на её квадрат, тогда n станет равно
// 342 = 38·9.

// В третьем примере число уже делится на 9.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    string s;
    cin >> s;
    vector<int> a;
    int sm = 0;
    int c2 = 0, c3 = 0;
    for (auto &i : s)
    {
        c2 += i == '2';
        c3 += i == '3';
        sm += i - '0';
    }
    int rem = sm % 9;
    if (rem == 0)
    {
        cout << "YES\n";
        return;
    }

    int required = 9 - rem;
    vector<bool> dp(9, 0);
    dp[0] = 1;

    for (int i = 0; i < min(c3, 9LL); i++)
    {
        vector<bool> next = dp;
        for (int j = 0; j < 9; j++)
            if (dp[j])
                next[(j + 6) % 9] = 1;
        dp = next;
    }
    if (dp[required])
    {
        cout << "YES\n";
        return;
    }
    for (int i = 0; i < min(c2, 9LL); i++)
    {
        vector<bool> next = dp;
        for (int j = 0; j < 9; j++)
            if (dp[j])
                next[(j + 2) % 9] = 1;
        dp = next;
    }
    cout << (dp[required] ? "YES\n" : "NO\n");
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
