// D. Подсчет количества пар
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вам задана последовательность a, состоящая из n целых чисел, причём i-е число
// последовательности равно a_i. Также вам заданы два целых числа x и y (x ≤ y).

// Пара целых чисел (i, j) считается интересной, если выполняются следующие условия:

// - 1 ≤ i < j ≤ n;
// - если одновременно удалить из последовательности a числа в позициях i и j,
//   то сумма оставшихся элементов должна быть не меньше x и не больше y.

// Перед вами стоит задача определить количество интересных пар целых чисел для
// заданной последовательности a.

// Входные данные
// В первой строке задано одно целое число t (1 ≤ t ≤ 10^4) — количество наборов
// входных данных.

// Каждый набор входных данных состоит из двух строк:

// - в первой строке заданы три целых числа n, x, y (3 ≤ n ≤ 2·10^5, 1 ≤ x ≤ y ≤ 2·10^14);
// - во второй строке заданы n целых чисел a1, a2, …, a_n (1 ≤ a_i ≤ 10^9).

// Дополнительное ограничение на входные данные: сумма n по всем наборам входных
// данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — количество
// интересных пар целых чисел для заданной последовательности a.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 7
// 4 8 10
// 4 6 3 6
// 6 22 27
// 4 9 6 3 4 5
// 3 8 10
// 3 2 1
// 3 1 1
// 2 3 4
// 3 3 6
// 3 2 1
// 4 4 12
// 3 3 2 1
// 6 8 8
// 1 1 2 2 2 3
// ======================================================================
// Выходные данные
// ======================================================================
// 4
// 7
// 0
// 0
// 1
// 5
// 6
// ======================================================================

// Примечание
// В первом примере существует 4 интересных пары целых чисел:

// - (1, 2);
// - (1, 4);
// - (2, 3);
// - (3, 4).

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, x, y, cur_sum = 0;
    cin >> n >> x >> y;
    vector<int> a(n);
    for (auto &i : a)
    {
        cin >> i;
        cur_sum += i;
    }

    sort(a.begin(), a.end());
    int min_pa = cur_sum - y, max_pa = cur_sum - x, res = 0;
    for (int i = 0; i < n; i++)
    {
        auto it1 = lower_bound(a.begin() + i + 1, a.end(), min_pa - a[i]);
        auto it2 = upper_bound(a.begin() + i + 1, a.end(), max_pa - a[i]);
        res += (it2 - it1);
    }
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
