// B. Удивительные перчатки
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Вы гордый владелец множества цветных перчаток и храните их в ящике. Каждая перчатка
// имеет один из n цветов, пронумерованных от 1 до n. В частности, для каждого i
// от 1 до n у вас есть l_i левых перчаток и r_i правых перчаток цвета i.

// К сожалению, уже поздно, поэтому вы не можете видеть ни одной из своих перчаток.
// Другими словами, вы будете знать цвет и тип (левая или правая) перчатки только
// после того, как вы её достанете из ящика.

// Совпадающая пара перчаток цвета i состоит ровно из одной левой перчатки и одной
// правой перчатки цвета i. Найдите минимальное количество перчаток, которые вам
// нужно достать из ящика, чтобы гарантировать, что у вас есть по крайней мере k
// совпадающих пар перчаток разных цветов.

// Формально, найдите наименьшее положительное целое число x, такое что:

// - Для любого набора из x перчаток, которые вы достанете из ящика, всегда будет
//   по крайней мере k совпадающих пар перчаток разного цвета.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 10^4) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// Первая строка каждого теста содержит два целых числа n, k (1 ≤ k ≤ n ≤ 2·10^5) —
// количество различных цветов и минимальное количество необходимых совпадающих пар
// перчаток.

// Вторая строка каждого теста содержит n целых чисел l1, l2, …, l_n (1 ≤ l_i ≤ 10^9) —
// количество левых перчаток цвета i для каждого i от 1 до n.

// Третья строка каждого теста содержит n целых чисел r1, r2, …, r_n (1 ≤ r_i ≤ 10^9) —
// количество правых перчаток цвета i для каждого i от 1 до n.

// Гарантируется, что сумма n по всем тестам не превышает 2·10^5.

// Выходные данные
// Для каждого теста выведите одно целое число — минимальное количество перчаток,
// которые вам нужно достать из ящика.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 3 3
// 1 1 1
// 1 1 1
// 1 1
// 100
// 1
// 3 2
// 100 1 1
// 200 1 1
// 5 2
// 97 59 50 87 36
// 95 77 33 13 74
// 10 6
// 97 59 50 87 36 95 77 33 13 74
// 91 14 84 33 54 89 68 34 14 15
// ======================================================================
// Выходные данные
// ======================================================================
// 6
// 101
// 303
// 481
// 1010
// ======================================================================

// Примечание
// В первом тесте вам нужно достать все перчатки, поэтому ответ равен 6.

// Во втором тесте ответ равен 101. Если вы достанете 100 перчаток или меньше,
// то возможно, что все они будут левыми перчатками, что означает, что у вас не будет
// совпадающей пары перчаток.

// В третьем тесте ответ равен 303. Если вы достанете только 302 перчатки, то один
// из возможных сценариев выглядит следующим образом:

// - Цвет 1: 100 левых перчаток, 200 правых перчаток
// - Цвет 2: 1 левая перчатка, 0 правых перчаток
// - Цвет 3: 0 левых перчаток, 1 правая перчатка

// У вас есть только совпадающие пары перчаток цвета 1. Поэтому у вас нет по крайней
// мере 2 совпадающих пар перчаток разных цветов.

#include <bits/stdc++.h>
using namespace std;

#define int long long

bool c(pair<int, int> a, pair<int, int> b)
{
    return a.first < b.first;
}

void solve()
{
    int n, k;
    cin >> n >> k;
    vector<int> l(n), r(n);
    for (auto &i : l)
        cin >> i;
    for (auto &i : r)
        cin >> i;
    int res = 0;
    vector<int> mns(n);
    for (int i = 0; i < n; i++)
    {
        res += max(l[i], r[i]);
        mns[i] = min(l[i], r[i]);
    }
    sort(mns.rbegin(), mns.rend());
    for (int i = 0; i < k - 1; i++)
        res += mns[i];
    cout << res + 1 << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
