// C. Нужно больше массивов
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Дан массив a и n целых чисел. Он отсортирован в порядке неубывания, то есть
// a_i ≤ a_{i+1} для всех 1 ≤ i < n.

// Вы можете удалить сколько угодно элементов массива (в том числе вы можете не удалять
// их вовсе), не изменив при этом порядок оставшихся. После удалений произойдёт
// следующее:

// - a1 выписывается в новый массив;
// - если a1 + 1 < a2, то a2 выписывается в новый массив, иначе a2 выписывается
//   в тот же массив, что и a1;
// - если a2 + 1 < a3, то a3 выписывается в новый массив, иначе a3 выписывается
//   в тот же массив, что и a2;
// - …

// Например, если a = [1, 2, 4, 6], то:

// - a1 = 1 выписывается в новый массив, полученные массивы: [1];
// - a1 + 1 = 2, поэтому a2 = 2 дописывается в уже существующий массив, полученные
//   массивы: [1, 2];
// - a2 + 1 = 3, поэтому a3 = 4 выписывается в новый массив, полученные массивы:
//   [1, 2] и [4];
// - a3 + 1 = 5, поэтому a4 = 6 выписывается в новый массив, полученные массивы:
//   [1, 2], [4] и [6].

// Ваша задача — удалить элементы так, чтобы в результате описанного выше алгоритма
// создалось как можно больше массивов. Если вы удалите все элементы из массива,
// то не будет создано ни одного нового массива.

// Входные данные
// Первая строка входных данных содержит одно целое число t (1 ≤ t ≤ 10^4) —
// количество наборов входных данных.

// Первая строка каждого набора содержит одно целое число n (1 ≤ n ≤ 2·10^5) —
// длину массива.

// Вторая строка каждого набора содержит n целых чисел a1, a2, …, a_n
// (1 ≤ a_i ≤ 10^6, a_i ≤ a_{i+1}) — элементы массива.

// Гарантируется, что сумма n по всем наборам входных данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — максимальное
// количество массивов, которое можно получить, удалив любое (возможно, нулевое)
// количество элементов.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 6
// 1 2 3 4 5 6
// 3
// 1 2 3
// 4
// 1 2 2 4
// 1
// 2
// 3
// 1 4 8
// 2
// 1 1
// ======================================================================
// Выходные данные
// ======================================================================
// 3
// 2
// 2
// 1
// 3
// 1
// ======================================================================

// Примечание
// В первом примере можно удалить a3 и a5, тогда a = [1, 2, 4, 6], процесс
// составления массивов для него показан в условии.

// Во втором примере нужно удалить a2, после этого a = [1, 3], а выписаны будут
// массивы [1] и [3].

// В третьем примере удаления делать не нужно, для a = [1, 2, 2, 4] выписаны будут
// массивы [1, 2, 2] и [4].

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n), dp(n + 1, -1);
    int res = 0;
    for (int i = 0; i < n; i++)
    {
        cin >> a[i];
        if (a[i] - dp[i] > 1)
        {
            res++;
            dp[i + 1] = a[i];
        }
        else
            dp[i + 1] = dp[i];
    }
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
