// D. Месть
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Юсеф хочет взорвать массив a1, a2, …, a_n. Массив взрывается, когда все его
// элементы становятся равными нулю.

// В одной операции Юсеф может сделать одно из следующих действий:

// - Для каждого индекса i в a уменьшить a_i на i.
// - Для каждого индекса i в a уменьшить a_i на n − i + 1.

// Ваша задача — помочь Юсефу определить, возможно ли взорвать массив, используя
// любое количество операций.

// Входные данные
// Первая строка входных данных содержит целое число t (1 ≤ t ≤ 10^4) — количество
// наборов входных данных.

// Первая строка каждого набора входных данных содержит целое число n (2 ≤ n ≤ 2·10^5) —
// размер массива.

// Вторая строка каждого набора входных данных содержит n целых чисел a1, a2, …, a_n
// (1 ≤ a_i ≤ 10^9) — элементы массива.

// Гарантируется, что сумма n по всем наборам входных данных не превышает 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите «YES», если Юсеф может взорвать массив,
// в противном случае выведите «NO».

// Вы можете выводить ответ в любом регистре (верхнем или нижнем). Например, строки
// «yEs», «yes», «Yes» и «YES» будут распознаны как положительные ответы.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 4
// 3 6 6 3
// 5
// 21 18 15 12 9
// 10
// 2 6 10 2 5 5 1 2 4 10
// 7
// 10 2 16 12 8 20 4
// 2
// 52 101
// 2
// 10 2
// ======================================================================
// Выходные данные
// ======================================================================
// NO
// YES
// NO
// NO
// YES
// NO
// ======================================================================

// Примечание
// Во втором наборе входных данных мы можем сделать следующее:

// - Выполнить 1 операцию первого типа. Массив становится [20, 16, 12, 8, 4].
// - Выполнить 4 операции второго типа. Массив становится [0, 0, 0, 0, 0].

// В первом, третьем, четвёртом и шестом наборах входных данных можно доказать,
// что невозможно сделать все элементы равными нулю, используя любое количество
// операций.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;

    int r = a[1] - a[0];
    for (int i = 2; i < n; i++)
        if (a[i] - a[i - 1] != r)
        {
            cout << "NO\n";
            return;
        }
    // операция  1 типа изменяет шаг прогрессии на -1, а 2 на +1
    // то есть пара из 1 и 2 операции не будет изменять разность
    //  i + (n - i + 1) = n + 1

    // Нужно смоделировать выполнение всех одиночных операций
    // что бы занулить разность прогрессии
    // Уменьшаем a[0] на величину которую из него заберут одиночные операции
    // выравнивающие массив в одинаковые числа:
    a[0] += (r < 0 ? r * n : -r);
    // для a[i] формула выглядит так
    //  a[i] = a[i] + (r < 0 ? r * (n - i) : -r * (i + 1));
    // (n - i) для того что бы сделать последовательность ... 5 4 3 2 1
    // (i + 1) соответсвено для 1 2 3 4 5 ... ну то есть n-ый элемент последовательности
    // по сути мы используем 1 или 2 операцю r раз что бы r стал 0 и выравнять все числа

    // Теперь все элементы массива равны этому новому a[0]
    // Осталось проверить, можно ли донулить их ПАРАМИ операций (каждая вычитает n + 1):
    if (a[0] >= 0 && a[0] % (n + 1) == 0)
        cout
            << "YES\n";
    else
        cout << "NO\n";
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
