// B. Процесс на Деке
// ограничение по времени на тест1.5 секунд
// ограничение по памяти на тест256 мегабайт

// Назовём массив a размера n плохим, если и только если существует 1 ≤ i ≤ n − 4
// такой, что одно из следующих условий выполняется:

// - a_i < a_{i+1} < a_{i+2} < a_{i+3} < a_{i+4}
// - a_i > a_{i+1} > a_{i+2} > a_{i+3} > a_{i+4}

// Массив называется хорошим, если и только если он не является плохим. Например:

// - a = [3, 1, 2, 4, 5, 6] является плохим, потому что a2 < a3 < a4 < a5 < a6.
// - a = [7, 6, 5, 4, 1, 2, 3] является плохим, потому что a1 > a2 > a3 > a4 > a5.
// - a = [7, 6, 5, 1, 2, 3, 4] является хорошим.

// Вам дана перестановка* p1, p2, …, p_n.

// Вам необходимо выполнить n шагов, на каждом шаге требуется удалить либо самый левый,
// либо самый правый из оставшихся элементов в p. Пусть q_i будет элементом, который
// удалён на i-м шаге.

// Вам предстоит выбрать, какой элемент удалять на каждом шаге таким образом, чтобы
// получившийся массив q был хорошим. Можно показать, что при заданных ограничениях
// это всегда возможно.

// * Перестановкой длины n является массив, состоящий из n различных целых чисел
// от 1 до n в произвольном порядке. Например, [2, 3, 1, 5, 4] — перестановка,
// но [1, 2, 2] не перестановка (2 встречается дважды) и [1, 3, 4] тоже не перестановка
// (n = 3, но в массиве встречается 4).

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 10000) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// Первая строка каждого набора входных данных содержит одно целое число n (5 ≤ n ≤ 100000) —
// длину массива.

// Вторая строка каждого набора входных данных содержит n целых чисел p1, p2, …, p_n
// (1 ≤ p_i ≤ n, все p_i попарно различны) — элементы перестановки.

// Гарантируется, что сумма значений n по всем наборам входных данных не превосходит 200000.

// Выходные данные
// Для каждого набора входных данных выведите строку s длины n. Для каждого 1 ≤ i ≤ n
// на i-м шаге:

// - s_i = 'L' означает, что вы удалили самый левый элемент в p;
// - s_i = 'R' означает, что вы удалили самый правый элемент в p.

// Можно показать, что ответ всегда существует. Если существует несколько решений,
// выведите любое из них.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 7
// 1 2 3 4 5 6 7
// 9
// 1 3 6 8 9 7 5 4 2
// 12
// 1 2 11 3 6 4 7 8 12 5 10 9
// 6
// 4 1 2 5 6 3
// 5
// 1 2 3 5 4
// 9
// 5 1 8 6 2 7 9 4 3
// ======================================================================
// Выходные данные
// ======================================================================
// RRRLLLL
// LLRRLLRRL
// LLLLLLLLLLLL
// LLLLLL
// LLLLL
// LLLLLLLLL
// ======================================================================

// Примечание
// В первом наборе входных данных последовательность RRRLLLL приводит к q = [7, 6, 5, 1, 2, 3, 4].

// Во втором наборе входных данных последовательность LLRRLLRRL приводит к q = [1, 3, 2, 4, 6, 8, 5, 7, 9].

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;
    int l = 0, r = n - 1;
    for (int i = 1; i <= n; i++)
    {
        bool tl = false;
        if (i % 2 == 1)
            tl = a[l] < a[r];
        else
            tl = a[r] < a[l];
        if (tl)
        {
            cout << 'L';
            l++;
        }
        else
        {
            cout << 'R';
            r--;
        }
    }
    cout << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
