// A. Вопреки различиям
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Назовём блоком массив, в котором все элементы равны длине массива. Например, [3, 3, 3],
// [1] и [4, 4, 4, 4] являются блоками, в то время как [1, 1, 1] и [2, 3, 3] — нет.

// Массив называется аккуратным, если его можно получить путём конкатенации произвольного
// количества блоков (возможно, нуля). Обратите внимание, что пустой массив всегда
// является аккуратным.

// Вам дан массив a, состоящий из n целых чисел. Найдите длину его самой длинной
// аккуратной подпоследовательности*.

// * Последовательность c является подпоследовательностью a, если c может быть получена
// из a удалением нескольких (возможно, ни одного или всех) элементов на произвольных
// позициях.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 10^4) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// Первая строка каждого набора входных данных содержит целое число n (1 ≤ n ≤ 2·10^5) —
// длина массива a.

// Вторая строка содержит n целых чисел a1, a2, …, a_n (1 ≤ a_i ≤ n) — элементы
// массива a.

// Гарантируется, что сумма значений n по всем наборам входных данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — длину самой длинной
// аккуратной подпоследовательности массива a.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 1
// 1
// 2
// 2 2
// 4
// 2 2 1 1
// 6
// 1 2 3 3 3 1
// 8
// 8 8 8 8 8 8 8 7
// 10
// 2 3 3 1 2 3 5 1 1 7
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 2
// 4
// 5
// 0
// 5
// ======================================================================

// Примечание
// В первом наборе входных данных весь массив [1] является аккуратным, потому что это блок.

// Во втором наборе входных данных весь массив [2, 2] является аккуратным, потому что это блок.

// В третьем наборе входных данных весь массив [2, 2, 1, 1] является аккуратным, потому что
// это конкатенация трёх блоков: [2, 2], [1] и [1].

// В четвёртом наборе входных данных одной из самых длинных аккуратных подпоследовательностей
// массива a является [1, 3, 3, 3, 1].

// В пятом наборе входных данных самой длинной аккуратной подпоследовательностью массива a
// является пустая подпоследовательность.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, res = 0;
    cin >> n;
    vector<int> a(n), dp(n + 1, 0);
    for (auto &i : a)
        cin >> i;

    for (int i = 0; i <= n; i++)
    {
        /* code */
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
