// B. Слияние множеств
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Вам даны n множеств S1, S2, …, S_n, где каждый элемент множества — это целое число
// от 1 до m.

// Вы хотите выбрать некоторые из множеств (возможно, ни одно или все), так чтобы
// каждое целое число от 1 до m было включено в по крайней мере одно из выбранных
// множеств.

// Вам нужно определить, существуют ли по крайней мере три способа выбрать множества.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 10^4) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// Первая строка каждого набора входных данных содержит два целых числа n и m
// (2 ≤ n ≤ 5·10^4, 1 ≤ m ≤ 10^5) — количество множеств и верхняя граница целых чисел
// в множествах.

// Затем следуют n строк, в i-й строке сначала содержится целое число l_i
// (1 ≤ l_i ≤ m) — размер множества S_i.

// Затем следуют l_i целых чисел S_{i,1}, S_{i,2}, …, S_{i,l_i} в той же строке
// (1 ≤ S_{i,1} < S_{i,2} < … < S_{i,l_i} ≤ m) — элементы множества S_i.

// Обозначим L = ∑_{i=1}^{n} l_i. Гарантируется, что:

// - Сумма n по всем наборам входных данных не превосходит 5·10^4;
// - Сумма m по всем наборам входных данных не превосходит 10^5;
// - Сумма L по всем наборам входных данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите «YES», если существуют по крайней мере
// три способа выбрать множества. В противном случае выведите «NO».

// Вы можете выводить каждую букву в любом регистре (строчную или заглавную). Например,
// строки «yEs», «yes», «Yes» и «YES» будут распознаны как положительные ответы.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 3 2
// 2 1 2
// 1 1
// 1 2
// 4 10
// 3 1 2 3
// 2 4 5
// 1 6
// 4 7 8 9 10
// 2 5
// 4 1 2 3 4
// 4 1 2 3 4
// 5 5
// 5 1 2 3 4 5
// 5 1 2 3 4 5
// 5 1 2 3 4 5
// 5 1 2 3 4 5
// 5 1 2 3 4 5
// 5 10
// 4 1 2 3 4
// 5 1 2 5 6 7
// 5 2 6 7 8 9
// 4 6 7 8 9
// 2 9 10
// 5 5
// 1 1
// 1 2
// 1 3
// 2 4 5
// 1 5
// ======================================================================
// Выходные данные
// ======================================================================
// YES
// NO
// NO
// YES
// YES
// NO
// ======================================================================

// Примечание
// В первом наборе входных данных существует 5 ≥ 3 возможных способов выбрать множества:

// - S1 — оба числа 1 и 2 включены в S1;
// - S1 и S2 — 1 включено в S1 и S2, а 2 включено в S1;
// - S1 и S3 — 1 включено в S1, а 2 включено в S1 и S3;
// - S2 и S3 — 1 включено в S2, а 2 включено в S3;
// - S1, S2 и S3 — 1 включено в S1 и S2, а 2 включено в S1 и S3.

// Обратите внимание, что выбирать только S2 недопустимо, так как 2 не включено в S2.

// Во втором наборе входных данных единственный способ — выбрать все множества.

// В третьем наборе входных данных число 5 не встречается ни в одном из множеств,
// поэтому нет способа выбрать множества.

// В четвёртом наборе входных данных выбор любого непустого набора множеств допустим,
// поэтому количество способов равно 2^5 − 1 = 31 ≥ 3.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, m;
    cin >> n >> m;
    vector<int> a(m, 0);
    vector<vector<int>> v(n);
    int t = 0;
    for (int i = 0; i < n; i++)
    {
        int x;
        cin >> x;
        for (int j = 0; j < x; j++)
        {
            int y;
            cin >> y;
            t += !a[--y];
            a[y]++;
            v[i].push_back(y);
        }
    }

    int ans = t == m;
    for (int i = 0; i < n; i++)
    {
        for (auto &x : v[i])
        {
            a[x]--;
            t -= !a[x];
        }
        ans += t == m;
        for (auto &x : v[i])
        {
            t += !a[x];
            a[x]++;
        }
    }
    cout << (ans >= 3 ? "YES\n" : "NO\n");
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
