// C. Blackslex и теория чисел
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Blackslex слишком усердно работал и начал видеть сны о числах. Решите следующую задачу из его снов.

// Вам дан массив a_1, a_2, …, a_n.

// В одной операции вы выбираете индекс i (1 ≤ i ≤ n) и целое число x, которое не меньше k, и присваиваете

//     a_i := a_i mod x,

// где u mod v обозначает остаток от деления u на v.

// Ваша цель — сделать все элементы массива одинаковыми. Среди всех положительных целых чисел k определите максимальное k,
// для которого существует конечная последовательность операций, которая делает все элементы массива равными.

// Входные данные
// Первая строка содержит одно целое число t (1 ≤ t ≤ 10^4) — количество наборов входных данных.

// Первая строка каждого набора входных данных содержит одно целое число n (2 ≤ n ≤ 2·10^5).

// Вторая строка содержит n целых чисел a_1, a_2, …, a_n (1 ≤ a_i ≤ 10^9, все значения a различны).

// Гарантируется, что сумма n по всем наборам входных данных не превышает 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — максимальное положительное целое число k,
// акое что возможно сделать все элементы массива одинаковыми, используя любое количество операций с модулями x, ограниченными k ≤ x.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 3
// 3
// 5 7 9
// 2
// 2 3
// 7
// 11 74 5 22 52 97 82
// ======================================================================
// Выходные данные
// ======================================================================
// 5
// 2
// 6
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;
    sort(a.begin(), a.end());
    cout << max(a[0], a[1] - a[0]) << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
