// C. Заменяй и суммируй
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Сегодня у KQ экзамен в академии Граиля. Строгий учитель дал задачу, с которой KQ
// не смог справиться. Ему дали два массива a и b длины n. KQ разрешается выполнять
// следующие операции на массивах:

// - Выбрать индекс i (1 ≤ i < n) и заменить a_i на a_{i+1}.
// - Выбрать индекс i (1 ≤ i ≤ n) и заменить a_i на b_i.

// Теперь ему дали q запросов. Каждый запрос описывается двумя числами l и r.
// Его задача — для каждого запроса найти максимальное значение суммы
// (a_l + a_{l+1} + … + a_r), если он может выполнить любое количество операций
// с любыми элементами массива. Поскольку он недостаточно умён для этого, он просит
// вас о помощи.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 10^4) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// Первая строка каждого набора входных данных содержит два целых числа n, q
// (1 ≤ n, q ≤ 2·10^5).

// Вторая строка каждого набора входных данных содержит n целых чисел a1, a2, …, a_n
// (1 ≤ a_i ≤ 10^4).

// Третья строка каждого набора входных данных содержит n целых чисел b1, b2, …, b_n
// (1 ≤ b_i ≤ 10^4).

// Следующие q строк содержат по два целых числа l и r (1 ≤ l ≤ r ≤ n).

// Гарантируется, что сумма значений n и сумма значений q по всем наборам входных
// данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите q чисел через пробел — максимальные
// значения сумм (a_l + a_{l+1} + … + a_r).

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 3 1
// 3 2 1
// 1 2 3
// 1 3
// 1 1
// 1
// 2
// 1 1
// 3 2
// 6 7 5
// 9 6 8
// 1 2
// 2 3
// 4 3
// 4 3 2 1
// 5 1 3 1
// 1 2
// 2 4
// 3 4
// ======================================================================
// Выходные данные
// ======================================================================
// 9
// 2
// 17 16
// 8 7 4
// ======================================================================

// Примечание
// Рассмотрим первый набор входных данных. Замените a3 на b3, a = [3, 2, 3].
// Замените a2 на a3, a = [3, 3, 3]. Сумма a1 + a2 + a3 = 9.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, q;
    cin >> n >> q;
    vector<int> a(n + 5, 0), b(n + 5), pref(n + 5, 0);

    for (int i = 1; i <= n; i++)
        cin >> a[i];
    for (int i = 1; i <= n; i++)
        cin >> b[i];

    for (int i = n; i > 0; --i)
        a[i] = max({a[i], b[i], a[i + 1]});

    for (int i = 1; i <= n; i++)
        pref[i] = pref[i - 1] + a[i];

    while (q--)
    {
        int l, r;
        cin >> l >> r;
        cout << pref[r] - pref[l - 1] << ' ';
    }
    cout << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
