// A. Игра с дробью
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// У Алисы и Боба есть два целых числа p и q, и они играют в игру с этими числами.
// Игроки ходят по очереди, Алиса ходит первой. В свой ход игрок может сделать одно
// из двух:

// - уменьшить p на единицу (действие возможно, если p > 0);
// - уменьшить q на единицу (действие возможно, если q > 1).

// Игра заканчивается, когда p = 0 и q = 1.

// Боб выигрывает, если в какой-то момент времени во время игры дробь p/q равна
// по значению дроби 2/3. Иначе выигрывает Алиса.

// По начальным значениям p и q определите победителя в такой игре, если оба игрока
// играют оптимально.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 10^4) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// Единственная строка каждого набора входных данных содержит два целых числа p и q
// (1 ≤ p, q ≤ 10^18).

// Выходные данные
// Для каждого набора входных данных выведите:

// - «Alice», если победит Алиса;
// - «Bob», если победит Боб.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 4 6
// 10 14
// 15 15
// 7 12
// 7000000000000000 10487275715782582
// 1000000000000000000 1000000000000000000
// ======================================================================
// Выходные данные
// ======================================================================
// Bob
// Bob
// Alice
// Alice
// Bob
// Alice
// ======================================================================

// Примечание
// В первом наборе входных данных дробь уже изначально равна по значению 2/3,
// поэтому выигрывает Боб.

// Во втором наборе входных данных один из вариантов игры следующий:

// - изначально p = 10, q = 14;
// - после хода Алисы p = 9, q = 14;
// - после хода Боба p = 9, q = 13;
// - после хода Алисы p = 9, q = 12;
// - после хода Боба p = 8, q = 12.

// Боб выигрывает, так как 8/12 равна по значению 2/3. Можно показать, что в этом
// примере, при оптимальной игре обоих игроков, всегда побеждает Боб.

// Для третьего набора входных данных оптимальной стратегией для Алисы будет уменьшать q,
// пока это возможно. В таком случае игра закончится в пользу Алисы независимо от
// действий Боба.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int p, q;
    cin >> p >> q;
    if (p < q && min(p / 2, q / 3) >= q - p)
        cout << "Bob\n";
    else
        cout << "Alice\n";
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
