// D. 67-я задача OEIS
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Macaque, будучи ужасным составителем задач, однажды решил поискать забавные
// последовательности на OEIS*, чтобы вдохновиться для своей обречённой работы по
// составлению задач для Панмлекопитающей олимпиады по информатике (PMOI). К своей
// радости, он нашёл одну и решил, что будет забавно заставить вас, своего верного
// тестировщика, решить её:

// Постройте последовательность a, содержащую n целых чисел, такую, что значения
// gcd(a_i, a_{i+1})† различны для всех 1 ≤ i ≤ n − 1. Гарантируется, что существует
// хотя бы одна такая последовательность a.

// * Online Encyclopedia of Integer Sequences — любимый сайт математических зануд,
//   чрезмерно проницательных тестировщиков и недостаточно строгих координаторов.

// † gcd(x, y) обозначает наибольший общий делитель целых чисел x и y.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 100) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// Следующие t строк содержат по одному целому числу n (2 ≤ n ≤ 10^4) — требуемую
// длину последовательности.

// Гарантируется, что сумма n по всем наборам входных данных не превышает 10^4.

// Выходные данные
// Для каждого запроса выведите ответ — последовательность a из n целых чисел,
// разделённых пробелами (1 ≤ a_i ≤ 10^18).

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 2
// 3
// 5
// ======================================================================
// Выходные данные
// ======================================================================
// 1 6 2
// 134 67 69 207 414
// ======================================================================

// Примечание
// В первом наборе входных данных последовательность [1, 6, 2] является возможным
// ответом. Это так, потому что gcd(1, 6) не равно gcd(6, 2).

// Во втором наборе входных данных последовательность [134, 67, 69, 207, 414]
// является возможным ответом. Это так, потому что значения gcd(a_i, a_{i+1})
// для всех i от 1 до n − 1 различны. Для справки, это 67, 1, 69 и 207.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    int k = 1;
    for (int i = 0; i < n; i++)
    {
        k += 2;
        cout << (k - 2) * k << ' ';
    }

    cout << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
