// B. Цифровая строка
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест512 мегабайт

// Дана строка s, состоящая из цифр от 1 до 4.

// Назовём строку красивой, если невозможно выбрать некоторые её элементы и выписать их
// в том же порядке, в котором они встречаются в строке, так, чтобы получилось число,
// кратное 4. Например, строки 31, 222, 213 — красивые, а 143, 3123, 1322 — нет.
// Пустая строка является красивой.

// Ваша задача — посчитать минимальное возможное количество элементов строки s,
// которые необходимо удалить, чтобы сделать её красивой.

// Входные данные
// В первой строке содержится одно целое число t (1 ≤ t ≤ 10^4) — количество наборов
// входных данных.

// Единственная строка каждого набора входных данных содержит строку s (1 ≤ |s| ≤ 3·10^5),
// состоящую из цифр от 1 до 4.

// Дополнительное ограничение на входные данные: сумма длин строк s по всем наборам
// входных данных не превосходит 3·10^5.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — минимальное возможное
// количество элементов строки s, которые необходимо удалить, чтобы сделать её красивой.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 4
// 13
// 3244123
// 24424224242
// 4132423432241231
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 0
// 4
// 5
// 9
// ======================================================================

// Примечание
// В первом примере нужно удалить всю строку.

// Во втором примере строка уже красивая.

// В третьем примере можно удалить 1-й, 3-й, 4-й и 6-й символы, в результате получится
// строка 213.

#include <bits/stdc++.h>
using namespace std;

#define int long long

// по условию задачи наша строка не должна иметь чисел ( подстрок ) делящихся на 4
// например 12 32 4 на не удовлетворяют
// если видим 4 ее сразу убираем т.к. она сразу делится на 4
// а с 12 и 32 можно заметить что что бы число делилось на 4 двойка долнжна находится после 1 и 3 то есть нечетных
// то есть нам нужно составлять строки из 2 слева и неченых цифр слева
// 22221313 и тд

void solve()
{
    string s;
    cin >> s;
    int le = s.size();
    int p = 0, su = 0;
    for (auto &i : s) // считаем все нечетные числа на префиксе
        if (i == '1' || i == '3')
            ++su;
    // теперь мы знаем о кол ве всех нечетных цифр

    int res = su;
    // идем слево направо и считаем 2 если встретили нечетное то вычитаем из суфикса
    // в самом начале после подсчета нечетных цифр 3244123 (313 по факту такое число имеем пока что ) su 3 p 0
    // ->3244123 (13) su 2 p 0
    // ->244123 (213) su 2 p 1
    // 2123 (213)     su 2 з 1  игнорим все 4 с ними мы ничего не делаем
    // 2->123 (23)    su 1 p 1
    // 2->23 (223)    su 1 p 3

    // По факту мы составляем строку которая нам будет подходить
    // берем самую длинную строку которую мы можем составить
    // и вычитаем из исходной нашу максимальную длину строки которую мы составили
    // и так получаем минимум удаленых эллементов
    for (auto &i : s)
    {
        if (i == '2')
            ++p;
        if (i == '1' || i == '3')
            --su;
        res = max(res, p + su);
    }
    cout << le - res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
