// A. Задача на НОК
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Несколько дней назад я узнал, что существует такая штука, как наименьшее общее
// кратное (НОК). Теперь я часто играю с этим понятием — хочу сделать большое число
// с помощью НОК.

// Но я не хочу использовать слишком много чисел, поэтому я выберу три целых
// положительных числа (необязательно различных), каждое из которых не превышает n.
// Помогите мне найти максимально возможное наименьшее общее кратное этих трёх целых
// чисел.

// Входные данные
// В первой строке записано целое число n (1 ≤ n ≤ 10^6) — переменная n из условия.

// Выходные данные
// Выведите единственное целое число — максимально возможное наименьшее общее кратное
// трёх необязательно различных целых чисел, которые не превышают n.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 9
// ======================================================================
// Выходные данные
// ======================================================================
// 504

// ======================================================================
// Входные данные
// ======================================================================
// 7
// ======================================================================
// Выходные данные
// ======================================================================
// 210
// ======================================================================

// Примечание
// Наименьшее общее кратное нескольких положительных целых чисел — это наименьшее
// положительное целое число, кратное им всем.

// Результат может получиться достаточно большим. Возможно, 32-битного целого числа
// не будет достаточно для его хранения. Поэтому рекомендуется использовать 64-битные
// целые числа.

// В последнем примере мы можем выбрать числа 7, 6, 5, их НОК равен 7·6·5 = 210.
// Это — максимальный НОК, который мы можем получить.

#include <bits/stdc++.h>
using namespace std;

#define int long long

int lcfunc(int a, int b) { return (a / gcd(a, b)) * b; }

int lcm3(int a, int b, int c) { return lcfunc(lcfunc(a, b), c); }

void solve()
{
    int n;
    cin >> n;
    int st = max(1LL, n - 5), res = 0;
    for (int i = st; i <= n; i++)
        for (int j = st; j <= n; j++)
            for (int k = st; k <= n; k++)
                res = max(res, lcm3(i, j, k));
    cout << res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
