// B. Хорошие последовательности
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Белка Лисска интересуется последовательностями. Также у неё есть предпочтения
// в целых числах. Она думает, что n целых чисел a1, a2, …, a_n являются хорошими.

// Теперь ей интересны хорошие последовательности. Последовательность x1, x2, …, x_k
// называется хорошей, если она удовлетворяет следующим трём условиям:

// - Последовательность строго возрастает, то есть x_i < x_{i+1} для всех i
//   (1 ≤ i ≤ k − 1).
// - Никакие два соседних элемента не являются взаимно простыми, то есть
//   gcd(x_i, x_{i+1}) > 1 для всех i (1 ≤ i ≤ k − 1) (где gcd(p, q) обозначает
//   наибольший общий делитель чисел p и q).
// - Все элементы данной последовательности являются хорошими целыми числами.

// Найдите длину самой длинной хорошей последовательности.

// Входные данные
// Входные данные состоят из двух строк. Первая строка содержит единственное целое
// число n (1 ≤ n ≤ 10^5) — количество хороших целых чисел. Во второй строке задан
// список хороших целых чисел a1, a2, …, a_n через пробел, в порядке строгого
// возрастания (1 ≤ a_i ≤ 10^5; a_i < a_{i+1}).

// Выходные данные
// Выведите единственное целое число — длину самой длинной хорошей последовательности.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 2 3 4 6 9
// ======================================================================
// Выходные данные
// ======================================================================
// 4

// ======================================================================
// Входные данные
// ======================================================================
// 9
// 1 2 3 5 6 7 8 9 10
// ======================================================================
// Выходные данные
// ======================================================================
// 4
// ======================================================================

// Примечание
// В первом примере следующие последовательности являются примерами хороших
// последовательностей: [2; 4; 6; 9], [2; 4; 6], [3; 9], [6]. Длина самой длинной
// хорошей последовательности — 4.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    vector<int> dp(1e6, 0);
    int res = 0;
    for (auto &i : a)
    {
        cin >> i;
        if (i == 1)
            continue;

        vector<int> primes_i;
        int ti = i;
        for (int c = 2; c * c <= ti; c++)
        {
            if (ti % c == 0)
            {
                primes_i.push_back(c);
                while (ti % c == 0)
                    ti /= c;
            }
        }
        if (ti > 1)
            primes_i.push_back(ti);
        int curmx = 0;
        for (auto &p : primes_i)
            curmx = max(curmx, dp[p]);
        for (auto &p : primes_i)
            dp[p] = curmx + 1;
    }

    cout << (n == 1 ? 1 : *max_element(dp.begin(), dp.end()));
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
