// A. Камни на столе
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// На столе в ряд выложены n камней, каждый из которых может быть красного, зелёного
// или синего цвета. Посчитайте, какое минимальное количество камней нужно убрать со стола,
// чтобы любые два соседних камня имели разные цвета. Камни в ряду считаются соседними,
// если между ними нет других камней.

// Входные данные
// В первой строке задано целое число n (1 ≤ n ≤ 50) — количество камней на столе.

// В следующей строке задана строка s, обозначающая цвета камней. Будем считать, что
// камни в ряду пронумерованы целыми числами от 1 до n слева направо. Тогда i-й символ
// s равен «R», если i-й камень красного цвета, «G» — если он зелёного цвета, и «B» —
// если он синего цвета.

// Выходные данные
// Выведите единственное целое число — ответ на задачу.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 3
// RRG
// ======================================================================
// Выходные данные
// ======================================================================
// 1

// ======================================================================
// Входные данные
// ======================================================================
// 5
// RRRRR
// ======================================================================
// Выходные данные
// ======================================================================
// 4

// ======================================================================
// Входные данные
// ======================================================================
// 4
// BRBG
// ======================================================================
// Выходные данные
// ======================================================================
// 0
// ======================================================================

#include <bits/stdc++.h> // Подключает сразу все библиотеки C++
using namespace std;

#define int long long // Защита от переполнения int (из-за этого часто горят баллы)

void solve()
{
    string s;
    int t;
    cin >> t >> s;
    int c = 0;
    for (int i = 0; i < t - 1; i++)
    {
        if (s[i] == s[i + 1])
            c++;
    }
    cout << c;
}

int32_t main()
{
    // Включаем супер-быстрый ввод-вывод для C++
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
