// B. Правильная скобочная подпоследовательность
// ограничение по времени на тест5 seconds
// ограничение по памяти на тест256 megabytes

// Напомним, что скобочная последовательность называется правильной, если путём вставки
// в неё символов «+» и «1» можно получить из неё корректное математическое выражение.
// Например, последовательности «(())()», «()» и «(()(()))» — правильные, в то время
// как «)(», «(()» и «(()))(» — нет.

// Однажды Васе попалась скобочная последовательность. Он решил удалить из неё некоторые
// скобки так, чтобы последовательность стала правильной. Какую наибольшую длину может
// иметь получившаяся правильная скобочная последовательность?

// Входные данные
// В первой строке входного файла записана непустая строка, состоящая из символов «(»
// и «)». Её длина не превосходит 10^6.

// Выходные данные
// Выведите длину наибольшей правильной скобочной подпоследовательности.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// (()))(
// ======================================================================
// Выходные данные
// ======================================================================
// 4

// ======================================================================
// Входные данные
// ======================================================================
// ((()())
// ======================================================================
// Выходные данные
// ======================================================================
// 6
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int res = 0, n = 0;
    string s;
    cin >> s;
    for (auto &i : s)
    {
        if (i == '(')
            n += 1;
        else if (n)
        {
            n--;
            res += 2;
        }
    }
    cout << res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
