// B. Девочка и игра
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Девочка очень любит задачи про игры. Вот одна из них.

// У двух игроков есть строка s, состоящая из строчных букв латинского алфавита.
// Они играют в игру, которая описывается следующими правилами:

// - Игроки ходят по очереди.
// - За один ход игрок может удалить из строки s произвольную букву.
// - Если игрок перед своим ходом может перемешать буквы в строке s таким образом,
//   чтобы получился палиндром, этот игрок побеждает. Палиндром — строка, которая
//   одинаково читается в обоих направлениях. Например, строка «abba» — палиндром,
//   а строка «abc» — нет.

// Определите, кто из игроков победит при оптимальной игре обеих сторон — тот,
// кто ходит первым, или тот, кто ходит вторым.

// Входные данные
// Во входных данных содержится единственная строка. Единственная строка содержит
// строку s (1 ≤ |s| ≤ 10^3). Строка s состоит из строчных букв латинского алфавита.

// Выходные данные
// В единственной строке выведите слово «First» в случае, если при оптимальной игре
// обоих игроков победит первый игрок. Иначе выведите слово «Second». Слова выводите
// без кавычек.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// aba
// ======================================================================
// Выходные данные
// ======================================================================
// First

// ======================================================================
// Входные данные
// ======================================================================
// abca
// ======================================================================
// Выходные данные
// ======================================================================
// Second
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    string s;
    cin >> s;
    map<char, int> m;
    for (auto &i : s)
        m[i]++;
    int nechetcnt = 0;
    for (auto &[c, cnt] : m)
        nechetcnt += cnt % 2 != 0;
    cout << (nechetcnt % 2 != 0 || nechetcnt == 0 ? "First\n" : "Second\n");
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
