// A. Изучение языков
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// В компании «BerCorp» работает n сотрудников. Для официальной переписки утверждено m
// языков, пронумерованных целыми числами от 1 до m. Для каждого сотрудника известно,
// какие языки он знает. Возможно даже, что человек не знает ни одного официального
// языка. Но работники готовы выучить любое количество языков, если только компания
// оплатит им обучение. Стоимость курса изучения одного языка для одного сотрудника
// составляет 1 бердоллар.

// Определите, какую минимальную сумму денег придётся затратить компании, чтобы любой
// сотрудник мог обратиться к любому другому, возможно, не напрямую (то есть, привлекая
// других сотрудников для перевода).

// Входные данные
// В первой строке записано два целых числа n и m (2 ≤ n, m ≤ 100) — количество
// сотрудников и количество языков.

// Далее следует n строк — списки языков для каждого работника. В начале i-ой строки
// записано целое число k_i (0 ≤ k_i ≤ m) — количество языков, которые знает i-ый
// сотрудник. Далее в i-ой строке записано k_i целых чисел — a_{ij} (1 ≤ a_{ij} ≤ m) —
// номера языков, которые знает i-ый сотрудник. Гарантируется, что все номера в одном
// списке различны. Обратите внимание, что сотрудник может не знать ни одного языка.

// Числа в строках разделяются одиночными пробелами.

// Выходные данные
// Выведите единственное целое число — наименьшее количество денег, которое придётся
// заплатить, чтобы каждый мог написать письмо каждому (возможно, привлекая других
// для перевода).

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5 5
// 1 2
// 2 2 3
// 2 3 4
// 2 4 5
// 1 5
// ======================================================================
// Выходные данные
// ======================================================================
// 0

// ======================================================================
// Входные данные
// ======================================================================
// 8 7
// 0
// 3 1 2 3
// 1 1
// 2 5 4
// 2 6 7
// 1 3
// 2 7 4
// 1 1
// ======================================================================
// Выходные данные
// ======================================================================
// 2

// ======================================================================
// Входные данные
// ======================================================================
// 2 2
// 1 2
// 0
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// ======================================================================

// Примечание
// Во втором примере сотрудник с номером 1 может выучить язык с номером 2, а сотрудник
// с номером 8 — язык с номером 4.

// В третьем примере сотруднику с номером 2 нужно выучить язык с номером 2.

#include <bits/stdc++.h>
using namespace std;

#define int long long

struct DSU
{
    DSU(int s, int s2)
    {
        parents.resize(s);
        p2.resize(s2);
        for (int i = 0; i < s; i++)
            parents[i] = i;
    }

    int find(int v)
    {
        if (v == parents[v])
            return v;
        return parents[v] = find(parents[v]);
    }

    void unite(int l, int r)
    {
        int pl = find(l), pr = find(r);
        if (pl != pr)
        {
            parents[pl] = pr;
        }
    }

    void add(int x, int i)
    {
        p2[x] = i;
    }

    vector<int> parents, p2;
};

void solve()
{
    int n, m;
    cin >> n >> m;
    DSU d(m, n);
    vector<int> gr(n, -1);
    for (int i = 0; i < n; i++)
    {
        int k;
        cin >> k;
        vector<int> a(k);
        for (auto &j : a)
        {
            cin >> j;
            j--;
        }
        // d.p2[i] = i;
        if (a.size() > 0)
            gr[i] = a[0];
        for (int j = 1; j < k; j++)
            d.unite(a[j - 1], a[j]);
    }
    int res = 0;
    set<int> cnt;
    for (int i = 0; i < n; i++)
    {
        if (gr[i] != -1)
            cnt.insert(d.parents[d.find(gr[i])]);
        else
            res++;
    }
    cout << cnt.size() + res - (cnt.size() > 0);
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
