// E. Число с заданным количеством делителей
// ограничение по времени на тест2 seconds
// ограничение по памяти на тест256 megabytes

// Найдите наименьшее натуральное число, имеющее заданное количество делителей.
// Гарантируется, что ответ не превосходит 10^18.

// Входные данные
// В первой строке записано целое число n (1 ≤ n ≤ 1000).

// Выходные данные
// Выведите наименьшее число, имеющее ровно n делителей.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 4
// ======================================================================
// Выходные данные
// ======================================================================
// 6

// ======================================================================
// Входные данные
// ======================================================================
// 6
// ======================================================================
// Выходные данные
// ======================================================================
// 12
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

// m = (p ^ a) * (p1 ^ a1) * (p2 ^ a2) ...
// n = (a + 1) * (a1 + 1) * (a2 + 1) ...

void solve()
{
    const int primes[10] = {2, 3, 5, 7, 11, 13, 17, 19, 23, 29};
    const int INF = 2e18, LIMIT = 1e18;
    // 2 ^ 9 < 1000
    // 2 ^ 10 > 1000
    // а остальные числа в 10 степени и подавно больше 1000
    int n;
    cin >> n;
    if (n < 3)
    {
        cout << n;
        return;
    }

    vector<vector<unsigned int>> dp(n + 1, vector<unsigned int>(11, INF));
    for (int i = 0; i <= 10; i++)
    {
        dp[1][i] = 1;
    }

    // перебор простых чисел
    for (int j = 1; j <= 10; j++)
    {
        int cur_prime = primes[j - 1];
        for (int i = 1; i <= n; i++)
        {
            dp[i][j] = dp[i][j - 1];

            int pa = 1; // p ^ a
            for (int a = 1; a <= 64; a++)
            {
                if (LIMIT / cur_prime < pa)
                    break;
                pa *= cur_prime;

                if (i % (a + 1) != 0)
                    continue;

                int prev_i = i / (a + 1);
                if (dp[prev_i][j - 1] == INF)
                    continue;

                unsigned int v = dp[prev_i][j - 1] * pa;
                if (v < LIMIT)
                    dp[i][j] = min(dp[i][j], v);
            }
        }
    }
    cout << dp[n][10];
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}