// A. Капитализация слова
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Капитализация — это запись слова, в которой первая буква слова записывается как
// прописная буква. Ваша задача — вывести капитализацию заданного слова.

// Обратите внимание, что в капитализации все буквы слова кроме первой остаются
// не изменёнными.

// Входные данные
// В первой строке записано непустое слово. Слово состоит из строчных и прописных
// букв латинского алфавита. Длина заданного слова не превосходит 10^3 букв.

// Выходные данные
// Выведите капитализацию слова.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// ApPLe
// ======================================================================
// Выходные данные
// ======================================================================
// ApPLe

// ======================================================================
// Входные данные
// ======================================================================
// konjac
// ======================================================================
// Выходные данные
// ======================================================================
// Konjac
// ======================================================================

#include <bits/stdc++.h> // Подключает сразу все библиотеки C++
using namespace std;

#define int long long // Защита от переполнения int (из-за этого часто горят баллы)

void solve()
{
    string s;
    cin >> s;
    s[0] = toupper(s[0]);
    cout << s;
}

int32_t main()
{
    // Включаем супер-быстрый ввод-вывод для C++
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
