// B. Егор и граф
// ограничение по времени на тест3 секунды
// ограничение по памяти на тест256 мегабайт

// У Егора есть взвешенный ориентированный граф, состоящий из n вершин. В этом графе
// между любой парой различных вершин есть ребро в обоих направлениях. Егор любит
// играть с графом, и сейчас он придумал новую игру:

// - Игра состоит из n шагов.
// - На i-том шаге Егор удаляет из графа вершину номер x_i. Удаляя вершину, Егор
//   удаляет все рёбра, которые входили в данную вершину и которые выходили из неё.
// - Перед выполнением каждого шага Егор хочет знать сумму длин кратчайших путей
//   между всеми парами оставшихся вершин. Кратчайший путь может проходить через любую
//   оставшуюся вершину. Другими словами, если обозначить как d(i, v, u) кратчайший путь
//   между вершинами v и u в графе, который получился до удаления вершины x_i,
//   то Егор хочет знать значение следующей суммы: ∑ d(i, v, u).

// Помогите Егору, выведите значение искомой суммы перед каждым шагом.

// Входные данные
// В первой строке содержится целое число n (1 ≤ n ≤ 500) — количество вершин в графе.

// В следующих n строках содержится по n целых чисел — матрица смежности графа:
// j-тое число в i-той строке a_{ij} (1 ≤ a_{ij} ≤ 10^5, a_{ii} = 0) обозначает вес
// ребра, ведущего из вершины i в вершину j.

// В следующей строке содержится n различных целых чисел: x1, x2, …, xn
// (1 ≤ x_i ≤ n) — вершины, которые удаляет Егор.

// Выходные данные
// Выведите n целых чисел — i-тое число равно искомой сумме перед i-тым шагом.

// Пожалуйста, не используйте спецификатор %lld для чтения или записи 64-битных чисел
// на C++. Рекомендуется использовать потоки cin, cout или спецификатор %I64d.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 1
// 0
// 1
// ======================================================================
// Выходные данные
// ======================================================================
// 0

// ======================================================================
// Входные данные
// ======================================================================
// 2
// 0 5
// 4 0
// 1 2
// ======================================================================
// Выходные данные
// ======================================================================
// 9 0

// ======================================================================
// Входные данные
// ======================================================================
// 4
// 0 3 1 1
// 6 0 400 1
// 2 4 0 1
// 1 1 1 0
// 4 1 2 3
// ======================================================================
// Выходные данные
// ======================================================================
// 17 23 404 0
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

const int INF = 1e18;

void solve()
{
    int n;
    cin >> n;
    vector<vector<int>> inpt_dist(n, vector<int>(n)); //, dist(n, vector<int>(n, INF));
    for (auto &i : inpt_dist)
        for (auto &j : i)
            cin >> j;

    // for (int i = 0; i < n; i++)
    //     dist[i][i] = 0;

    vector<int> inpt(n), result;
    for (auto &i : inpt)
    {
        cin >> i;
        i--;
    }
    reverse(inpt.begin(), inpt.end());
    vector<bool> okvertex(n, 0);

    for (int i = 0; i < n; i++)
    {
        okvertex[inpt[i]] = 1;
        int cnt = 0;
        for (int u = 0; u < n; u++)
            for (int v = 0; v < n; v++)
                if (inpt_dist[u][inpt[i]] != INF && inpt_dist[inpt[i]][v] != INF)
                    inpt_dist[u][v] = min(inpt_dist[u][v], inpt_dist[u][inpt[i]] + inpt_dist[inpt[i]][v]);
        for (int u = 0; u < n; u++)
            for (int v = 0; v < n; v++)
                if (okvertex[v] && okvertex[u])
                    cnt += inpt_dist[u][v];
        result.push_back(cnt);
    }

    for (auto i = result.rbegin(); i != result.rend(); i++)
        cout << *i << ' ';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
