// A. Победитель
// ограничение по времени на тест1 second
// ограничение по памяти на тест64 megabytes

// Победитель популярной в Берляндии карточной игры «Берлоггинг» определяется
// по следующим правилам. Если на момент окончания игры существует только один игрок,
// набравший максимальное количество очков, то он и становится победителем.

// Ситуация осложняется, если таких игроков несколько. Каждый кон игры некоторый игрок
// выигрывает или проигрывает некоторое количество очков. В записи о ходе игры это
// обозначается строкой «name score», где name — это имя игрока, а score — целое число,
// обозначающее количество заработанных очков данным игроком. Если score —
// отрицательное число, это обозначает, что игрок проиграл в этом коне. Так вот, если
// на конец игры несколько игроков набрали максимум очков (пусть это число равно m),
// то выигрывает тот из них, кто первым набрал как минимум m очков. Перед началом игры
// у каждого игрока 0 очков. Гарантируется, что на момент окончания игры хотя бы у одного
// игрока положительное число очков.

// Входные данные
// В первой строке записано целое число n (1 ≤ n ≤ 1000) — количество конов сыгранной
// игры. Далее в n строках идут описания конов в формате «name score» в хронологическом
// порядке, где name — это строка из строчных букв латинского алфавита длины от 1 до 32,
// а score — это целое число от -1000 до 1000 включительно.

// Выходные данные
// Выведите имя победителя игры «Берлоггинг».

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 3
// mike 3
// andrew 5
// mike 2
// ======================================================================
// Выходные данные
// ======================================================================
// andrew

// ======================================================================
// Входные данные
// ======================================================================
// 3
// andrew 3
// andrew 2
// mike 5
// ======================================================================
// Выходные данные
// ======================================================================
// andrew
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<pair<string, int>> a(n);
    map<string, int> m, m2;
    string winner1, winner2;
    int maxresult = -1e18;
    for (int i = 0; i < n; i++)
    {
        string s;
        int bal;
        cin >> s >> bal;
        m[s] += bal;
        a[i] = {s, bal};
    }
    for (auto &i : m)
        maxresult = max(maxresult, i.second);
    int cnt = 0;
    for (auto &[s, bal] : a)
    {
        m2[s] += bal;
        if (m2[s] >= maxresult && m[s] == maxresult)
        {
            if (!cnt)
                winner1 = s;
            winner2 = s;
            cnt++;
        }
    }

    cout << (cnt == 1 ? winner2 : winner1);
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
