// A. Массив
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// У Виталия есть массив из n различных целых чисел. Виталий хочет разделить этот
// массив на три непустых множества так, чтобы были выполнены условия:

// - Значение произведения всех чисел в первом множестве было меньше нуля (< 0).
// - Значение произведения всех чисел во втором множестве было больше нуля (> 0).
// - Произведение всех чисел в третьем множестве было равно нулю.

// Каждое число из исходного массива должно находиться ровно в одном из множеств.

// Помогите Виталию. Разделите заданный массив.

// Входные данные
// В первой строке входных данных записано целое число n (3 ≤ n ≤ 100). Во второй строке
// через пробел записаны n различных целых чисел a1, a2, …, a_n (|a_i| ≤ 10^3) —
// элементы массива.

// Выходные данные
// В первой строке выведите целое число n1 (n1 > 0) — количество чисел в первом
// множестве. Далее выведите n1 чисел — числа, которые попали в первое множество.

// В следующей строке выведите целое число n2 (n2 > 0) — количество чисел во втором
// множестве. Далее выведите n2 чисел — числа, которые попали во второе множество.

// В следующей строке выведите целое число n3 (n3 > 0) — количество чисел в третьем
// множестве. Далее выведите n3 чисел — числа, которые попали в третье множество.

// Выведенные множества должны удовлетворять описанным условиям. Гарантируется,
// что решение существует. Если существует несколько решений, разрешается вывести
// любое.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 3
// -1 2 0
// ======================================================================
// Выходные данные
// ======================================================================
// 1 -1
// 1 2
// 1 0

// ======================================================================
// Входные данные
// ======================================================================
// 4
// -1 -2 -3 0
// ======================================================================
// Выходные данные
// ======================================================================
// 1 -1
// 2 -3 -2
// 1 0
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void print(list<int> &a)
{
    cout << a.size() << ' ';
    for (auto &i : a)
        cout << i << ' ';
    cout << '\n';
}

void solve()
{
    int n;
    cin >> n;
    list<int> a, b, c;
    for (int i = 0; i < n; i++)
    {
        int x;
        cin >> x;
        if (x < 0)
            a.push_back(x);
        else if (x > 0)
            b.push_back(x);
        else
            c.push_back(x);
    }
    if (b.size() == 0 && a.size() > 2)
    {
        for (int i = 0; i < 2; i++)
        {
            int t = a.back();
            a.pop_back();
            b.push_back(t);
        }
    }
    if (a.size() % 2 == 0)
    {
        int t = a.back();
        a.pop_back();
        c.push_back(t);
    }

    print(a);
    print(b);
    print(c);
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
