// B. Илья и запросы
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Лев Илья хочет помочь всем своим друзьям со сдачей экзаменов. Чтобы сдать экзамен
// по информатике, нужно решить следующую задачу.

// Даны строка s = s1 s2 … s_n (n — длина строки), состоящая только из символов «.»
// и «#», и m запросов. Каждый запрос описывается парой целых чисел l_i, r_i
// (1 ≤ l_i < r_i ≤ n). Ответ на запрос l_i, r_i — это количество таких целых чисел i
// (l_i ≤ i < r_i), что s_i = s_{i+1}.

// Лев Илья хочет помочь друзьям, но кто же поможет ему. Помогите Льву Илье, решите
// задачу.

// Входные данные
// В первой строке записана строка s длины n (2 ≤ n ≤ 10^5). Гарантируется, что
// заданная строка состоит только из символов «.» и «#».

// В следующей строке записано целое число m (1 ≤ m ≤ 10^5) — количество запросов.
// В каждой из следующих m строк записано описание соответствующего запроса.
// В i-й строке записаны целые числа l_i, r_i (1 ≤ l_i < r_i ≤ n).

// Выходные данные
// Выведите m целых чисел — ответы на запросы в том порядке, в котором запросы заданы
// во входных данных.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// ......
// 4
// 3 4
// 2 3
// 1 6
// 2 6
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 1
// 5
// 4

// ======================================================================
// Входные данные
// ======================================================================
// #..###
// 5
// 1 3
// 5 6
// 1 5
// 3 6
// 3 4
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 1
// 2
// 2
// 0
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    string s;
    cin >> s;
    int q, n = s.size();
    vector<int> a(n + 1, 0);
    for (int i = 1; i < n; i++)
        a[i + 1] = a[i] + (s[i - 1] == s[i]);
    // for (auto &i : a)
    //     cout << i << ' ';

    cin >> q;
    while (q--)
    {
        int l, r;
        cin >> l >> r;
        cout << a[r] - a[l] << '\n';
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
