// A. Игра с переворачиванием
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Яхубу стало скучно, и он придумал игру, в которую надо играть на бумаге.

// Яхуб выписывает n целых чисел a1, a2, …, a_n. Каждое из этих целых чисел может быть
// равно 0 или 1. Ему разрешено выполнить ровно одно действие: выбрать два индекса i и j
// (1 ≤ i ≤ j ≤ n) и перевернуть все значения a_k, позиции которых находятся на отрезке
// [i, j] (то есть i ≤ k ≤ j). Перевернуть значение x, значит выполнить операцию
// x = 1 − x.

// Цель игры — получить максимальное количество единиц после ровно одного хода.
// Напишите программу, которая решает маленькую игру Яхуба.

// Входные данные
// В первой строке содержится целое число n (1 ≤ n ≤ 100). Во второй строке записано
// n целых чисел: a1, a2, …, a_n. Гарантируется, что каждое из этих n чисел равняется
// либо 0, либо 1.

// Выходные данные
// Выведите целое число — максимальное количество единиц, которое можно получить
// после ровно одного хода.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 1 0 0 1 0
// ======================================================================
// Выходные данные
// ======================================================================
// 4

// ======================================================================
// Входные данные
// ======================================================================
// 4
// 1 0 0 1
// ======================================================================
// Выходные данные
// ======================================================================
// 4
// ======================================================================

// Примечание
// В первом случае надо перевернуть отрезок от 2 до 5 (i = 2, j = 5). Такой переворот
// превращает последовательность в: [1 1 1 0 1]. Итого, в ней теперь четыре единицы.
// Мы никак не сможем превратить последовательность в [1 1 1 1 1].

// Во втором случае, если мы перевернём только второй и третий элементы (i = 2, j = 3),
// все числа будут равны 1.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, s = 0, res = 0;
    cin >> n;
    vector<int> a(n), pref(n + 1, 0);
    for (int i = 0; i < n; i++)
    {
        cin >> a[i];
        s += a[i];
        pref[i + 1] = pref[i] + a[i];
    }

    for (int le = 1; le <= n; le++)
    {
        for (int start = 0; start + le <= n; start++)
        {
            int t = pref[start + le] - pref[start];
            res = max(res, (le - t) + s - t);
        }
    }
    cout << res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
