// A. Очередь в кино
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Только-только вышел новый фильм про «Крепкого орешка», а у кассы за билетами в кино
// n человек уже выстроились в огромную очередь. Каждый из них имеет только одну купюру
// номиналом 100, 50 или 25 рублей. Билет на «Крепкого орешка» стоит 25 рублей. Сможет ли
// кассир, обслуживающий очередь, продать каждому билет и выдать сдачу, если изначально
// в кассе нет денег и кассир продаёт билеты строго в порядке очереди?

// Входные данные
// В первой строке записано целое число n (1 ≤ n ≤ 10^5) — количество людей в очереди.
// В следующей строке записаны n целых чисел, каждое из которых равно 25, 50 или 100 —
// номиналы купюр у людей. Числа заданы в порядке от начала очереди (от кассы) к концу
// очереди.

// Выходные данные
// Выведите «YES» (без кавычек), если кассир сможет продать билет каждому и выдать сдачу,
// или «NO» (без кавычек) иначе.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 25 25 50 50
// ======================================================================
// Выходные данные
// ======================================================================
// YES

// ======================================================================
// Входные данные
// ======================================================================
// 2
// 25 100
// ======================================================================
// Выходные данные
// ======================================================================
// NO

// ======================================================================
// Входные данные
// ======================================================================
// 4
// 50 50 25 25
// ======================================================================
// Выходные данные
// ======================================================================
// NO
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    bool ok = 1;
    int m25 = 0, m50 = 0, m100 = 0;
    for (int i = 0; i < n; i++)
    {
        int a;
        cin >> a;

        if (a == 25)
            m25++;
        else if (a == 50)
        {
            ok = ok && m25-- > 0;
            m50++;
        }
        else
        {
            if (m50 > 0 && m25 > 0)
            {
                m50--;
                m25--;
            }
            else if (m25 > 2)
            {
                m25 -= 3;
            }
            else
                ok = 0;
        }
    }
    cout << (ok ? "YES" : "NO");
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}