// B. Раскраска забора
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Игорь влюбился в Таню. Чтобы показать, насколько сильно он её любит, Игорь хочет
// написать на заборе число напротив дома Тани. Игорь считает, что чем больше число
// он напишет, тем больше у него шансов покорить Таню.

// К сожалению, Игорь смог добыть только v литров краски. Сделав расчёты, Игорь решил,
// что на цифру d ему понадобится a_d литров краски. К тому же до Игоря дошли слухи,
// что Таня терпеть не может нули. Поэтому Игорь не будет их использовать в написании
// числа.

// Помогите Игорю определить максимальное число, которое он может написать на заборе.

// Входные данные
// В первой строке записано целое число v (0 ≤ v ≤ 10^6). Во второй строке записано
// девять положительных целых чисел a1, a2, ..., a9 (1 ≤ a_i ≤ 10^5).

// Выходные данные
// Выведите самое большое число, которое удастся написать Игорю на заборе. Если краски
// не хватит ни на одну цифру (Игорь не сможет ничего написать), выведите -1.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 5 4 3 2 1 2 3 4 5
// ======================================================================
// Выходные данные
// ======================================================================
// 55555

// ======================================================================
// Входные данные
// ======================================================================
// 2
// 9 11 1 12 5 8 9 10 6
// ======================================================================
// Выходные данные
// ======================================================================
// 33

// ======================================================================
// Входные данные
// ======================================================================
// 0
// 1 1 1 1 1 1 1 1 1
// ======================================================================
// Выходные данные
// ======================================================================
// -1
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long
#define all(a) a.begin(), a.end()
#define forr(i, n) for (int i = 0; i < n; i++)

void solve()
{
    int p;
    cin >> p;
    vector<int> a(9);
    for (auto &i : a)
        cin >> i;
    int mn = 1e18;
    char ch = ' ';
    forr(i, 9)
    {
        if (a[i] <= mn)
        {
            mn = a[i];
            ch = (i + 1) + '0';
        }
    }

    int l = p / mn;
    if (l == 0)
    {
        cout << -1;
        return;
    }
    string s(l, ch);
    int rem = p - mn * l;
    for (int i = 0; i < l; i++)
    {
        for (int j = 1; j <= 9; j++)
        {
            if (a[j - 1] <= rem + a[(s[i] - '0') - 1])
            {
                rem -= a[j - 1] - a[(s[i] - '0') - 1];
                s[i] = j + '0';
            }
        }
    }
    cout << s;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
