// B. Забор
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Перед домом Поликарпа находится забор, который состоит из n одинаковых по ширине
// досок, расположенных одна за другой слева направо. Высота i-й доски составляет h_i
// метров, разные доски могут иметь различные высоты.

// Забор для n = 7 и h = [1, 2, 6, 1, 1, 7, 1] (иллюстрация в оригинале).

// Поликарп приобрёл рояль и теперь ищет наилучший способ занести рояль в свой дом.
// Для того чтобы осуществить задуманное, ему придётся выломать ровно k подряд идущих
// досок в заборе. Так как высокие доски выламывать сложнее, Поликарп хочет найти
// такие k последовательных досок, что сумма их высот минимальна.

// Напишите программу, которая найдёт номера k последовательных досок с наименьшей
// суммой высот. Обратите внимание, забор не окружает дом Поликарпа, а находится
// перед ним (другими словами, забор не зациклен).

// Входные данные
// В первой строке входных данных содержатся целые числа n и k (1 ≤ n ≤ 1.5·10^5,
// 1 ≤ k ≤ n) — количество досок в заборе и ширина проёма для рояля. Вторая строка
// содержит последовательность целых чисел h1, h2, …, h_n (1 ≤ h_i ≤ 100),
// где h_i — высота i-й доски забора.

// Выходные данные
// Выведите такое j, что сумма высот досок j, j + 1, …, j + k − 1 — наименьшая
// возможная. Если таких j несколько, то выведите любое из них.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 7 3
// 1 2 6 1 1 7 1
// ======================================================================
// Выходные данные
// ======================================================================
// 3
// ======================================================================

// Примечание
// В примере требуется найти три последовательные доски с минимальной суммой высот.
// В данном случае три доски с номерами 3, 4 и 5 обладают требуемым свойством
// и имеют суммарную высоту 8.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, k;
    cin >> n >> k;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;
    int l = 0, r = 0, s = 1e10, cur_s = 0, res = 0;
    while (r < n)
    {
        while (r - l >= k)
            cur_s -= a[l++];
        while (r - l < k)
            cur_s += a[r++];

        if (cur_s < s)
        {
            s = min(s, cur_s);
            res = l + 1;
        }
        // r++;
    }
    cout << res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
