// B. Сережа и суффиксы
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// У Сережи есть массив a, состоящий из n целых чисел a1, a2, …, a_n. Мальчику не сидится
// на месте, и он решил заняться изучением массива. Сережа выписал на листочек m целых
// чисел l1, l2, …, l_m (1 ≤ l_i ≤ n). Для каждого числа l_i он хочет узнать: сколько
// есть различных чисел среди чисел a_{l_i}, a_{l_i+1}, …, a_n?

// Сережа выписывал и выписывал нужные элементы массива, но массив был большой,
// а времени у Сережи мало. Помогите ему, найдите ответ на описанный вопрос для каждого l_i.

// Входные данные
// Первая строка содержит два целых числа n и m (1 ≤ n, m ≤ 10^5). Во второй строке
// содержится n целых чисел a1, a2, …, a_n (1 ≤ a_i ≤ 10^5) — элементы массива.

// В следующих m строках записаны целые числа l1, l2, …, l_m. В i-й строке записано
// целое число l_i (1 ≤ l_i ≤ n).

// Выходные данные
// Выведите m строк — в i-й строке выведите ответ для числа l_i.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 10 10
// 1 2 3 4 1 2 3 4 100000 99999
// 1
// 2
// 3
// 4
// 5
// 6
// 7
// 8
// 9
// 10
// ======================================================================
// Выходные данные
// ======================================================================
// 6
// 6
// 6
// 6
// 6
// 5
// 4
// 3
// 2
// 1
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, m;
    cin >> n >> m;
    vector<int> a(n), b(n);
    for (auto &i : a)
        cin >> i;
    unordered_set<int> unset;
    for (int i = n - 1; i >= 0; --i)
    {
        unset.insert(a[i]);
        b[i] = unset.size();
    }
    while (m--)
    {
        int l;
        cin >> l;
        cout << b[l - 1] << '\n';
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
