// C. Команда
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Вот и подошёл черёд олимпиад. Ваня и Егор решили создать свою команду для участия
// в олимпиаде по программированию. Поскольку они с первого класса вместе, есть надежда,
// что это хоть как-то поможет ребятам в командной работе.

// На каждую командную олимпиаду Ваня берёт свои игровые карточки с числами. Он берёт
// карточки исключительно с числами 1 и 0. Ребята — очень суеверны. Они считают, что
// олимпиада будет для них успешной, если перед её началом можно разложить все карточки
// в ряд таким образом, чтобы:

// - не существовало пары соседних в ряду карточек с нулями;
// - не существовало тройки карточек, лежащих подряд, на которых записаны единицы.

// Сегодня Ваня принёс n карточек с нулями и m карточек с единицами. Карточек оказалось
// так много, что ребята не знают: можно ли разложить все эти карточки описанным способом
// или нет. Помогите им найти требуемое расположение карточек, или сообщите ребятам,
// что это невозможно.

// Входные данные
// В первой строке записано два целых числа: n (1 ≤ n ≤ 10^6) — количество карточек
// с числом 0; m (1 ≤ m ≤ 10^6) — количество карточек с числом 1.

// Выходные данные
// В единственной строке выведите требуемую последовательность из единичек и нулей
// без пробелов. Если же такую последовательность получить невозможно, выведите -1.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 1 2
// ======================================================================
// Выходные данные
// ======================================================================
// 101

// ======================================================================
// Входные данные
// ======================================================================
// 4 8
// ======================================================================
// Выходные данные
// ======================================================================
// 110110110101

// ======================================================================
// Входные данные
// ======================================================================
// 4 10
// ======================================================================
// Выходные данные
// ======================================================================
// 11011011011011

// ======================================================================
// Входные данные
// ======================================================================
// 1 5
// ======================================================================
// Выходные данные
// ======================================================================
// -1
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, m;
    cin >> n >> m;
    if (!(n - 1 <= m && m <= 2 * (n + 1)))
    {
        cout << -1;
        return;
    }
    if (n == m || m == n - 1)
    {
        if (m == n - 1)
            cout << 0;
        for (int i = 0; i < m; i++)
            cout << "10";
    }
    else
    {
        while (n > 0 || m > 0)
        {
            if (m > n && n > 0)
            {
                cout << 110;
                m -= 2;
                n--;
            }
            else
            {
                if (m)
                {
                    cout << 1;
                    m--;
                }
                if (n)
                {
                    cout << 0;
                    n--;
                }
            }
        }
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
