// A. Перевод
// ограничение по времени на тест1 second
// ограничение по памяти на тест256 megabytes

// Перевод с берляндского языка на бирляндский — задача не из лёгких. Эти языки очень
// похожи: слово на бирляндском языке отличается от такого же по смыслу слова на
// берляндском только тем, что оно пишется (и произносится) наоборот. Например, слову
// code в берляндском языке соответствует слово edoc в бирляндском. Несмотря на это,
// при «переводе» легко ошибиться. Вася перевёл слово s с берляндского на бирляндский
// как t. Помогите ему: определите, правильно ли он выполнил перевод?

// Входные данные
// В первой строке записано слово s, во второй строке записано слово t. Слова состоят
// из маленьких латинских букв. Входные данные не содержат лишних пробелов. Слова
// непустые, и их длины не превосходят 100 символов.

// Выходные данные
// Если слово t является словом s, записанным наоборот, выведите YES, иначе выведите NO.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// code
// edoc
// ======================================================================
// Выходные данные
// ======================================================================
// YES

// ======================================================================
// Входные данные
// ======================================================================
// abb
// aba
// ======================================================================
// Выходные данные
// ======================================================================
// NO

// ======================================================================
// Входные данные
// ======================================================================
// code
// code
// ======================================================================
// Выходные данные
// ======================================================================
// NO
// ======================================================================

#include <bits/stdc++.h> // Подключает сразу все библиотеки C++
using namespace std;

#define int long long // Защита от переполнения int (из-за этого часто горят баллы)

void solve()
{
    string s, s_rev;
    cin >> s >> s_rev;
    reverse(s.begin(), s.end());
    if (s == s_rev)
        cout << "YES";
    else
        cout << "NO";
}

int32_t main()
{
    // Включаем супер-быстрый ввод-вывод для C++
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
