// B. Сортируем массив
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Как и все программисты, вы очень любите массивы. На день рождения друзья подарили
// вам массив a, состоящий из n различных целых чисел.

// К сожалению, массив a слишком маленький. А вы хотите большой массив! Друзья
// договорились дать вам массив побольше, но только если вы сможете верно ответить
// на следующий вопрос: можно ли отсортировать массив a (по возрастанию), выполнив
// переворот ровно одного подотрезка a? Определения подотрезка и переворота находятся
// в примечаниях.

// Входные данные
// В первой строке записано целое число n (1 ≤ n ≤ 10^5) — размер массива a.

// Во второй строке записано n различных целых чисел через пробел:
// a[1], a[2], …, a[n] (1 ≤ a[i] ≤ 10^9).

// Выходные данные
// Выведите ответ на поставленный вопрос: строку «yes» или «no» (без кавычек).

// Если ваш ответ — «yes», то затем выведите два целых числа, обозначающие индекс
// начала и индекс конца (индекс начала не может быть больше индекса конца)
// переворачиваемого подотрезка. Если есть несколько способов выбрать эти индексы,
// выведите любой из них.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 3
// 3 2 1
// ======================================================================
// Выходные данные
// ======================================================================
// yes
// 1 3

// ======================================================================
// Входные данные
// ======================================================================
// 4
// 2 1 3 4
// ======================================================================
// Выходные данные
// ======================================================================
// yes
// 1 2

// ======================================================================
// Входные данные
// ======================================================================
// 4
// 3 1 2 4
// ======================================================================
// Выходные данные
// ======================================================================
// no

// ======================================================================
// Входные данные
// ======================================================================
// 2
// 1 2
// ======================================================================
// Выходные данные
// ======================================================================
// yes
// 1 1
// ======================================================================

// Примечание
// Пример 1. Можно перевернуть весь массив и получить [1, 2, 3].

// Пример 3. Никакой подотрезок нельзя перевернуть так, чтобы массив стал
// отсортированным.

// Определения:

// Подотрезок [l, r] массива a — это последовательность a[l], a[l+1], …, a[r].

// Рассмотрим массив a размера n. Допустим, вы переворачиваете его подотрезок [l, r].
// Полученный массив будет выглядеть следующим образом:

// a[1], a[2], …, a[l-2], a[l-1], a[r], a[r-1], …, a[l+1], a[l], a[r+1], a[r+2], …, a[n-1], a[n].

#include <bits/stdc++.h>
using namespace std;

#define int long long

const int N = 1e5 + 5;

int a[N];
int b[(int)1e5 + 5];

void solve()
{
    int n;
    cin >> n;
    // array<int, N> a;
    for (int i = 0; i < n; i++)
    {
        cin >> a[i];
        // b[i] = a[i];
    }
    int l = -1, r = -1;
    for (int i = 0; i < n - 1; i++)
    {
        if (a[i + 1] < a[i])
        {
            l = i;
            break;
        }
    }
    for (int i = n - 1; i >= 1; i--)
    {
        if (a[i - 1] > a[i])
        {
            r = i;
            break;
        }
    }
    if (l == -1 || r == -1)
    {
        cout << "yes" << endl;
        cout << 1 << " " << 1 << endl;
    }
    else
    {
        reverse(a + l, a + r + 1);
        if (!is_sorted(a, a + n))
        {
            cout << "no\n";
            // cout << l + 1 << " " << r + 1;
        }
        else
        {
            // for (int i = 0; i < n; i++)
            // {
            //     cout << a[i] << ' ';
            // }
            // cout << '\n';

            cout << "yes\n";
            // for (int i = 0; i < n; i++)
            //     cout << a[i] << ' ';
            // cout << '\n';
            cout << l + 1 << " " << r + 1;
        }
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
