// A. Скука
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Лёша не любит скучать. Поэтому, когда ему скучно, он придумывает игры. Как-то раз
// Лёша придумал следующую игру.

// Задана последовательность a, состоящая из n целых чисел. Игрок может сделать
// несколько ходов. За один ход игрок может выбрать некоторый элемент последовательности
// (обозначим выбранный элемент a_k) и удалить его, при этом из последовательности
// также удаляются все элементы, равные a_k + 1 и a_k − 1. Описанный ход приносит
// игроку a_k очков.

// Лёша максималист и поэтому хочет набрать как можно больше очков. Какое максимальное
// количество очков он сможет набрать?

// Входные данные
// В первой строке задано целое число n (1 ≤ n ≤ 10^5) — количество элементов
// последовательности. Во второй строке записаны n целых чисел a1, a2, …, a_n
// (1 ≤ a_i ≤ 10^5) — элементы последовательности.

// Выходные данные
// Выведите целое число — максимальное количество очков, которые может набрать Лёша.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 2
// 1 2
// ======================================================================
// Выходные данные
// ======================================================================
// 2

// ======================================================================
// Входные данные
// ======================================================================
// 3
// 1 2 3
// ======================================================================
// Выходные данные
// ======================================================================
// 4

// ======================================================================
// Входные данные
// ======================================================================
// 9
// 1 2 1 3 2 2 2 2 3
// ======================================================================
// Выходные данные
// ======================================================================
// 10
// ======================================================================

// Примечание
// Рассмотрим третий тестовый пример. В этом тестовом примере нужно действовать так.

// Первоначально нужно выбрать любой элемент, равный 2. Тогда последовательность станет
// равна [2, 2, 2, 2]. Далее делаем ещё 4 хода, на каждом ходу выбираем любой элемент,
// равный 2. Итого мы заработали 10 очков.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    map<int, int> m;
    for (int i = 0; i < n; i++)
    {
        int x;
        cin >> x;
        m[x]++;
    }
    vector<int> dp(1e5 + 1, 0);
    for (int i = 1; i <= 1e5; i++)
    {
        if (i >= 2)
            dp[i] = max(dp[i - 1], dp[i - 2] + (m[i] * i));
        // if (i >= 3 && m[i])
        // {
        //     if ((m[i - 1] * (i - 1)) + dp[i - 3] > (m[i] * i) + dp[i - 2])
        //         dp[i] = dp[i - 3] + (m[i - 1] * (i - 1));
        //     else
        //         dp[i] = (m[i] * i) + dp[i - 2];
        // }
        else
            dp[i] = m[i] * i;
    }
    cout << *max_element(dp.begin(), dp.end());
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
