// A. Ноутбуки
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Как-то раз Дима и Леша поспорили о цене и качестве ноутбуков. Дима считает, что
// чем дороже ноутбук, тем он лучше. Леша говорит, что это не так. Леша считает, что
// существуют два таких ноутбука, что цена первого меньше, чем цена второго, но первый
// качественнее второго.

// Ваша задача — проверить гипотезу Леши. Заданы характеристики n ноутбуков. Выясните,
// существуют ли два таких ноутбука, что цена первого строго меньше, чем цена второго,
// но первый строго качественнее второго.

// Входные данные
// Первая строка содержит целое число n (1 ≤ n ≤ 10^5) — количество ноутбуков.

// Каждая из следующих n строк содержит два целых числа a_i и b_i (1 ≤ a_i, b_i ≤ n):
// a_i — цена i-го ноутбука, b_i — число, обозначающее качество i-го ноутбука
// (чем больше это число, тем качественнее ноутбук).

// Все a_i различны. Все b_i различны.

// Выходные данные
// Если Леша прав, то выведите строку «Happy Alex», иначе выведите «Poor Alex»
// (кавычки выводить не нужно).

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 2
// 1 2
// 2 1
// ======================================================================
// Выходные данные
// ======================================================================
// Happy Alex
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    map<int, pair<int, int>> m; // price, min power, max power
    for (int i = 0; i < n; i++)
    {
        int a, b;
        cin >> a >> b;
        m[a].first = !m[a].first ? b : min(m[a].first, b);
        m[a].second = max(m[a].first, b);
    }
    vector<pair<int, int>> a; // min power, max power
    vector<int> pref_max(n + 1, 0), suff_min(n + 1, 1e9);
    for (auto &i : m)
        a.push_back(i.second);

    for (int i = 0; i < n; i++)
        pref_max[i + 1] = max(pref_max[i], a[i].second);
    for (int i = n - 1; i >= 0; i--)
        suff_min[i] = min(suff_min[i + 1], a[i].first);
    bool res = 0;
    for (int i = 0; i < n; i++)
        if (suff_min[i] < pref_max[i])
            res = 1;

    cout << (res ? "Happy Alex\n" : "Poor Alex\n");

    // for (auto &i : pref_max)
    //     cout << i << ' ';
    // cout << '\n';
    // for (auto &i : suff_min)
    //     cout << i << ' ';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
