// B. Пашмак и цветы
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Пашмак решил подарить Пармиде пару цветов из своего сада. В саду растёт n цветов,
// красота i-го из них равна b_i. Пармида — девушка необычная, она необязательно хочет
// получить два самых красивых цветка. Она хочет получить такие два цветка, разница
// красот которых максимально возможная!

// Ваша задача — написать программу, которая посчитает два значения:

// 1. Максимальную разность красот двух цветов из сада Пашмака.
// 2. Сколько существует способов выбрать два цветка из сада, чтобы разность их красот
//    была максимально возможной. Два способа считаются различными тогда и только тогда,
//    когда хотя бы один цветок выбран в одном из них и не выбран во втором.

// Входные данные
// В первой строке записано целое число n (2 ≤ n ≤ 2·10^5). В следующей строке записано
// n целых чисел через пробел b1, b2, …, b_n (1 ≤ b_i ≤ 10^9).

// Выходные данные
// В единственной строке выведите два целых числа — максимальную разность красот
// и количество способов её получить.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 2
// 1 2
// ======================================================================
// Выходные данные
// ======================================================================
// 1 1

// ======================================================================
// Входные данные
// ======================================================================
// 3
// 1 4 5
// ======================================================================
// Выходные данные
// ======================================================================
// 4 1

// ======================================================================
// Входные данные
// ======================================================================
// 5
// 3 1 2 3 1
// ======================================================================
// Выходные данные
// ======================================================================
// 2 4
// ======================================================================

// Примечание
// В третьем примере максимальная разность красот равна 2. Существует 4 способа её получить:

// - выбрать первый и второй цветки;
// - выбрать первый и пятый цветки;
// - выбрать четвёртый и второй цветки;
// - выбрать четвёртый и пятый цветки.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    map<int, int> m;
    cin >> n;
    for (int i = 0; i < n; i++)
    {
        int x;
        cin >> x;
        m[x]++;
    }

    auto l = *m.begin(), r = *m.rbegin();
    if (l.first == r.first)
        cout << r.first - l.first << ' ' << ((l.second - 1) * l.second) / 2;
    else
        cout << r.first - l.first << ' ' << l.second * r.second;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
