// C. Количество способов
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Задан массив a[1], a[2], ..., a[n], состоящий из n целых чисел. Посчитайте количество
// способов разбить все элементы массива на три непрерывные части так, чтобы сумма
// элементов в каждой части была одинаковой.

// Более формально, нужно найти количество таких пар индексов i, j
// (2 ≤ i ≤ j ≤ n − 1), что

//     a[1] + a[2] + ... + a[i−1] =
//     a[i] + a[i+1] + ... + a[j] =
//     a[j+1] + a[j+2] + ... + a[n].

// Входные данные
// В первой строке задано целое число n (1 ≤ n ≤ 5·10^5) — количество чисел в массиве.
// Во второй строке записаны n целых чисел a[1], a[2], ..., a[n]
// (|a[i]| ≤ 10^9) — элементы массива a.

// Выходные данные
// Выведите единственное целое число — количество способов разбить массив на три части
// с одинаковой суммой.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 1 2 3 0 3
// ======================================================================
// Выходные данные
// ======================================================================
// 2

// ======================================================================
// Входные данные
// ======================================================================
// 4
// 0 1 -1 0
// ======================================================================
// Выходные данные
// ======================================================================
// 1

// ======================================================================
// Входные данные
// ======================================================================
// 2
// 4 1
// ======================================================================
// Выходные данные
// ======================================================================
// 0
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long
#define all(a) a.begin(), a.end()
#define forr(i, n) for (int i = 0; i < n; i++)

void solve()
{
    int n, sm = 0;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
    {
        cin >> i;
        sm += i;
    }
    if (sm % 3 != 0 || n < 3)
    {
        cout << 0;
        return;
    }

    vector<int> pref(n + 1, 0);
    forr(i, n) pref[i + 1] = pref[i] + a[i];
    int t = sm / 3, ans = 0, cnt = 0;
    for (int i = 1; i < n; i++)
    {
        if (i >= 2 && pref[i] == 2 * t)
            ans += cnt;
        if (pref[i] == t)
            cnt++;
    }
    cout << ans;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
