// B. Черви
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Пора Кроту пообедать. Его друг Сурок приготовил вкусный обед.

// Сурок принес Кроту n упорядоченных кучек червей, таких, что в i-й кучке содержатся
// a_i червей. Он пронумеровал всех этих червей последовательными целыми числами:
// черви в первой кучке пронумерованы числами от 1 до a1, черви во второй кучке
// пронумерованы числами от a1 + 1 до a1 + a2 и так далее. Смотрите пример для
// лучшего понимания.

// Крот не может съесть всех червей (Сурок принёс их слишком много для того, чтобы
// съесть за один подход). К тому же, насколько мы знаем, Крот слепой — поэтому Сурок
// помогает ему, называя номера самых сочных червей. Сурок даст Кроту червяка, только
// если Крот правильно назовёт кучку, в которой лежит червяк.

// Крот просит вас ему помочь. Для всех сочных червей, которых назвал Сурок, подскажите
// Кроту правильные ответы.

// Входные данные
// В первой строке записано единственное целое число n (1 ≤ n ≤ 10^5) — количество кучек.

// Во второй строке записано n целых чисел a1, a2, …, a_n (1 ≤ a_i ≤ 10^3,
// a1 + a2 + … + a_n ≤ 10^6), где a_i — количество червей в i-й кучке.

// В третьей строке записано единственное целое число m (1 ≤ m ≤ 10^5) — количество
// сочных червей, названных Сурком.

// В четвёртой строке записано m целых чисел q1, q2, …, q_m (1 ≤ q_i ≤ a1 + a2 + … + a_n) —
// номера сочных червей.

// Выходные данные
// Выведите m строк. В i-й строке должно быть целое число — номер кучки, в которой
// лежит червяк под номером q_i.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 2 7 3 4 9
// 3
// 1 25 11
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 5
// 3
// ======================================================================

// Примечание
// Для входного файла из примера:

// - Черви под номерами в пределах [1, 2] лежат в первой кучке.
// - Черви под номерами в пределах [3, 9] лежат во второй кучке.
// - Черви под номерами в пределах [10, 12] лежат в третьей кучке.
// - Черви под номерами в пределах [13, 16] лежат в четвёртой кучке.
// - Черви под номерами в пределах [17, 25] лежат в пятой кучке.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, y;
    cin >> n;
    vector<int> a(n), pref(n + 1, 1);
    for (int i = 0; i < n; i++)
    {
        cin >> a[i];
        pref[i + 1] = pref[i] + a[i];
    }
    cin >> y;
    while (y--)
    {
        int q, l = 0, r = n + 1;
        cin >> q;
        while (r > l + 1)
        {
            int m = (l + r) / 2;
            if (pref[m] > q)
                r = m;
            else
                l = m;
        }
        cout << r << '\n';
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
