// B. Случайные команды
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Для участия в соревнованиях n участников были разбиты некоторым образом на m команд
// так, чтобы в каждой команде был хотя бы один участник. После соревнований каждая
// пара участников из одной команды стала друзьями.

// Ваша задача — написать программу, которая определит, какое минимальное и какое
// максимальное количество пар друзей могло образоваться после соревнования.

// Входные данные
// В единственной строке содержатся два целых числа n и m, разделённых одним пробелом
// (1 ≤ m ≤ n ≤ 10^9) — количество участников и количество команд соответственно.

// Выходные данные
// Требуется вывести два целых числа k_min и k_max — минимальное возможное количество
// пар друзей и максимальное возможное количество пар друзей соответственно.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5 1
// ======================================================================
// Выходные данные
// ======================================================================
// 10 10

// ======================================================================
// Входные данные
// ======================================================================
// 3 2
// ======================================================================
// Выходные данные
// ======================================================================
// 1 1

// ======================================================================
// Входные данные
// ======================================================================
// 6 3
// ======================================================================
// Выходные данные
// ======================================================================
// 3 6
// ======================================================================

// Примечание
// В первом примере все участники попадают в одну команду, поэтому в любом случае будет
// образовано ровно десять пар друзей.

// Во втором примере при любом разбиении в одной из команд будет два участника,
// а в другой — один. В таком случае количество пар друзей всегда будет равно одному.

// В третьем примере минимальное количество друзей выходит при разбиении на команды
// по 2 человека, а максимальное — при разбиении на команды размерами 1, 1 и 4 человек.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, m;
    cin >> n >> m;
    int resmn = 0, t = n / m, p = n % m, l = m;
    while (p--)
    {
        resmn += ((t + 1) * t) / 2;
        l--;
    }

    resmn += l * (t * (t - 1)) / 2;
    // resmn += ((t + p) * max(1LL, t + p - 1)) / 2;

    int resmx = 0, t2 = (n - m + 1);
    resmx = (t2 * (t2 - 1)) / 2;
    cout << resmn << ' ' << resmx;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
