// C. Экзамены
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Студент Валера учится на первом курсе университета. Скоро у него сессия, и ему
// предстоит сдать ровно n экзаменов. Валера — умный парень, поэтому он сможет сдать
// любой экзамен с первого раза. Кроме того, он может сдавать несколько экзаменов
// в один день и в любом порядке.

// Согласно расписанию, экзамен по i-му предмету нужно сдать в день с номером a_i.
// Однако Валера договорился с каждым преподавателем, и преподаватель i-го предмета
// разрешил организовать досрочную сдачу своего экзамена в день b_i (b_i < a_i).
// Таким образом, Валера может сдать экзамен по i-му предмету либо в день a_i,
// либо в день b_i. Все преподаватели ставят запись о сдаче экзамена в зачётную книжку
// в день фактической сдачи экзамена и датируют эту запись числом a_i.

// Валера считает, что будет достаточно странно, если записи в зачётной книжке будут
// идти не в порядке неубывания даты. Поэтому Валера просит вас помочь ему. Найдите
// минимально возможный номер дня, когда Валера сможет сдать последний экзамен, если
// он будет сдавать экзамены так, чтобы все записи в его зачётной книжке шли в порядке
// неубывания даты.

// Входные данные
// В первой строке записано единственное целое положительное число n (1 ≤ n ≤ 5000) —
// количество экзаменов, которые будет сдавать Валера.

// В каждой из следующих n строк записано по два целых положительных числа через пробел
// a_i и b_i (1 ≤ b_i < a_i ≤ 10^9) — дата сдачи по расписанию и досрочная дата сдачи
// i-го экзамена соответственно.

// Выходные данные
// Выведите единственное целое число — минимально возможный номер дня, когда Валера
// сможет сдать последний экзамен, если он будет сдавать экзамены так, чтобы все
// записи в его зачётной книжке шли в порядке неубывания даты.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 3
// 5 2
// 3 1
// 4 2
// ======================================================================
// Выходные данные
// ======================================================================
// 2

// ======================================================================
// Входные данные
// ======================================================================
// 3
// 6 1
// 5 2
// 4 3
// ======================================================================
// Выходные данные
// ======================================================================
// 6
// ======================================================================

// Примечание
// В первом примере Валера сначала сдаст экзамен по второму предмету в первый день
// (в зачётную книжку заносится дата сдачи по расписанию, то есть 3). На следующий день
// сначала он сдаст экзамен по третьему предмету (будет добавлена запись, датированная
// днём 4), а после него в тот же день сдаст экзамен по первому предмету (в зачётную
// книжку отметка будет проставлена с днём 5). Таким образом, последний экзамен Валера
// сдаст во второй день, и даты в зачётной книжке будут идти в порядке неубывания:
// 3, 4, 5.

// Во втором примере Валера сначала сдаст экзамен по третьему предмету в четвёртый день,
// после него экзамен по второму предмету в пятый день. После этого в шестой день
// Валера сдаст экзамен по первому предмету.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<pair<int, int>> a(n);
    for (auto &i : a)
        cin >> i.first >> i.second;
    sort(a.begin(), a.end(), [](pair<int, int> &a, pair<int, int> &b)
         { return a.first < b.first || a.first == b.first && a.second < b.second; });
    int cur_day = 1;
    for (auto &i : a)
    {
        cur_day = (cur_day > i.second ? i.first : i.second);
    }
    cout << cur_day << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
