// A. SwapSort
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// В этой задаче вам требуется отсортировать массив из n чисел, используя не более чем
// n обменов. Для заданного массива найдите последовательность попарных обменов
// элементов, после которых массив становится отсортированным по неубыванию.
// Обмены производятся последовательно, один за одним.

// Обратите внимание, что в задаче не требуется минимизировать число обменов —
// требуется найти любой способ длины не более n.

// Входные данные
// В первой строке входных данных содержится целое число n (1 ≤ n ≤ 3000) —
// количество элементов массива. Вторая строка содержит элементы массива
// a0, a1, …, a_{n-1} (−10^9 ≤ a_i ≤ 10^9), где a_i — это i-й элемент массива.
// Элементы пронумерованы от 0 до n − 1 слева направо. Среди элементов массива могут
// быть равные.

// Выходные данные
// В первую строку выведите k (0 ≤ k ≤ n) — количество обменов. Следующие k строк
// должны содержать описания k искомых обменов по одному в строке. Каждый обмен
// выводится в виде пары целых чисел i, j (0 ≤ i, j ≤ n − 1), которая обозначает обмен
// элементов a_i и a_j. Индексы в парах можно выводить в любом порядке. Обмены
// производятся в порядке их вывода сверху вниз. Допускается вывод i = j и обмен пары
// элементов несколько раз.

// Если ответов несколько, выведите любой из них. Гарантируется, что хотя бы один
// ответ существует.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 5 2 5 1 4
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// 0 3
// 4 2

// ======================================================================
// Входные данные
// ======================================================================
// 6
// 10 20 20 40 60 60
// ======================================================================
// Выходные данные
// ======================================================================
// 0

// ======================================================================
// Входные данные
// ======================================================================
// 2
// 101 100
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 0 1
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    vector<pair<int, int>> res;
    for (auto &i : a)
        cin >> i;

    for (int l = 0; l < n; l++)
    {
        int t = l;
        for (int r = l + 1; r < n; r++)
            if (a[t] > a[r])
                t = r;
        swap(a[l], a[t]);
        if (t != l)
            res.push_back({l, t});
    }

    cout << res.size() << '\n';
    for (auto &i : res)
        cout << i.first << ' ' << i.second << '\n';

    // for (auto &i : a)
    //     cout << i.first << ' ';
    // cout << '\n';
    // for (auto &i : a)
    //     cout << i.second << ' ';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
