// B. Бал в БерлГУ
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// По случаю 100500-летия Берляндского государственного университета совсем скоро
// состоится бал! Уже n юношей и m девушек во всю репетируют вальс, менуэт, полонез
// и кадриль.

// Известно, что на бал будут приглашены несколько пар юноша-девушка, причём уровень
// умений танцевать партнёров в каждой паре должен отличаться не более чем на единицу.

// Для каждого юноши известен уровень его умения танцевать. Аналогично, для каждой
// девушки известен уровень её умения танцевать. Напишите программу, которая определит
// наибольшее количество пар, которое можно образовать из n юношей и m девушек.

// Входные данные
// В первой строке записано целое число n (1 ≤ n ≤ 100) — количество юношей.
// Вторая строка содержит последовательность a1, a2, …, a_n (1 ≤ a_i ≤ 100),
// где a_i — умение танцевать i-го юноши.

// Аналогично, третья строка содержит целое m (1 ≤ m ≤ 100) — количество девушек.
// В четвёртой строке содержится последовательность b1, b2, …, b_m (1 ≤ b_j ≤ 100),
// где b_j — умение танцевать j-й девушки.

// Выходные данные
// Выведите единственное число — искомое максимальное возможное количество пар.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 1 4 6 2
// 5
// 5 1 5 7 9
// ======================================================================
// Выходные данные
// ======================================================================
// 3

// ======================================================================
// Входные данные
// ======================================================================
// 4
// 1 2 3 4
// 4
// 10 11 12 13
// ======================================================================
// Выходные данные
// ======================================================================
// 0

// ======================================================================
// Входные данные
// ======================================================================
// 5
// 1 1 1 1 1
// 3
// 1 2 3
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, m;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;
    cin >> m;
    vector<int> b(m);
    for (auto &i : b)
        cin >> i;
    sort(a.begin(), a.end());
    sort(b.begin(), b.end());

    int i = 0, j = 0, res = 0;
    while (i < n && j < m)
    {
        while (i < n && j < m && abs(a[i] - b[j]) > 1)
        {
            while (i < n && b[j] - a[i] > 1)
                i++;
            while (j < m && i < n && b[j] - a[i] < -1)
                j++;
        }
        res += i < n && j < m && abs(a[i] - b[j]) <= 1 ? 1 : 0;
        i++;
        j++;
    }
    cout << res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
