// C. Даны длина и сумма цифр...
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Вам задано положительное целое число m и неотрицательное целое число s. Ваша задача —
// найти наименьшее и наибольшее из чисел, которые имеют длину m и сумму цифр s.
// Искомые числа должны быть неотрицательными целыми, записанными в десятичной системе
// счисления без ведущих нулей.

// Входные данные
// В единственной строке входных данных записана пара целых чисел m, s
// (1 ≤ m ≤ 100, 0 ≤ s ≤ 900) — длина и сумма цифр искомых чисел.

// Выходные данные
// В выходные данные выведите пару искомых неотрицательных целых чисел — сначала
// минимальное из возможных, потом — максимальное. Если ни одного числа,
// удовлетворяющего условию, не существует, то выведите пару чисел «-1 -1»
// (без кавычек).

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 2 15
// ======================================================================
// Выходные данные
// ======================================================================
// 69 96

// ======================================================================
// Входные данные
// ======================================================================
// 3 0
// ======================================================================
// Выходные данные
// ======================================================================
// -1 -1
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int m, s;
    cin >> m >> s;
    if (m * 9 < s || (m > 1 && !s))
    {
        cout << "-1 -1";
        return;
    }

    string max_num = "", min_num = "";
    int temp_S = s;
    for (int i = 0; i < m; i++)
    {
        int t = min(9LL, temp_S);
        max_num += to_string(t);
        temp_S -= t;
    }
    temp_S = s;
    for (int i = 0; i < m; i++)
    {
        int t = (i + 1 != m ? 1 : 0);
        int k = min(9LL, temp_S - t);
        min_num += to_string(k);
        temp_S -= k;
    }
    reverse(min_num.begin(), min_num.end());
    cout << min_num << ' ' << max_num;
}

// 1 1 4 9

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
