// B. Перед экзаменом
// ограничение по времени на тест0.5 second
// ограничение по памяти на тест64 megabytes

// Завтра у Пети экзамен по биологии. Он очень не любит этот предмет, но d дней назад
// узнал, что всё-таки придётся его сдавать. Строгие родители сразу же наказали Пете
// заниматься подготовкой, и при этом не менее чем minTime_i и не более чем maxTime_i
// часов в i-й день. К тому же они предупредили Петю, что за день до экзамена проверят,
// как он следовал их указанию.

// И вот именно сегодня родители требуют от Пети расписание его занятий. Однако мальчик
// подсчитал лишь суммарное число часов sumTime, затраченное им на подготовку. Теперь
// он хочет узнать, удастся ли ему предоставить родителям список schedule из d целых
// чисел, в котором каждое число schedule_i означает время в часах, проведённое Петей
// в i-й день за изучением биологии. Числа должны удовлетворять ограничениям родителей,
// а сумма всех schedule_i должна быть в точности равна sumTime.

// Входные данные
// В первой строке входных данных заданы два целых числа d, sumTime (1 ≤ d ≤ 30,
// 0 ≤ sumTime ≤ 240) — количество дней, в течение которых занимался Петя, и общее
// количество часов, затраченных на подготовку. В следующих d строках содержится
// по два целых числа minTime_i, maxTime_i (0 ≤ minTime_i ≤ maxTime_i ≤ 8),
// записанных через пробел — минимальное и максимальное число часов, которое Петя
// мог потратить в i-й день.

// Выходные данные
// Выведите в первую строку YES, а во вторую d целых чисел через пробелы, каждое
// из которых — число часов, потраченных Петей на подготовку в соответствующий день.
// Если искомый список составить невозможно, то выведите NO в единственную строку
// выходных данных. Если решений несколько, выведите любое.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 1 48
// 5 7
// ======================================================================
// Выходные данные
// ======================================================================
// NO

// ======================================================================
// Входные данные
// ======================================================================
// 2 5
// 0 1
// 3 5
// ======================================================================
// Выходные данные
// ======================================================================
// YES
// 1 4
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int d, st;
    cin >> d >> st;
    int mn_t = 0, mx_t = 0;
    vector<int> res(d);
    vector<pair<int, int>> inp(d);
    for (int i = 0; i < d; i++)
    {
        cin >> inp[i].first >> inp[i].second;
        res[i] = inp[i].first;
        mn_t += inp[i].first;
        mx_t += inp[i].second;
    }
    if (st > mx_t || st < mn_t)
    {
        cout << "NO";
        return;
    }
    while (mn_t != st)
    {
        for (int i = 0; i < d; i++)
        {
            if (res[i] < inp[i].second)
            {
                res[i]++;
                mn_t++;
            }
            if (mn_t == st)
            {
                cout << "YES\n";
                for (auto &i : res)
                    cout << i << ' ';
                return;
            }
        }
    }
    cout << "YES\n";
    for (auto &i : res)
        cout << i << ' ';
    return;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
