// A. Транспорт на Новый год
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Новый год приходит в Линейный мир! В этом мире есть n ячеек, пронумерованных целыми
// числами от 1 до n, уложенных в виде доски размером 1 × n. В ячейках живут люди.
// Однако передвигаться между различными ячейками сложно, ведь выйти из ячейки — дело
// непростое. В то же время люди хотят знакомиться с людьми, живущими в других ячейках.

// И вот tncks0121 придумал систему транспорта для передвижения между ячейками, чтобы
// люди могли отпраздновать Новый год. Сперва он задумал n − 1 положительных целых
// чисел a1, a2, …, a_{n−1}. Для каждого целого числа i, где 1 ≤ i ≤ n − 1,
// выполняется условие 1 ≤ a_i ≤ n − i. Затем он создал n − 1 порталов,
// пронумерованных целыми числами от 1 до n − 1. Из них i-й (1 ≤ i ≤ n − 1) портал
// соединяет ячейку номер i и ячейку номер (i + a_i), т. е. с его помощью можно
// путешествовать из ячейки i в ячейку (i + a_i). К сожалению, портал не работает
// в обратную сторону, то есть нельзя пройти из ячейки (i + a_i) в ячейку i по i-му
// порталу. Легко заметить, что из-за условия 1 ≤ a_i ≤ n − i нельзя покинуть
// Линейный мир, пользуясь порталами.

// Я нахожусь в ячейке 1 и хочу пройти в ячейку t. Однако я не знаю, могу ли я там
// оказаться. Пожалуйста, определите, могу ли я пройти в ячейку t, пользуясь только
// построенной системой транспорта.

// Входные данные
// В первой строке записано два целых числа через пробел, n (3 ≤ n ≤ 3·10^4) и t
// (2 ≤ t ≤ n) — количество ячеек и номер ячейки, в которую я хочу попасть.

// Во второй строке записано n − 1 целых чисел через пробел a1, a2, …, a_{n−1}
// (1 ≤ a_i ≤ n − i). Гарантируется, что, пользуясь данной транспортной системой,
// покинуть Линейный мир нельзя.

// Выходные данные
// Если я могу дойти до ячейки t по данной транспортной системе, выведите "YES".
// В противном случае выведите "NO".

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 8 4
// 1 2 1 2 1 2 1
// ======================================================================
// Выходные данные
// ======================================================================
// YES

// ======================================================================
// Входные данные
// ======================================================================
// 8 5
// 1 2 1 2 1 1 1
// ======================================================================
// Выходные данные
// ======================================================================
// NO
// ======================================================================

// Примечание
// В первом примере можно дойти до t, посетив следующие ячейки: 1, 2, 4.

// Во втором примере можно посетить лишь ячейки 1, 2, 4, 6, 7, 8; значит, мы не можем
// попасть в требуемую ячейку 5.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, t;
    cin >> n >> t;
    vector<int> a(n - 1);
    for (auto &i : a)
        cin >> i;

    int l = 0;
    while (l < n - 1 && l < t - 1)
        l += a[l];
    cout << (l == t - 1 ? "YES\n" : "NO\n");
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
