// B. A и B и ошибки компиляции
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// A и B готовятся к олимпиадам по программированию.

// B очень любит отлаживать свой код. Но перед тем, как запустить решение и начать
// отладку, код нужно сначала скомпилировать.

// Изначально компилятор выдавал n ошибок компиляции, каждая из которых обозначается
// положительным целым числом. После некоторых усилий B удалось исправить сначала одну,
// а потом ещё одну ошибку.

// Однако, несмотря на то, что B уверен, что исправил две ошибки, он не может понять,
// какие именно ошибки компиляции исчезли — компилятор языка, на котором пишет B,
// каждый раз выдаёт ошибки в новом порядке! B уверен, что в отличие от многих других
// языков программирования, ошибки компиляции для его языка программирования не зависят
// друг от друга, т. е. от исправления одной ошибки множество остальных ошибок
// не изменяется.

// А вы можете помочь B узнать, какие именно две ошибки он исправил?

// Входные данные
// Первая строка входных данных содержит целое число n (3 ≤ n ≤ 10^5) — изначальное
// количество ошибок компиляции.

// Вторая строка содержит n целых чисел через пробел a1, a2, …, a_n (1 ≤ a_i ≤ 10^9) —
// номера ошибок, выданных компилятором в первый раз.

// Третья строка содержит n − 1 целых чисел через пробел b1, b2, …, b_{n-1} —
// номера ошибок, выданных при второй компиляции. Гарантируется, что последовательность
// в третьей строке содержит все числа второй строки, за исключением ровно одного.

// Четвёртая строка содержит n − 2 целых чисел через пробел c1, c2, …, c_{n-2} —
// номера ошибок, выданных при третьей компиляции. Гарантируется, что последовательность
// в четвёртой строке содержит все числа третьей строки, за исключением ровно одного.

// Выходные данные
// Выведите два числа на отдельных строках: номера ошибок компиляции, исчезнувших
// после того, как B внёс первое и второе исправление соответственно.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 1 5 8 123 7
// 123 7 5 1
// 5 1 7
// ======================================================================
// Выходные данные
// ======================================================================
// 8
// 123

// ======================================================================
// Входные данные
// ======================================================================
// 6
// 1 4 3 3 5 7
// 3 7 5 4 3
// 4 3 7 5
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 3
// ======================================================================

// Примечание
// В первом тестовом примере в первый раз B исправляет ошибку с номером 8,
// во второй — с номером 123.

// Во втором тестовом примере в первый раз B исправляет ошибку с номером 1,
// во второй — с номером 3. Обратите внимание, что если имеются несколько ошибок
// с одинаковым номером, за один раз B может исправить только одну из них.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    map<int, int> m, r;
    for (int i = 0; i < n; i++)
    {
        int x;
        cin >> x;
        m[x]++;
    }
    for (int i = 0; i < n - 1; i++)
    {
        int x;
        cin >> x;
        r[x]++;
    }
    for (auto &i : m)
        if (r[i.first] != i.second)
        {
            cout << i.first << '\n';
            break;
        }
    for (int i = 0; i < n - 2; i++)
    {
        int x;
        cin >> x;
        r[x]--;
    }
    for (auto &i : r)
        if (i.second)
        {
            cout << i.first << '\n';
            break;
        }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
