// B. Две кнопки
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вася нашёл странное устройство. На передней панели устройства расположен дисплей,
// отображающий некоторое целое положительное число, а также красная и синяя кнопки.
// При нажатии на красную кнопку число на дисплее увеличивается в два раза.
// При нажатии на синюю кнопку число на дисплее уменьшается на единицу.
// Если в какой-то момент число перестаёт быть положительным, устройство ломается.
// Дисплей может отображать сколь угодно большие числа. Изначально на дисплее
// отображается число n.

// Вася хочет получить на дисплее число m. Какое минимальное количество нажатий
// ему придётся совершить?

// Входные данные
// Первая и единственная строка ввода содержит два различных целых числа n и m,
// разделённых пробелом (1 ≤ n, m ≤ 10^4).

// Выходные данные
// Выведите одно число — минимальное количество нажатий на кнопки, необходимое,
// чтобы получить число m из числа n.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 4 6
// ======================================================================
// Выходные данные
// ======================================================================
// 2

// ======================================================================
// Входные данные
// ======================================================================
// 10 1
// ======================================================================
// Выходные данные
// ======================================================================
// 9
// ======================================================================

// Примечание
// В первом примере нужно один раз нажать на синюю кнопку, и затем один раз на красную
// кнопку.

// Во втором примере удваивать число невыгодно, поэтому надо девять раз нажать
// на синюю кнопку.

#include <bits/stdc++.h>
using namespace std;

#define int long long
#define all(a) a.begin(), a.end()

void solve()
{
    int n, m;
    cin >> n >> m;
    int cur = m, res = 0;
    if (m < n)
    {
        cout << n - m;
        return;
    }

    while (n < cur)
    {
        if (cur % 2 == 0)
            cur >>= 1;
        else
        {
            cur++;
        }
        res++;
    }
    res += (n - cur);
    cout << res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
