// C. Дровосеки
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Маленькая девочка Сьюзи каждый день слушает сказки перед сном. Сегодняшняя сказка
// была про дровосеков, поэтому маленькая девочка сразу же начала представлять себе,
// как дровосеки рубят деревья, и в её мыслях родилась ситуация, описанная ниже.

// Есть n деревьев, расположенных вдоль дороги в точках с координатами x1, x2, …, x_n.
// Каждое дерево имеет свою высоту h_i. Дерево можно срубить и повалить влево или
// вправо. Тогда оно будет занимать отрезки [x_i − h_i, x_i] и [x_i, x_i + h_i]
// соответственно. Пока дерево не срублено, оно занимает точку с координатами x_i.
// Дерево можно повалить, если на отрезке, который оно должно занимать после
// сваливания, нет ни одной занятой точки. Дровосеки хотят заготовить как можно
// больше деревьев, поэтому Сьюзи стало интересно, какое наибольшее количество
// деревьев можно повалить.

// Входные данные
// В первой строке находится целое число n (1 ≤ n ≤ 10^5) — количество деревьев.

// В последующих n строках находятся пары целых чисел x_i, h_i (1 ≤ x_i, h_i ≤ 10^9) —
// координата и высота i-го дерева.

// Пары заданы в порядке возрастания x_i. Никакие два дерева не находятся в точке
// с одинаковой координатой.

// Выходные данные
// Требуется вывести одно число — максимальное количество деревьев, которое можно
// срубить по указанным правилам.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 1 2
// 2 1
// 5 10
// 10 9
// 19 1
// ======================================================================
// Выходные данные
// ======================================================================
// 3

// ======================================================================
// Входные данные
// ======================================================================
// 5
// 1 2
// 2 1
// 5 10
// 10 9
// 20 1
// ======================================================================
// Выходные данные
// ======================================================================
// 4
// ======================================================================

// Примечание
// В первом примере деревья можно повалить так:

// - повалить 1-е дерево влево — теперь оно занимает отрезок [−1; 1];
// - повалить 2-е дерево вправо — теперь оно занимает отрезок [2; 3];
// - оставить 3-е дерево — оно занимает точку 5;
// - оставить 4-е дерево — оно занимает точку 10;
// - повалить 5-е дерево вправо — теперь оно занимает отрезок [19; 20].

// Во втором примере можно повалить ещё и 4-е дерево вправо, после чего оно займёт
// отрезок [10; 19].

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    if (n <= 2)
    {
        for (int i = 0; i < n; i++)
        {
            int x, x1;
            cin >> x >> x1;
        }

        cout << n << '\n';
        return;
    }
    int prev_prev_pos, prev_prev_r, prev_pos, prev_r, res = 2;
    cin >> prev_prev_pos >> prev_prev_r >> prev_pos >> prev_r;
    prev_prev_r = 0;
    for (int i = 0; i < n - 2; i++)
    {
        int x, r;
        cin >> x >> r;
        if (prev_pos - prev_r > prev_prev_pos + prev_prev_r)
            res++;
        else if (prev_pos + prev_r < x)
        {
            res++;
            prev_pos = prev_pos + prev_r;
        }

        prev_prev_pos = prev_pos;
        prev_prev_r = 0;
        prev_r = r;
        prev_pos = x;
    }

    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
