// D. Очередь
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Маленькая девочка Сьюзи ходила с мамой в магазин, и ей стало интересно, как можно
// улучшить обслуживание очередей.

// В очереди стоит n людей. Для каждого человека известно время t_i, необходимое
// на его обслуживание. Человек будет недоволен, если время его ожидания будет больше,
// чем время его обслуживания. Временем ожидания человека считается суммарное время
// обслуживания всех людей, стоящих перед ним в очереди. Сьюзи подумала, что если
// поменять местами некоторых людей в очереди, то получится уменьшить количество
// недовольных.

// Помогите Сьюзи найти, какого максимального количества довольных можно добиться,
// переставляя людей в очереди местами.

// Входные данные
// В первой строке находится целое число n (1 ≤ n ≤ 10^5).

// В следующей строке находятся n целых чисел t_i (1 ≤ t_i ≤ 10^9), разделённых
// пробелами.

// Выходные данные
// Введите единственное число — максимальное количество довольных людей в очереди.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 15 2 1 5 3
// ======================================================================
// Выходные данные
// ======================================================================
// 4
// ======================================================================

// Примечание
// Значение 4 достигается, например, при такой расстановке: 1, 2, 3, 5, 15.
// Таким образом можно сделать всех, кроме человека с временем 5, довольными.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n), pref(n + 1, 0);
    for (auto &i : a)
        cin >> i;
    sort(a.begin(), a.end());
    int res = n;
    for (int i = 0; i < n; i++)
    {

        if (pref[i] > a[i])
        {
            res--;
            pref[i + 1] = pref[i];
        }
        else
            pref[i + 1] = pref[i] + a[i];
    }
    cout << res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
