// A. Две подстроки
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Дана строка s. Требуется определить, существуют ли в данной строке s две непересекающиеся
// подстроки "AB" и "BA" (подстроки могут идти в любом порядке).

// Входные данные
// На вход подаётся строка s длиной от 1 до 10^5 символов, состоящая из заглавных букв
// латинского алфавита.

// Выходные данные
// Выведите "YES" (без кавычек), если строка s содержит две непересекающиеся подстроки
// "AB" и "BA", и "NO" иначе.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// ABA
// ======================================================================
// Выходные данные
// ======================================================================
// NO

// ======================================================================
// Входные данные
// ======================================================================
// BACFAB
// ======================================================================
// Выходные данные
// ======================================================================
// YES

// ======================================================================
// Входные данные
// ======================================================================
// AXBYBXA
// ======================================================================
// Выходные данные
// ======================================================================
// NO
// ======================================================================

// Примечание
// В первом примере входных данных, несмотря на то, что есть подстроки "AB" и "BA",
// их вхождения пересекаются, поэтому ответ — "NO".

// Во втором примере входных данных есть следующие вхождения подстрок: BACFAB.

// В третьем примере нет ни подстроки "AB", ни подстроки "BA".

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    string s;
    cin >> s;
    if (s.size() <= 3)
    {
        cout << "NO\n";
        return;
    }
    vector<int> stab;
    for (int i = 1; i < s.size(); i++)
        if (s[i] == 'B' && s[i - 1] == 'A')
            stab.push_back(i);

    for (int i = s.size() - 1; i > 0; i--)
        if (s[i] == 'A' && s[i - 1] == 'B')
        {
            for (auto &j : stab)
                if (j != -1 && abs(j - i) > 1)
                {
                    cout << "YES";
                    return;
                }
        }
    // cout << st_ab << ' ' << st_ba;
    cout << "NO\n";
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
