// C. Делимость на восемь
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Дано целое неотрицательное число n, запись которого состоит из не более чем 100 цифр
// и не содержит ведущих незначащих нулей.

// Нужно определить, можно ли в данном числе вычеркнуть некоторое (возможно, нулевое)
// количество цифр так, чтобы полученное после вычеркивания цифр число содержало хотя бы
// одну цифру, было неотрицательным, не имело ведущих незначащих нулей и делилось на 8.
// После вычеркивания переставлять цифры запрещается.

// Если решение существует, необходимо вывести его.

// Входные данные
// В единственной строке входных данных содержится целое неотрицательное число n.
// Запись числа n не содержит ведущих незначащих нулей, и её длина не превосходит 100 цифр.

// Выходные данные
// Выведите "NO" (без кавычек), если искомого способа вычеркнуть некоторые цифры
// из числа n не существует.

// Иначе выведите "YES" в первой строке и число, получившееся в результате вычеркивания
// некоторых цифр числа n, во второй строке. Выведенное число должно делиться на 8.

// Если возможных ответов несколько, требуется вывести любой из них.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 3454
// ======================================================================
// Выходные данные
// ======================================================================
// YES
// 344

// ======================================================================
// Входные данные
// ======================================================================
// 10
// ======================================================================
// Выходные данные
// ======================================================================
// YES
// 0

// ======================================================================
// Входные данные
// ======================================================================
// 111111
// ======================================================================
// Выходные данные
// ======================================================================
// NO
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    string s;
    cin >> s;
    int n = s.size();

    int cur = 0;
    for (int i = -2; i < n; i++)
    {
        if (i >= 0)
            cur = cur * 10 + (s[i] - '0');
        for (int j = i + 1; j < n; j++)
        {
            if (j >= 0)
                cur = cur * 10 + (s[j] - '0');
            for (int k = j + 1; k < n; k++)
            {
                if (k >= 0)
                    cur = cur * 10 + (s[k] - '0');
                if (cur % 8 == 0 && (cur != 0 || (k >= 0 && s[k] == '0')))
                {
                    cout << "YES\n";
                    cout << cur;
                    return;
                }
                cur /= 10;
            }
            cur /= 10;
        }
        cur /= 10;
    }
    cout << "NO\n";
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
