// C. Мишка и покер
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Лимак — старый бурый медведь. Он любит играть в покер со своими друзьями, для чего
// они часто ходят в ближайшее казино.

// За столом сидят n игроков (включая Лимака), которые уже сделали какие-то ставки.
// i-й игрок поставил a_i долларов.

// Каждый игрок может удвоить или утроить свою ставку произвольное количество раз
// (может быть, и удвоить, и утроить). В казино есть специальное условие о джекпоте
// в случае, если ставки всех игроков становятся равны. Могут ли Лимак и его друзья
// выиграть джекпот?

// Входные данные
// В первой строке входного файла записано целое число n (2 ≤ n ≤ 10^5) — количество игроков.

// Во второй строке записано n целых чисел a1, a2, …, a_n (1 ≤ a_i ≤ 10^9) — ставки игроков.

// Выходные данные
// Выведите "Yes" (без кавычек), если игроки смогут сделать все ставки равными,
// или "No" в противном случае.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 75 150 75 50
// ======================================================================
// Выходные данные
// ======================================================================
// Yes

// ======================================================================
// Входные данные
// ======================================================================
// 3
// 100 150 250
// ======================================================================
// Выходные данные
// ======================================================================
// No
// ======================================================================

// Примечание
// В первом тесте первый и третий игроки должны дважды удвоить свои ставки, второй
// игрок должен удвоить свою ставку один раз, а четвёртый игрок должен удвоить
// и утроить свою ставку.

// Можно показать, что во втором тесте невозможно сделать все ставки равными.

#include <bits/stdc++.h>
using namespace std;

#define int long long

vector<int> f(int x)
{
    vector<int> res;
    int cur = 2;
    while (x != 1)
    {
        // cout << x << '\n';
        if (x % cur == 0)
        {
            x /= cur;
            if (cur != 2 && cur != 3)
                res.push_back(cur);
        }
        else
            cur++;
    }
    return res;
}

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    for (int i = 0; i < n; i++)
    {
        cin >> a[i];
    }
    while (a[0] % 2 == 0 || a[0] % 3 == 0)
    {
        if (a[0] % 2 == 0)
            a[0] /= 2;
        else
            a[0] /= 3;
    }
    for (int i = 1; i < n; i++)
    {
        while (a[i] % 2 == 0 || a[i] % 3 == 0)
        {
            if (a[i] % 2 == 0)
                a[i] /= 2;
            else
                a[i] /= 3;
        }
        if (a[i] != a[0])
        {
            cout << "No\n";
            return;
        }
    }
    cout << "Yes\n";
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}