// A. Кефа и первые шаги
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Кефа решил подзаработать денег, занимаясь различной деятельностью в интернете
// на протяжении ровно n дней. Он знает, что в i-й день (1 ≤ i ≤ n) он заработает
// a_i монет. Кефа любит прогресс, поэтому он хочет узнать длину максимального
// неубывающего подотрезка в последовательности a_i. Напомним, что подотрезок
// последовательности — это её непрерывный фрагмент. Подотрезок чисел называется
// неубывающим, если числа в нём следуют в порядке неубывания.

// Помогите Кефе справиться с этой задачей!

// Входные данные
// В первой строке содержится целое число n (1 ≤ n ≤ 10^5).

// Во второй строке заданы n целых чисел a1, a2, ..., a_n (1 ≤ a_i ≤ 10^9).

// Выходные данные
// Выведите единственное целое число — длину максимального неубывающего подотрезка
// последовательности a.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 2 2 1 3 4 1
// ======================================================================
// Выходные данные
// ======================================================================
// 3

// ======================================================================
// Входные данные
// ======================================================================
// 3
// 2 2 9
// ======================================================================
// Выходные данные
// ======================================================================
// 3
// ======================================================================

// Примечание
// В первом тесте максимальный неубывающий подотрезок — это числа с третьего по пятое.

// Во втором тесте максимальный неубывающий подотрезок — это числа с первого по третье.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;
    int l = 0, res = 1;
    for (int r = 1; r < n; r++)
    {
        while (r < n && a[r] >= a[r - 1])
            r++;
        res = max(res, r - l);
        l = r;
    }
    cout << res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
