// B. Кефа и компания
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Кефа хочет отметить свой первый крупный заработок походом в ресторан. Однако ему
// нужна компания.

// У Кефы есть n друзей, каждый из которых согласится пойти в ресторан, если Кефа
// попросит. Каждый друг характеризуется количеством денег у него и степенью дружбы
// с Кефой. Наш попугай не хочет, чтобы какой-то друг почувствовал себя бедным по
// сравнению с кем-то другим в компании (Кефа не в счёт). Друг чувствует себя бедным,
// если в компании есть кто-то, у кого денег хотя бы на d единиц больше, чем у него.
// Также Кефа хочет, чтобы суммарная степень дружбы членов компании была максимальной.
// Помогите ему пригласить оптимальную компанию!

// Входные данные
// Первая строка ввода содержит два целых числа, разделённых пробелом, n и d
// (1 ≤ n ≤ 10^5, 1 ≤ d ≤ 10^9) — количество друзей у Кефы и минимальная разница денег,
// приводящая к тому, что человек чувствует себя бедным.

// В последующих n строках даны описания друзей Кефы, в (i + 1)-й строке содержится
// описание i-го друга вида m_i, s_i (0 ≤ m_i, s_i ≤ 10^9) — количество денег
// и степень дружбы с Кефой соответственно.

// Выходные данные
// Выведите максимальную суммарную степень дружбы, которой можно добиться.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 4 5
// 75 5
// 0 100
// 150 20
// 75 1
// ======================================================================
// Выходные данные
// ======================================================================
// 100

// ======================================================================
// Входные данные
// ======================================================================
// 5 100
// 0 7
// 11 32
// 99 10
// 46 8
// 87 54
// ======================================================================
// Выходные данные
// ======================================================================
// 111
// ======================================================================

// Примечание
// В первом тесте из условия выгоднее всего сформировать компанию только из второго
// друга. При всех других вариантах суммарная степень дружбы будет меньше.

// Во втором тесте из условия мы можем взять всех друзей.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, d;
    cin >> n >> d;
    vector<pair<int, int>> a(n);
    for (auto &i : a)
        cin >> i.first >> i.second;
    sort(a.begin(), a.end(), [](pair<int, int> &l, pair<int, int> &r)
         { return l.first < r.first; });
    int l = 0, r = 0, best_res = 0, s = 0;
    while (r < n)
    {
        while (l < r && a[r].first - a[l].first >= d)
            s -= a[l++].second;
        while (r < n && a[r].first - a[l].first < d)
        {
            s += a[r++].second;
            best_res = max(best_res, s);
        }
    }
    cout << best_res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
