// C. Кефа и парк
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Кефа решил отпраздновать свой первый крупный заработок походом в ресторан.

// Он живёт возле необычного парка. Парк представляет из себя подвешенное дерево из n
// вершин c корнем в вершине 1. В вершине 1 также находится дом Кефы. К сожалению
// для нашего героя, в парке также находятся коты. Кефа уже выяснил номера вершин,
// в которых находятся коты.

// В листовых вершинах парка находятся рестораны. Кефа хочет выбрать ресторан,
// в который он пойдёт, но, к сожалению, он очень боится котов, поэтому он ни за что
// не пойдёт в ресторан, на пути к которому от его дома найдётся более m подряд идущих
// вершин с котами.

// Ваша задача — помочь Кефе посчитать количество ресторанов, в которые он может сходить.

// Входные данные
// В первой строке записаны два целых числа n и m (2 ≤ n ≤ 10^5, 1 ≤ m ≤ n) —
// количество вершин дерева и максимальное количество подряд идущих вершин с котами,
// которое способен перенести Кефа.

// Во второй строке содержится n целых чисел a1, a2, …, a_n, где каждое a_i либо
// равняется 0 (тогда в вершине i нет кота), либо равняется 1 (тогда в вершине i есть кот).

// В следующих n − 1 строках записаны рёбра дерева в формате «x_i y_i» (без кавычек)
// (1 ≤ x_i, y_i ≤ n, x_i ≠ y_i), где x_i и y_i — вершины дерева, соединённые очередным
// ребром.

// Гарантируется, что данный набор рёбер задаёт дерево.

// Выходные данные
// Одно целое число — количество различных листьев дерева, на пути от дома Кефы
// до которых не больше m подряд идущих вершин с котами.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 4 1
// 1 1 0 0
// 1 2
// 1 3
// 1 4
// ======================================================================
// Выходные данные
// ======================================================================
// 2

// ======================================================================
// Входные данные
// ======================================================================
// 7 1
// 1 0 1 1 0 0 0
// 1 2
// 1 3
// 2 4
// 2 5
// 3 6
// 3 7
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// ======================================================================

// Примечание
// Напомним, что дерево — это связный граф на n вершинах, состоящий из n − 1 ребра.
// Подвешенное дерево — это дерево с особой выделенной вершиной, корнем. В подвешенном
// дереве из любых двух вершин, соединённых ребром, одна называется предком (та из них,
// что ближе к корню), а оставшаяся — ребёнком. Вершина называется листом, если у неё
// нет детей.

// Пояснение к первому тесту из условия: красным цветом отмечены вершины, в которых
// находятся коты. Рестораны находятся в вершинах 2, 3, 4. Кефа не может сходить только
// в ресторан, находящийся в вершине 2.

// Пояснение ко второму тесту из условия: рестораны находятся в вершинах 4, 5, 6, 7.
// Кефа не может попасть в рестораны 6, 7.

#include <bits/stdc++.h>
using namespace std;

#define int long long

int n, m, res = 0;

void dfs(int v, vector<vector<int>> &graph, int k, vector<int> &cat, int parent, vector<int> &visited) //, int parent)
{
    if (k > m)
        return;
    int ok = 1;
    for (auto &u : graph[v])
    {
        if (u != parent && !visited[u])
        {
            visited[u] = 1;
            ok = 0;
            dfs(u, graph, k * cat[u] + cat[u], cat, v, visited);
        }
    }
    res += ok;
}

void solve()
{
    cin >> n >> m;
    vector<vector<int>> graph(n);
    vector<int> cat(n), visited(n, 0);
    for (auto &i : cat)
        cin >> i;
    for (int i = 0; i < n - 1; i++)
    {
        int from, to;
        cin >> from >> to;
        from--;
        to--;
        graph[from].push_back(to);
        graph[to].push_back(from);
    }

    dfs(0, graph, cat[0], cat, -1, visited);
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
