// A. Слово
// ограничение по времени на тест2 seconds
// ограничение по памяти на тест256 megabytes

// Васю очень огорчает, что многие люди в интернете смешивают маленькие и большие
// буквы в одном слове. Поэтому он решил разработать расширение для своего любимого
// браузера, которое меняет регистр букв в каждом слове так, чтобы оно либо состояло
// только из маленьких букв, либо, наоборот, только из больших. При этом в слове должно
// измениться как можно меньше букв. Например, слово HoUse должно замениться на house,
// а слово ViP — на VIP. В случае, если в слове содержится одинаковое количество
// маленьких и больших букв, нужно заменить все буквы на маленькие. Например, maTRIx
// нужно заменить на matrix. Ваша задача — обработать указанным способом одно заданное
// слово.

// Входные данные
// В первой строке записано слово s — оно состоит из больших и маленьких латинских
// букв и имеет длину от 1 до 100.

// Выходные данные
// Выведите исправленное слово s. Если в заданном слове s строго больше заглавных букв,
// приведите его к верхнему регистру, иначе — к нижнему.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// HoUse
// ======================================================================
// Выходные данные
// ======================================================================
// house

// ======================================================================
// Входные данные
// ======================================================================
// ViP
// ======================================================================
// Выходные данные
// ======================================================================
// VIP

// ======================================================================
// Входные данные
// ======================================================================
// maTRIx
// ======================================================================
// Выходные данные
// ======================================================================
// matrix
// ======================================================================

#include <bits/stdc++.h> // Подключает сразу все библиотеки C++
using namespace std;

#define int long long // Защита от переполнения int (из-за этого часто горят баллы)

void solve()
{
    string s;
    cin >> s;
    int lower_count = 0, upper_count = 0, word_length = s.length();
    for (int i = 0; i < word_length; i++)
    {
        if (isupper(s[i]))
            ++upper_count;
    }
    lower_count = word_length - upper_count;
    for (int i = 0; i < word_length; i++)
    {
        if (upper_count > lower_count)
        {
            s[i] = toupper(s[i]);
        }
        else
        {
            s[i] = tolower(s[i]);
        }
    }
    cout << s;
}

int32_t main()
{
    // Включаем супер-быстрый ввод-вывод для C++
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
