// B. Запросы о количестве не превосходящих элементов
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Заданы два массива чисел a и b. Для каждого элемента второго массива b_j нужно
// найти количество элементов в массиве a, которые меньше либо равны b_j.

// Входные данные
// В первой строке находятся два целых числа n, m (1 ≤ n, m ≤ 2·10^5) — размеры
// массивов a и b.

// Во второй строке находятся n целых чисел — элементы массива a (−10^9 ≤ a_i ≤ 10^9).

// В третьей строке находятся m целых чисел — элементы массива b (−10^9 ≤ b_j ≤ 10^9).

// Выходные данные
// Выведите m чисел, разделённых пробелами: j-е из них равно количеству таких элементов
// массива a, которые меньше или равны числу b_j.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5 4
// 1 3 5 7 9
// 6 4 2 8
// ======================================================================
// Выходные данные
// ======================================================================
// 3 2 1 4

// ======================================================================
// Входные данные
// ======================================================================
// 5 5
// 1 2 1 2 5
// 3 1 4 1 5
// ======================================================================
// Выходные данные
// ======================================================================
// 4 2 4 2 5
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, m;
    cin >> n >> m;
    vector<int> a(n + 1, -1e10);
    for (int i = 1; i <= n; i++)
        cin >> a[i];
    sort(a.begin(), a.end());
    // cout << '\n';
    // for (auto &i : a)
    //     cout << i << ' ';
    // cout << '\n';
    while (m--)
    {
        int q;
        cin >> q;
        int l = 0, r = n + 1;
        while (r > l + 1)
        {
            int m = (l + r) / 2;
            if (a[m] <= q)
                l = m;
            else
                r = m;
        }
        cout << l << ' ';
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
