// A. Простые строки
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// zscoder любит простые строки! Строка t называется простой, если любая пара соседних
// букв различается. Например, строки ab, aba, zscoder — простые, в то время как строки
// aa, add не являются таковыми.

// У zscoder есть строка s. Он хочет изменить в ней наименьшее количество букв, чтобы
// строка s стала простой. Помогите ему с этой задачей!

// Входные данные
// В единственной строке находится строка s (1 ≤ |s| ≤ 2·10^5) — строка, которая есть
// у zscoder. Строка s состоит только из строчных английских букв.

// Выходные данные
// Выведите простую строку s' — строку s после минимального количества изменений.
// Если существует несколько решений, можете вывести любое из них.

// Обратите внимание, что строка s' также должна состоять только из строчных английских
// букв.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// aab
// ======================================================================
// Выходные данные
// ======================================================================
// bab

// ======================================================================
// Входные данные
// ======================================================================
// caaab
// ======================================================================
// Выходные данные
// ======================================================================
// cabab

// ======================================================================
// Входные данные
// ======================================================================
// zscoder
// ======================================================================
// Выходные данные
// ======================================================================
// zscoder
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    string s;
    cin >> s;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
