// D1. Волшебный порошок - 1
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Эта задача предлагается в двух вариантах, которые отличаются только ограничениями.
// Если вы можете решить эту задачу в больших ограничениях, то вы можете сразу написать
// одно решение на оба варианта. Если же решение в больших ограничениях вызывает
// затруднение, вы можете решить только упрощённый вариант.

// Проснувшись с утра, Аполлинария решила испечь печенек. Для того чтобы испечь одну
// печеньку, нужно n ингредиентов, причём про каждый ингредиент известно число a_i —
// сколько грамм этого ингредиента необходимо для того, чтобы испечь одну печеньку.
// Для приготовления одной печеньки необходимо использовать все n ингредиентов
// в нужных пропорциях.

// У Аполлинарии есть b_i грамм i-го ингредиента. Кроме того, у неё есть k грамм
// волшебного порошка. Каждый грамм волшебного порошка можно превратить ровно в 1 грамм
// любого из n ингредиентов и использовать для приготовления печенек.

// Перед вами стоит задача — определить максимальное количество печенек, которое сможет
// испечь Аполлинария при помощи имеющихся у неё ингредиентов и волшебного порошка.

// Входные данные
// В первой строке следуют два целых положительных числа n и k (1 ≤ n, k ≤ 1000) —
// количество ингредиентов и количество грамм волшебного порошка.

// Во второй строке следует последовательность a1, a2, …, a_n (1 ≤ a_i ≤ 1000),
// где i-е число равно количеству грамм i-го ингредиента, необходимых для приготовления
// одной печеньки.

// В третьей строке следует последовательность b1, b2, …, b_n (1 ≤ b_i ≤ 1000),
// где i-е число равно количеству грамм i-го ингредиента, которые есть у Аполлинарии.

// Выходные данные
// Выведите целое число — максимальное количество печенек, которые сможет испечь
// Аполлинария при помощи имеющихся у неё ингредиентов и волшебного порошка.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 3 1
// 2 1 4
// 11 3 16
// ======================================================================
// Выходные данные
// ======================================================================
// 4

// ======================================================================
// Входные данные
// ======================================================================
// 4 3
// 4 3 5 6
// 11 12 14 20
// ======================================================================
// Выходные данные
// ======================================================================
// 3
// ======================================================================

// Примечание
// В первом тестовом примере Аполлинарии выгодно превратить 1 имеющийся у неё грамм
// волшебного порошка в ингредиент номер 2, тогда она сможет испечь 4 печеньки.

// Во втором тестовом примере Аполлинарии выгодно превратить 1 грамм волшебного
// порошка в ингредиент номер 1 и 1 грамм волшебного порошка в ингредиент номер 3.
// Тогда она сможет испечь 3 печеньки. Оставшийся 1 грамм волшебного порошка можно
// оставить, так как с помощью него ответ увеличить невозможно.

#include <bits/stdc++.h>
using namespace std;

#define int long long

bool check(vector<int> &a, vector<int> &b, int n, int m, int p)
{
    long double need = 0;
    for (int i = 0; i < n; i++)
    {
        if ((a[i] > b[i] && a[i] - b[i] > p)) // || (b[i] / m + p > a[i]))
            return false;
        need += min(0LL, b[i] - (a[i] * m));
        if (abs(need) > p)
            return false;
    }
    return need + p >= 0;
}

void solve()
{
    int n, p;
    cin >> n >> p;
    vector<int> a(n), b(n);
    for (auto &i : a)
        cin >> i;
    for (auto &i : b)
        cin >> i;

    int l = 0, r = 1e10;
    while (r > l + 1)
    {
        int m = (l + r) / 2;
        if (check(a, b, n, m, p))
            l = m;
        else
            r = m;
    }
    cout << l << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
