// C. Вася и строка
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Школьник Вася получил в подарок на день рождения строку длины n, состоящую из букв
// «a» и «b». Вася называет привлекательностью строки максимальную длину подстроки
// (последовательности соседних символов), состоящей из одинаковых символов.

// Вася может поменять в исходной строке не более k символов. Какой максимальной
// привлекательности данной строки он сможет добиться?

// Входные данные
// В первой строке входных данных содержатся два числа n и k
// (1 ≤ n ≤ 100 000, 0 ≤ k ≤ n) — длина строки Васи и максимальное разрешённое
// количество изменений.

// Во второй строке следует строка Васи, состоящая из букв «a» и «b».

// Выходные данные
// Выведите единственное целое число — максимальная привлекательность строки, которую
// Вася может получить, изменив в исходной строке не более k символов.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 4 2
// abba
// ======================================================================
// Выходные данные
// ======================================================================
// 4

// ======================================================================
// Входные данные
// ======================================================================
// 8 1
// aabaabaa
// ======================================================================
// Выходные данные
// ======================================================================
// 5
// ======================================================================

// Примечание
// В первом примере Вася может получить как строку «aaaa», так и строку «bbbb».

// Во втором примере оптимальный ответ достигается на строке «aaaaabaa» или на строке
// «aabaaaaa».

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, k;
    cin >> n >> k;
    int a_cnt = 0, b_cnt = 0;
    string s;
    cin >> s;
    int res = 0, r = 0;
    for (int l = 0; l < n; l++)
    {
        while (r < n && min(a_cnt, b_cnt) <= k)
        {
            if (s[r] == 'b')
                b_cnt++;
            else
                a_cnt++;
            r++;
        }
        if (min(a_cnt, b_cnt) <= k + 1)
            res = max(res, r - l - (min(a_cnt, b_cnt) > k));
        if (s[l] == 'b')
            b_cnt--;
        else
            a_cnt--;
    }
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
