// A. Каникулы
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Каникулы Васи будут длиться n дней! И Вася решил за это время улучшить свои навыки
// программирования, а также позаниматься спортом. Про каждый из n дней каникул Вася
// знает, будет ли открыт в этот день спортзал, а также будет ли в интернете в этот
// день проводиться контест. Для i-го дня возможны четыре варианта:

// - в этот день закрыт спортзал и не проводится контест;
// - в этот день закрыт спортзал и проводится контест;
// - в этот день открыт спортзал и не проводится контест;
// - в этот день открыт спортзал и проводится контест.

// В каждый из дней Вася может либо отдыхать, либо писать контест (если он проводится
// в этот день), либо заниматься спортом (если открыт спортзал).

// Перед вами стоит задача найти минимальное количество дней, в которые Вася будет
// отдыхать (то есть не будет заниматься спортом и не будет писать контест
// одновременно). Единственное ограничение от Васи — он не хочет два дня подряд
// заниматься одним и тем же видом активности, то есть он не будет заниматься спортом
// два дня подряд и он не будет писать контесты два дня подряд.

// Входные данные
// В первой строке следует целое положительное число n (1 ≤ n ≤ 100) — количество
// дней в каникулах Васи.

// Во второй строке следует через пробел последовательность целых чисел a1, a2, …, a_n
// (0 ≤ a_i ≤ 3), где:

// - a_i = 0, если в i-й день каникул не работает спортзал и не проводится контест;
// - a_i = 1, если в i-й день каникул не работает спортзал, но проводится контест;
// - a_i = 2, если в i-й день каникул работает спортзал и не проводится контест;
// - a_i = 3, если в i-й день каникул работает спортзал и проводится контест.

// Выходные данные
// Выведите минимально возможное количество дней, в которые Вася будет отдыхать.
// Помните, что Вася отказывается:

// - заниматься спортом в какие-либо два подряд идущих дня,
// - писать контест в какие-либо два подряд идущих дня.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 1 3 2 0
// ======================================================================
// Выходные данные
// ======================================================================
// 2

// ======================================================================
// Входные данные
// ======================================================================
// 7
// 1 3 3 2 1 2 3
// ======================================================================
// Выходные данные
// ======================================================================
// 0

// ======================================================================
// Входные данные
// ======================================================================
// 2
// 2 2
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// ======================================================================

// Примечание
// В первом тестовом примере Вася может написать контест в день номер 1 и позаниматься
// спортом в день номер 3. Таким образом, он будет отдыхать всего два дня.

// Во втором тестовом примере Вася должен писать контесты в дни с номерами 1, 3, 5 и 7,
// а в остальные дни заниматься спортом. Таким образом, он не будет отдыхать ни одного дня.

// В третьем тестовом примере Вася может позаниматься спортом либо в день номер 1,
// либо в день номер 2. Он не может заниматься спортом оба дня, так как это будет
// противоречить его ограничению. Таким образом, он будет отдыхать один день.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;
    vector<vector<int>> dp(n, vector<int>(3));
    dp[0][0] = 1;
    if (a[0] == 1 || a[0] == 3)
        dp[0][1] = 0;
    else
        dp[0][1] = 1e9;

    if (a[0] == 2 || a[0] == 3)
        dp[0][2] = 0;
    else
        dp[0][2] = 1e9;

    for (int i = 1; i < n; i++)
    {
        dp[i][0] = min({dp[i - 1][0], dp[i - 1][1], dp[i - 1][2]}) + 1;
        if (a[i] == 1 || a[i] == 3)
            dp[i][1] = min(dp[i - 1][0], dp[i - 1][2]);
        else
            dp[i][1] = 1e9;

        if (a[i] == 2 || a[i] == 3)
            dp[i][2] = min(dp[i - 1][0], dp[i - 1][1]);
        else
            dp[i][2] = 1e9;
    }
    cout << min({dp[n - 1][0], dp[n - 1][1], dp[n - 1][2]});
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
