// C. Сотовая связь
// ограничение по времени на тест3 секунды
// ограничение по памяти на тест256 мегабайт

// На прямой заданы n точек — позиции населённых пунктов, а также m точек — позиции
// вышек сотовой связи. Все вышки работают одинаково, они обеспечивают сотовой связью
// все населённые пункты, которые удалены от неё не более чем на r.

// Перед вами стоит задача определить минимальное r, чтобы каждый населённый пункт
// был обеспечен сотовой связью. Иными словами, надо найти наименьшее r такое,
// что для каждого города найдётся хотя бы одна вышка на расстоянии не более чем r.

// Если r = 0, то вышка обеспечивает сотовой связью только ту точку, где она расположена.
// Одна вышка может обеспечивать сотовой связью любое количество населённых пунктов,
// при условии, что все они расположены от неё на расстоянии не более чем r.

// Входные данные
// В первой строке следует два целых положительных числа n и m (1 ≤ n, m ≤ 10^5) —
// количество населённых пунктов и количество вышек.

// Во второй строке следует последовательность из n целых чисел a1, a2, …, a_n
// (−10^9 ≤ a_i ≤ 10^9) — координаты населённых пунктов. Допустимо, что в одной точке
// может быть несколько населённых пунктов. Все координаты населённых пунктов заданы
// в порядке неубывания.

// В третьей строке следует последовательность из m целых чисел b1, b2, …, b_m
// (−10^9 ≤ b_j ≤ 10^9) — координаты вышек сотовой связи. Допустимо, что в одной точке
// может быть несколько вышек. Все координаты вышек заданы в порядке неубывания.

// Выходные данные
// Выведите минимальное число r такое, что каждый населённый пункт будет обеспечен
// сотовой связью.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 3 2
// -2 2 4
// -3 0
// ======================================================================
// Выходные данные
// ======================================================================
// 4

// ======================================================================
// Входные данные
// ======================================================================
// 5 3
// 1 5 10 14 17
// 4 11 15
// ======================================================================
// Выходные данные
// ======================================================================
// 3
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

bool check(int r, vector<int> &a, vector<int> &b)
{
    int cur_k = 0;
    int cur_l = b[cur_k] - r, cur_r = b[cur_k] + r;
    for (int i = 0; i < a.size();)
    {
        cur_l = b[cur_k] - r, cur_r = b[cur_k] + r;
        if (cur_r < a[i] || cur_l > a[i])
            if (cur_k + 1 < b.size())
                cur_k++;
            else
                return 0;
        else
            i++;
    }
    return 1;
}

void solve()
{
    int n, m;
    cin >> n >> m;
    vector<int> a(n), b(m);
    for (auto &i : a)
        cin >> i;
    for (auto &i : b)
        cin >> i;

    int l = -1, r = 1e18;
    while (r > l + 1)
    {
        int mid = (l + r) / 2;
        if (check(mid, a, b))
            r = mid;
        else
            l = mid;
    }
    cout << r;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}

// -3 -6 0
// 0 -3 3