// A. Польшар и Гипотеза
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Польшар — юный, умный шар. Он заинтересовался простыми числами. Он придумал
// следующую гипотезу: «Существует натуральное число n такое, что для любого
// натурального m число n·m + 1 является простым».

// К сожалению, Польшар ещё неопытен и не знает, что его гипотеза неверна. Можете
// опровергнуть её? Напишите программу, которая найдёт контрпример для любого n.

// Входные данные
// Ввод состоит из одного целого числа из гипотезы Польшара n (1 ≤ n ≤ 1000).

// Выходные данные
// Выведите такое m, что n·m + 1 не является простым. Ваш ответ будет считаться
// правильным, если вы выведете любое подходящее m такое, что 1 ≤ m ≤ 10^3.
// Гарантируется, что ответ существует.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 3
// ======================================================================
// Выходные данные
// ======================================================================
// 1

// ======================================================================
// Входные данные
// ======================================================================
// 4
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// ======================================================================

// Примечание
// Натуральное число, большее 1, называется простым, если у него нет натуральных
// делителей, кроме 1 и его самого.

// В первом примере 3·1 + 1 = 4. Можно вывести 1.

// Во втором примере 4·1 + 1 = 5. Вывести 1 нельзя, так как 5 — простое. Однако m = 2
// подойдёт, так как 4·2 + 1 = 9, что не является простым числом.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    if (n > 2)
        cout << n - 2;
    else if (n == 1)
        cout << 3;
    else
        cout << 4;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
