// A. Подарок
// ограничение по времени на тест2 seconds
// ограничение по памяти на тест256 megabytes

// В королевстве Олимпия находится N городов и M двусторонних дорог, каждая из которых
// соединяет ровно два города. Между двумя городами может быть более одной дороги.
// Дорога может соединять город с самим собой, образуя петлю.

// Все дороги постоянно грабятся разбойниками. В последнее время разбойникам надоело
// тратить силы на грабёж, и они обратились к могущественному и справедливому королю
// Олимпии с коммерческим предложением. Согласно этому предложению король должен
// отправить разбойникам подарок, состоящий из золотых и серебряных монет. В ответ
// на любезность короля разбойники прекратят грабить определённые дороги. Для каждой
// из дорог установлено: g_i — минимальное количество золотых и s_i — минимальное
// количество серебряных монет в подарке, чтобы её грабёж закончился. То есть, если
// в подарке a золотых и b серебряных монет, то прекращается грабёж всех дорог,
// для которых g_i ≤ a и s_i ≤ b.

// В казне короля нет ни одной золотой или серебряной монеты, но есть Олимпийские
// Тугрики. Цена одной золотой монеты в тугриках — G, а серебряной — S. Король хочет,
// чтобы после отправки подарка разбойникам между каждой парой городов существовал
// хотя бы один безопасный путь, который, возможно, проходит через другие города.
// Ваше задание — найти минимальное количество тугриков, которое нужно потратить королю
// для того, чтобы получить безопасные пути между каждой парой городов в королевстве.

// Входные данные
// Первая строка входных данных содержит два целых числа N и M (2 ≤ N ≤ 200,
// 1 ≤ M ≤ 50 000) — количество городов и количество дорог в королевстве Олимпия.
// Вторая строка содержит числа G и S (1 ≤ G, S ≤ 10^9). Последующие M строк содержат
// информацию о дорогах и описание предложения разбойников. В i + 2-ой строке входного
// файла находится четыре натуральных числа x_i, y_i, a_i, b_i, где x_i и y_i — номера
// городов, которые соединены i-ой дорогой (города нумеруются от 1 до N), а a_i, b_i —
// минимальное количество золотых и минимальное количество серебряных монет, которое
// нужно выслать разбойникам в подарке, чтобы i-ую дорогу прекратили грабить
// (1 ≤ x_i, y_i ≤ n, 1 ≤ g_i, s_i ≤ 10^9).

// Выходные данные
// Единственная строка должна содержать минимальное количество тугриков, которое нужно
// потратить королю на покупку золотых и серебряных монет, чтобы достичь своей цели.
// Выведите -1, в случае, если никакое количество тугриков не поможет.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 3 3
// 2 1
// 1 2 10 15
// 1 2 4 20
// 1 3 5 1
// ======================================================================
// Выходные данные
// ======================================================================
// 30
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long
#define all(a) a.begin(), a.end()
#define forr(i, n) for (int i = 0; i < n; i++)

struct DSU
{
    vector<int> p, r;
    DSU(int n)
    {
        p.resize(n), r.assign(n, 1);
        forr(i, n) p[i] = i;
    }

    int get(int x) { return p[x] = (x == p[x] ? x : get(p[x])); }

    bool united(int a, int b)
    {
        a = get(a), b = get(b);
        if (a != b)
        {
            if (r[a] > r[b])
                swap(a, b);
            p[a] = b;
            if (r[a] == r[b])
                b++;
            return 1;
        }
        return 0;
    }
};

struct Node
{
    int gold, silver, i, j;
};

void solve()
{
    int n, m, g, s;
    cin >> n >> m >> g >> s;

    vector<Node> a(m);
    for (auto &i : a)
        cin >> i.i >> i.j >> i.gold >> i.silver;

    sort(all(a), [](Node &a, Node &b)
         { return a.gold < b.gold; });

    vector<Node> x;
    long double res = 1e19;
    for (auto &curnd : a)
    {
        x.push_back(curnd);
        sort(all(x), [](Node &a, Node &b)
             { return a.silver < b.silver; });
        DSU d(n);
        vector<Node> next;
        for (auto &i : x)
            if (d.united(i.i - 1, i.j - 1))
                next.push_back(i);
        x = next;
        if (x.size() == n - 1)
        {
            long double mxs = x.back().silver, mxg = 0;
            for (auto &i : x)
                if (i.gold > mxg)
                    mxg = i.gold;
            res = min(res, g * mxg + s * mxs);
        }
    }
    cout << setprecision(30) << (res == 1e19 ? -1 : res) << '\n';
    // cout << setprecision(30) << res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
