// A. Карен и утро
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест512 мегабайт

// Карен готовится к новому школьному дню!

// Сейчас время чч:мм по 24-часовому формату. Как вы знаете, Карен любит палиндромы,
// поэтому ей кажется, что если проснуться в момент времени, являющийся палиндромом,
// то день будет удачный.

// Сколько минимум минут ей нужно ещё поспать, чтобы время было палиндромом,
// когда она проснётся?

// Напомним, что палиндром — это строка, которая читается одинаково слева направо
// и справа налево. Например, 05:39 — это не палиндром, так как 05:39 справа налево —
// 93:50. С другой стороны, 05:50 — палиндром, потому что 05:50 справа налево — 05:50.

// Входные данные
// Единственная строка содержит время в формате чч:мм (00 ≤ чч ≤ 23, 00 ≤ мм ≤ 59).

// Выходные данные
// Выведите единственное число — минимальное число минут Карен должна поспать,
// чтобы проснуться в момент времени, являющийся палиндромом.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 05:39
// ======================================================================
// Выходные данные
// ======================================================================
// 11

// ======================================================================
// Входные данные
// ======================================================================
// 13:31
// ======================================================================
// Выходные данные
// ======================================================================
// 0

// ======================================================================
// Входные данные
// ======================================================================
// 23:59
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// ======================================================================

// Примечание
// В первом примере Карен должна поспать минимум 11 минут. Тогда она проснётся
// в 05:50, что является палиндромом.

// Во втором примере Карен может проснуться прямо сейчас, так как текущее время
// 13:31 является палиндромом.

// В третьем примере Карен должна поспать минимум 1 минуту. Она может проснуться
// в 00:00, когда время является палиндромом.

#include <bits/stdc++.h>
using namespace std;

#define int long long

bool is_polindr(int h, int m)
{
    string sh = (h < 10 ? "0" : "") + to_string(h);
    string sm = (m < 10 ? "0" : "") + to_string(m);
    return sh[0] == sm[1] && sh[1] == sm[0];
};

void solve()
{
    string s;
    cin >> s;
    // cout << (char)(s[1] + 1);
    int h = stoi(s.substr(0, 2)), m = stoi(s.substr(3, 2)), res = 0;
    while (1)
    {
        if (is_polindr(h, m))
        {
            cout << res;
            return;
        }
        res++;
        m++;
        if (m == 60)
        {
            m = 0;
            h++;
            if (h == 24)
                h = 0;
        }
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
