// B. Карен и кофе
// ограничение по времени на тест2.5 секунд
// ограничение по памяти на тест512 мегабайт

// Для того чтобы оставаться бодрой и внимательной во время занятий, Карен нужен кофе!

// Карен — поклонница кофе — хочет узнать оптимальную температуру заваривания кофе.
// Для этого она потратила некоторое время на чтение нескольких книг рецептов, в том
// числе общепризнанную книгу «Искусство ковфефе».

// Карен знает n рецептов кофе. i-й из них рекомендует заваривать кофе при температуре
// от l_i до r_i градусов включительно.

// Карен считает, что температура является приемлемой, если хотя бы k рецептов
// рекомендуют её.

// Карен очень непостоянная, поэтому у неё есть q вопросов. В каждом вопросе она хочет
// заварить кофе с целочисленной температурой от a до b градусов включительно, и хочет
// узнать, сколько приемлемых целочисленных температур находятся в этом промежутке.

// Входные данные
// В первой строке содержится три целых числа n, k (1 ≤ k ≤ n ≤ 200000) и q
// (1 ≤ q ≤ 200000) — число рецептов, минимальное количество рецептов, необходимое
// для признания температуры приемлемой, и количество вопросов Карен соответственно.

// Следующие n строк описывают рецепты. А именно, i-я из этих строк содержит два целых
// числа l_i и r_i (1 ≤ l_i ≤ r_i ≤ 200000), означающих, что i-й рецепт рекомендует
// заваривать кофе с температурой между l_i и r_i градусами включительно.

// Следующие q строк описывают вопросы Карен. Каждая из этих строк содержит два целых
// числа a и b (1 ≤ a ≤ b ≤ 200000), означающих, что она хочет узнать число приемлемых
// целочисленных температур между a и b градусами включительно.

// Выходные данные
// Для каждого вопроса выведите одно целое число — число приемлемых целочисленных
// температур между a и b градусами включительно.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 3 2 4
// 91 94
// 92 97
// 97 99
// 92 94
// 93 97
// 95 96
// 90 100
// ======================================================================
// Выходные данные
// ======================================================================
// 3
// 3
// 0
// 4

// ======================================================================
// Входные данные
// ======================================================================
// 2 1 1
// 1 1
// 200000 200000
// 90 100
// ======================================================================
// Выходные данные
// ======================================================================
// 0
// ======================================================================

// Примечание
// В первом примере Карен знает 3 рецепта.

// Первый рекомендует заваривать кофе при температуре между 91 и 94 градусами включительно.
// Второй рекомендует заваривать кофе при температуре между 92 и 97 градусами включительно.
// Третий рекомендует заваривать кофе при температуре между 97 и 99 градусами включительно.
// Температура является приемлемой, если хотя бы 2 рецепта её рекомендуют.

// У Карен 4 вопроса.

// В первом вопросе она хочет узнать число приемлемых целочисленных температур между
// 92 и 94 градусами включительно. Таких 3: 92, 93 и 94 градуса являются приемлемыми.

// Во втором вопросе она хочет узнать число приемлемых целочисленных температур между
// 93 и 97 градусами включительно. Таких 3: 93, 94 и 97 градуса являются приемлемыми.

// В третьем вопросе она хочет узнать число приемлемых целочисленных температур между
// 95 и 96 градусами включительно. Таких нет.

// В последнем вопросе она хочет узнать число приемлемых целочисленных температур между
// 90 и 100 градусами включительно. Таких 4: 92, 93, 94 и 97 градуса являются приемлемыми.

// Во втором примере Карен знает 2 рецепта.

// Первый из них, «wikiHow to make Cold Brew Coffee», рекомендует заваривать кофе при
// температуре ровно 1 градус.
// Второй, «Разве является кофе то, что не заварено при температуре не меньше 36.3306
// температур Солнца?», рекомендует заваривать кофе при ровно 200000 градусов.
// Температура является приемлемой, если хотя бы 1 рецепт её рекомендует.

// В первом и единственном вопросе Карен хочет узнать, сколько приемлемых температур
// действительно являются осмысленными. Таких нет.

#include <bits/stdc++.h>
using namespace std;

#define int long long

// struct Node
// {
//     int count, value;
// };

// struct SegTree
// {
// private:
//     vector<Node> tree;
//     int size = 1;
// };

const int SIZE = 200000;

void solve()
{
    int n, k, q;
    cin >> n >> k >> q;
    // vector<pair<int, int>> a(n);
    vector<int> c(SIZE + 2, 0), pref(SIZE + 3, 0); //, pref2(SIZE + 3, 0);
    // for (auto &[l, r] : a)
    //     cin >> l >> r;
    for (int i = 0; i < n; i++)
    {
        int l, r;
        cin >> l >> r;
        c[l] += 1;
        c[r + 1] -= 1;
    }
    for (int i = 0; i <= SIZE; i++)
        pref[i + 1] = pref[i] + c[i];

    for (int i = 0; i <= SIZE; i++)
        c[i] = pref[i + 1] >= k;

    pref.assign(SIZE + 3, 0);
    for (int i = 0; i <= SIZE; i++)
        pref[i + 1] = pref[i] + c[i];

    // for (int i = 0; i <= SIZE; i++)
    //     pref2[i + 1] = pref2[i] + c[i];

    // for (int i = 90; i <= 120; i++)
    // {
    //     cout << pref2[i] << ' ';
    // }

    while (q--)
    {
        int ql, qr;
        cin >> ql >> qr;
        // int res = 0, curs = pref[ql];
        // for (int i = ql; i <= qr; i++)
        // {
        //     curs += c[i];
        //     if (curs >= k)
        //         res++;
        // }
        cout << pref[qr + 1] - pref[ql] << '\n';
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
