// A. Double Cola
// ограничение по времени на тест1 second
// ограничение по памяти на тест256 megabytes

// Шелдон, Леонард, Пенни, Раджеш и Говард стоят в очереди к автомату по продаже
// баночек с напитком «Double Cola», других людей в очереди нет. Первый в очереди
// (Шелдон) покупает баночку, выпивает её содержимое и раздваивается! Получившиеся
// два Шелдона встают в конец очереди. Затем следующий в очереди (Леонард) покупает
// баночку, выпивает и встаёт в конец очереди в двойном экземпляре, и так далее.
// Этот процесс продолжается до бесконечности.

// Например, третью баночку колы выпьет Пенни, и очередь будет выглядеть так:
// Раджеш, Говард, Шелдон, Шелдон, Леонард, Леонард, Пенни, Пенни.

// Напишите программу, которая выведет имя человека, выпившего n-ую баночку.

// Обратите внимание, что в самом начале очередь выглядит так: Шелдон, Леонард, Пенни,
// Раджеш, Говард. Первым человеком является Шелдон.

// Входные данные
// Входные данные состоят из единственного целого числа n (1 ≤ n ≤ 10^9).

// Гарантируется, что в претестах проверяется правильность написания всех пяти имён,
// то есть в них встречаются все пять возможных ответов.

// Выходные данные
// Выведите единственную строку — имя человека, который выпьет n-ую баночку колы.
// Баночки нумеруются от 1. Обратите внимание, что следует выводить имена в следующем
// написании: "Sheldon", "Leonard", "Penny", "Rajesh", "Howard" (без кавычек).
// Именно в этом порядке друзья стоят в очереди изначально.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 1
// ======================================================================
// Выходные данные
// ======================================================================
// Sheldon

// ======================================================================
// Входные данные
// ======================================================================
// 6
// ======================================================================
// Выходные данные
// ======================================================================
// Sheldon

// ======================================================================
// Входные данные
// ======================================================================
// 1802
// ======================================================================
// Выходные данные
// ======================================================================
// Penny
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

const string RS[] = {"Sheldon", "Leonard", "Penny", "Rajesh", "Howard"};

void solve()
{
    int n;
    cin >> n;
    int s = 10, i = 1, cur = 5;
    while (n > cur)
    {
        cur += s;
        s *= 2;
        i *= 2;
    }
    cout << RS[((n - (cur - s / 2)) + i - 1) / i - 1];
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}

//    1       2       3       4       5     5
//   1 1     2 2     3 3     4 4     5 5    10
// 1 1 1 1 2 2 2 2 3 3 3 3 4 4 4 4 5 5 5 5  20 - > 40
