// C. Путешествие
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// В Семи Королевствах n городов и n − 1 дорога, каждая дорога соединяет два города,
// и возможно достичь каждый город из каждого, передвигаясь по дорогам.

// Теон и Яра Грейджой начинают путешествовать на лошади по дорогам из первого города.
// Из-за тумана они не видят, куда лошадь их везёт. Когда лошадь входит в город
// (в том числе в первый), она направляется в один из городов, соединённых с ним.
// Но это странная лошадь, поэтому она пойдёт только в город, в котором до этого
// не была. Она идёт равновероятно в каждый из таких городов и останавливается,
// если таких городов нет.

// Пусть длина каждой дороги 1. Путешествие начинается в городе 1. Чему равно
// математическое ожидание длины их путешествия? Формально, математическое ожидание —
// это ожидаемое (то есть среднее) значение. Подробнее можно прочесть по ссылке
// https://ru.wikipedia.org/wiki/Математическое_ожидание.

// Входные данные
// Первая строка содержит одно целое число n (1 ≤ n ≤ 100000) — количество городов.

// Далее следует n − 1 строк. i-я из них содержит два целых числа u_i и v_i
// (1 ≤ u_i, v_i ≤ n, u_i ≠ v_i) — номера городов, соединённых i-й дорогой.

// Гарантируется, что возможно достичь каждый город из каждого, передвигаясь
// по дорогам.

// Выходные данные
// Выведите одно число — математическое ожидание длины путешествия. Путешествие
// начинается в городе 1.

// Ваш ответ будет считаться правильным, если его абсолютная или относительная
// точность не превосходит 10^{-6}.

// А именно, если ваш ответ равен a, а ответ жюри равен b, то ваш ответ будет зачтён,
// если |a − b| ≤ 10^{-6} · max(1, |b|).

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 1 2
// 1 3
// 2 4
// ======================================================================
// Выходные данные
// ======================================================================
// 1.500000000000000

// ======================================================================
// Входные данные
// ======================================================================
// 5
// 1 2
// 1 3
// 3 4
// 2 5
// ======================================================================
// Выходные данные
// ======================================================================
// 2.000000000000000
// ======================================================================

// Примечание
// В первом примере путешествие может закончиться в городах 3 или 4 с равной
// вероятностью. Расстояние до городов 3 и 4 равно 1 и 2 соответственно, поэтому
// матожидание длины равно 1.5.

// Во втором примере путешествие может закончиться в городах 4 или 5. Расстояние
// до обоих городов 2, поэтому матожидание равно 2.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<vector<int>> graph(n);
    for (int i = 0; i < n - 1; i++)
    {
        int u, v;
        cin >> u >> v;
        u--, v--;
        graph[u].push_back(v);
        graph[v].push_back(u);
    }
    vector<int> p(n, 0), m;
    queue<int> q;
    q.push(0);
    p[0] = -1;
    while (!q.empty())
    {
        int cur = q.front();
        q.pop();
        m.push_back(cur);
        for (auto &i : graph[cur])
        {
            if (p[cur] != i)
            {
                p[i] = cur;
                q.push(i);
            }
        }
    }
    vector<double> t(n, 0);
    for (int i = n - 1; i >= 0; i--)
    {
        int cur = m[i];
        double sm = 0, cnt = 0;

        for (auto &i : graph[cur])
        {
            if (i != p[cur])
            {
                cnt++;
                sm += t[i];
            }
        }
        if (cnt)
            t[cur] = 1.0 + sm / cnt;
    }

    cout << setprecision(30) << t[0];
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
