// C. Слух
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вова пообещал себе больше никогда не играть в игры... Но недавно компания Firestorm
// выпустила очень популярную игру — World of Farcraft, и Вова, конечно же, начал
// в неё играть.

// Он впал в ступор при выполнении очередного квеста — необходимо было прийти
// в поселение Надгород и распространить там слух.

// Вова знает, что в Надгороде живут n персонажей. Некоторые персонажи дружат между
// собой и готовы делиться информацией друг с другом. Также он знает, что i-й персонаж
// готов начать распространять слух за c_i золота. Как только персонаж узнаёт слух,
// он рассказывает его всем своим друзьям, которые, в свою очередь, тоже начинают
// распространять этот слух (но уже бесплатно).

// Вова хочет, чтобы слух узнали все n персонажей Надгорода. За какое минимальное
// количество золота он сможет это сделать?

// Посмотрите примечание для лучшего понимания задачи.

// Входные данные
// В первой строке входных данных задано два целых числа n и m (1 ≤ n ≤ 10^5,
// 0 ≤ m ≤ 10^5) — количество людей в Надгороде и количество дружеских связей между ними.

// В следующей строке входных данных заданы n целых чисел c_i (0 ≤ c_i ≤ 10^9) —
// количество золота, за которое i-й персонаж готов начать распространять слух.

// В следующих m строках заданы пары (x_i, y_i), обозначающие, что персонажи x_i и y_i
// дружат (1 ≤ x_i, y_i ≤ n, x_i ≠ y_i). Гарантируется, что никакая пара дружащих
// персонажей не повторяется.

// Выходные данные
// Выведите единственное число — минимальное количество золота, за которое Вова сможет
// выполнить квест.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5 2
// 2 5 3 4 8
// 1 4
// 4 5
// ======================================================================
// Выходные данные
// ======================================================================
// 10

// ======================================================================
// Входные данные
// ======================================================================
// 10 0
// 1 2 3 4 5 6 7 8 9 10
// ======================================================================
// Выходные данные
// ======================================================================
// 55

// ======================================================================
// Входные данные
// ======================================================================
// 10 5
// 1 6 2 7 3 8 4 9 5 10
// 1 2
// 3 4
// 5 6
// 7 8
// 9 10
// ======================================================================
// Выходные данные
// ======================================================================
// 15
// ======================================================================

// Примечание
// В первом тестовом примере Вове выгоднее всего заплатить первому персонажу (он узнает
// слух и расскажет его четвёртому персонажу, который в свою очередь расскажет его
// пятому персонажу). Также ему будет необходимо заплатить второму и третьему
// персонажам, чтобы они тоже узнали слух.

// Во втором тестовом примере необходимо заплатить всем персонажам.

// В третьем тестовом примере необходимо заплатить первому, третьему, пятому, седьмому
// и девятому персонажам, которые расскажут слух своим друзьям.

#include <bits/stdc++.h>
using namespace std;

#define int long long

int f(vector<vector<int>> &fr, vector<bool> &v, int x, vector<int> &c)
{
    v[x] = 1;
    int min_price = c[x];
    for (auto &i : fr[x])
        if (!v[i])
            min_price = min(f(fr, v, i, c), min_price);
    return min_price;
}

void solve()
{
    int n, m;
    cin >> n >> m;
    vector<int> c(n);
    for (auto &i : c)
        cin >> i;
    vector<vector<int>> fr(n);
    while (m--)
    {
        int x, y;
        cin >> x >> y;
        x--;
        y--;
        fr[x].push_back(y);
        fr[y].push_back(x);
    }

    int res = 0;

    vector<bool> visited(n, 0);
    for (int i = 0; i < n; i++)
    {
        if (!visited[i])
            res += f(fr, visited, i, c);
    }
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
