// B. Прекрасное число
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Будем называть положительное целое число прекрасным, если и только если сумма его цифр равна 10. Вам дано целое число k, найдите k-е по величине прекрасное положительное целое число.

// Входные данные
// Единственная строка содержит одно целое число k (1 ≤ k ≤ 10000).

// Выходные данные
// Выведите k-е по величине прекрасное число.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 1
// ======================================================================
// Выходные данные
// ======================================================================
// 19

// ======================================================================
// Входные данные
// ======================================================================
// 2
// ======================================================================
// Выходные данные
// ======================================================================
// 28
// ======================================================================

// Примечание
// Первое прекрасное число равно 19, а второе — 28.

#include <bits/stdc++.h>
using namespace std;

#define int long long

int s(int x)
{
    int res = 0;
    while (x)
    {
        res += x % 10;
        x /= 10;
    }
    return res;
}

void solve()
{
    int k;
    cin >> k;
    int cur = 19;
    for (int i = 0; i < k; i++)
    {
        while (s(cur) != 10)
            cur++;
        cur++;
    }
    cout << cur - 1;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
