// B. Сон на лекции
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Вы со своим другом Мишкой сидите на лекции по математическому анализу. Лекция
// длится n минут. Лектор рассказывает a_i теорем в течение i-й минуты.

// Хотя Мишке очень нравится математический анализ, иногда очень трудно не засыпать
// во время лекции. Вам задан массив t поведения Мишки. Если он спит в течение i-й
// минуты лекции, то t_i = 0, иначе t_i = 1. Когда Мишка не спит, он записывает все
// теоремы, которые слышит — a_i теорем в течение i-й минуты. Иначе он не записывает
// ничего.

// Вы знаете некоторую секретную технику, при помощи которой можно заставить не спать
// Мишку в течение k минут подряд. Но вы можете использовать её только один раз.
// Вы можете начать использовать её в любую минуту с 1 по n − k + 1. Если вы используете
// её в минуту i, Мишка не будет спать во все такие минуты j, что i ≤ j ≤ i + k − 1,
// и будет записывать все лекции, которые расскажет лектор.

// Ваша задача состоит в том, чтобы посчитать, какое максимальное количество теорем
// Мишка сможет записать, если вы используете секретную технику, чтобы заставить его
// не спать, только один раз.

// Входные данные
// Первая строка входных данных содержит два целых числа n и k (1 ≤ k ≤ n ≤ 10^5) —
// длительность лекции в минутах и количество минут, на которое вы можете заставить
// Мишку не спать.

// Вторая строка входных данных содержит n целых чисел a1, a2, …, a_n (1 ≤ a_i ≤ 10^4) —
// количество теорем, которые лектор рассказывает в течение i-й минуты.

// Третья строка входных данных содержит n целых чисел t1, t2, …, t_n (0 ≤ t_i ≤ 1) —
// тип поведения Мишки во время i-й минуты лекции.

// Выходные данные
// Выведите единственное целое число — максимальное количество теорем, которое Мишка
// сможет записать, если вы используете секретную технику, чтобы заставить его не спать,
// только один раз.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6 3
// 1 3 5 2 5 4
// 1 1 0 1 0 0
// ======================================================================
// Выходные данные
// ======================================================================
// 16
// ======================================================================

// Примечание
// В примере лучше всего использовать секретную технику в начале третьей минуты.
// Тогда количество теорем, которое Мишка сможет записать, будет равно 16.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, k, s = 0;
    cin >> n >> k;
    vector<int> a(n), t(n);
    for (auto &i : a)
        cin >> i;
    for (int i = 0; i < n; i++)
    {
        cin >> t[i];
        s += t[i] ? a[i] : 0;
    }

    int l = 0, r = 0, cur_s = 0, res = 0;
    while (r < n)
    {
        while (l < n && r - l + 1 > k)
        {
            if (t[l] == 0)
                cur_s -= a[l];
            l++;
        }
        while (r < n && r - l + 1 <= k)
        {
            if (t[r] == 0)
                cur_s += a[r];
            r++;
        }
        res = max(cur_s, res);
        // cout << cur_s << ' ';
        // r++;

        // if (r < n && t[r] == 0)
        //     cur_s += a[r];
    }
    // cout << '\n';

    cout << s + res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
