// B. Счастливые числа (упрощенная версия)
// ограничение по времени на тест2 seconds
// ограничение по памяти на тест256 megabytes

// Петя любит счастливые числа. Всем известно, что счастливыми являются натуральные
// числа, в десятичной записи которых содержатся только счастливые цифры 4 и 7.
// Например, числа 47, 744, 4 являются счастливыми, а 5, 17, 467 — не являются.

// Очень счастливыми называются счастливые числа, в которых содержится одинаковое
// количество цифр 4 и 7. Например, числа 47, 7744, 474477 являются очень счастливыми
// числами, а 4, 744, 467 — не являются.

// Однажды Пете встретилось натуральное число n. Найдите наименьшее очень счастливое
// число, которое не меньше n.

// Входные данные
// В единственной строке задано натуральное число n (1 ≤ n ≤ 10^9). Это число не
// содержит лидирующих нулей.

// Выходные данные
// В единственной строке выведите наименьшее очень счастливое число, которое больше
// или равно n.

// Пожалуйста, не используйте спецификатор %lld для чтения или записи 64-битных чисел
// на C++. Рекомендуется использовать потоки cin, cout или спецификатор %I64d.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 4500
// ======================================================================
// Выходные данные
// ======================================================================
// 4747

// ======================================================================
// Входные данные
// ======================================================================
// 47
// ======================================================================
// Выходные данные
// ======================================================================
// 47
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

// #define int long long

void solve()
{
    string s;
    cin >> s;
    int c = stoi(s);

    // cout << c;
    int ss = s.size();
    for (int l = ss + ss % 2; l <= 10; l += 2)
    {
        for (unsigned int i = 0; i < 1 << l; i++)
        {
            int t = popcount(i);
            if (t == l / 2)
            {
                long long res = 0;
                for (int j = l - 1; j >= 0; j--)
                {
                    res *= 10;
                    if (i >> j & 1)
                        res += 7;
                    else
                        res += 4;
                }
                if (res < c)
                    continue;
                cout << res;

                return;
            }
        }
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
