// B. Гигантомахия
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Два гиганта Бо и Бер играют в игру. У каждого гиганта есть своя горная гряда.
// Вы уже успели измерить все эти горы и теперь знаете, что высоты гор в гряде Бо
// a1, a2, …, a_n, а в гряде Бера b1, b2, …, b_m; горы нумеруются слева направо у Бо
// и справа налево у Бера. В начале игры гиганты стоят на горе с номером 1. Таким
// образом, они смотрят друг на друга и видят все свои горы и все горы соперника.
// Оказалось, что Бо и Бер ценители прекрасного, поэтому горы в грядах располагаются
// в порядке невозрастания, строго говоря, a_i ≥ a_{i+1} для 1 ≤ i < n и b_i ≥ b_{i+1}
// для 1 ≤ i < m.

// На рисунке ниже изображён пример начального расположения, где Бо имеет гряду
// a1, a2, a3 = 3, 2, 1, Бер имеет гряду b1, b2 = 4, 2. Для простоты горы изображены
// прямоугольниками, слева горы Бо, справа Бера. Для Вашего хорошего настроения
// гиганты Бо и Бер обозначены бобрами.

// Бо и Бер не очень умны, поэтому каждый ход они делают одно и то же действие.
// А именно, гигант в свой ход берёт валун и кидает его в гору, на которой стоит его
// соперник; от этого действия высота этой горы уменьшается на 1. Если гигант в свой
// ход видит, что гора прямо перед ним выше (с номером на 1 больше), чем та, на которой
// он стоит, то он перепрыгивает на неё. Если же гигант в свой ход обнаруживает,
// что стоит на обычной земле (высота текущей горы 0) и перед ним нет больше гор,
// то признаёт своё поражение. Первым ходит Бо.

// Вы знаете, что их игра может длиться очень долго, ввиду огромных высот гор
// и их количества, поэтому вы хотите посчитать, кто же победит.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 500) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// Первая строка каждого набора входных данных содержит два целых числа n и m —
// количество гор в гряде первого и второго гиганта соответственно (1 ≤ n, m ≤ 100).

// Вторая строка каждого набора входных данных содержит n целых чисел a1, a2, …, a_n —
// высоты гор первого гиганта (1 ≤ a_i ≤ 10^9; a_i ≥ a_{i+1}).

// Третья строка каждого набора входных данных содержит m целых чисел b1, b2, …, b_m —
// высоты гор второго гиганта (1 ≤ b_i ≤ 10^9; b_i ≥ b_{i+1}).

// Выходные данные
// Для каждого набора входных данных выведите единственное число — номер гиганта,
// который победит.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 1 1
// 1
// 1
// 1 1
// 1
// 2
// 1 2
// 4
// 4 1
// 4 2
// 4 3 2 1
// 10 1
// 4 2
// 4 3 2 1
// 6 5
// 4 2
// 4 3 2 1
// 7 5
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 2
// 2
// 2
// 1
// 2
// ======================================================================

// Примечание
// В первом наборе первым же своим ходом Бо уменьшит высоту единственной горы Бера
// до 0 и победит.

// Во втором наборе Бо уменьшит высоту горы Бера до 1, а Бер уже следующим своим ходом
// победит.

// В третьем наборе за первые 3 раунда высота гор Бо и Бера уменьшится до 1. Затем Бо
// уменьшит высоту горы Бера до 0, но у Бера осталась ещё одна гора; в свой ход он
// перепрыгивает на неё и этим же ходом побеждает, уменьшая высоту единственной горы
// Бо до 0.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, m;
    cin >> n >> m;
    vector<int> a(n), b(m);
    for (auto &i : a)
        cin >> i;
    for (auto &i : b)
        cin >> i;
    int sta = a[n - 1], stb = b[m - 1];
    for (int i = 1; i < n; i++)
        sta += a[i - 1] - a[i] + 1;
    for (int i = 1; i < m; i++)
        stb += b[i - 1] - b[i] + 1;

    if (sta >= stb)
        cout << "1\n";
    else
        cout << "2\n";
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
