// // C. Битовые OR и AND
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест1024 мегабайта

// Есть массив из n элементов, изначально заполненный нулями. Вам нужно написать
// структуру данных, которая обрабатывает два вида запросов:

// - применить ко всем элементам от l до r−1 операцию a_i = a_i | v (битовый OR);
// - найти битовый AND элементов на отрезке от l до r−1.

// Входные данные
// Первая строка содержит два числа n и m (1 ≤ n, m ≤ 100000) — размер массива
// и число операций. Далее следует описание операций. Описание каждой операции
// имеет следующий вид:

// 1 l r v — применить ко всем элементам от l до r−1 операцию a_i = a_i | v
// (0 ≤ l < r ≤ n, 0 ≤ v < 2^30).
// 2 l r — найти битовый AND элементов на отрезке от l до r−1 (0 ≤ l < r ≤ n).

// Выходные данные
// Для каждой операции второго типа выведите соответствующее значение.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5 6
// 1 0 3 3
// 2 1 2
// 1 1 4 4
// 2 1 3
// 2 1 4
// 2 3 5
// ======================================================================
// Выходные данные
// ======================================================================
// 3
// 7
// 4
// 0

// ======================================================================
// Входные данные
// ======================================================================
// 2 3
// 1 0 1 3
// 1 1 2 9
// 2 0 2
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long
#define ull unsigned long long
#define all(a) a.begin(), a.end()

struct SegTree
{
public:
    SegTree(int n)
    {
        while (size < n)
            size *= 2;
        tree.assign(4 * size, {0, 0});
    };

    ull get(int l, int r) { return get(l, r, 0, 0, size); };

    void modify(int l, int r, ull v) { modify(l, r, v, 0, 0, size); };

private:
    struct Node
    {
        ull BOr, BAnd;
    };

    vector<Node> tree;
    int size = 1;
    const ull NO_OPERATION = ~0ULL;

    ull get(int l, int r, int x, int lx, int rx)
    {
        if (lx >= l && rx <= r)
            return tree[x].BAnd;
        if (rx <= l || lx >= r)
            return NO_OPERATION;
        int m = (rx + lx) / 2;
        int r1 = get(l, r, 2 * x + 1, lx, m), r2 = get(l, r, 2 * x + 2, m, rx);
        // if (tree[x].BAnd != NO_OPERATION)
        return (r1 & r2) | tree[x].BOr;
        // return r1 & r2;
    };

    void modify(int l, int r, ull v, int x, int lx, int rx)
    {
        if (lx >= l && rx <= r)
        {
            tree[x].BAnd |= v;
            tree[x].BOr |= v;
            return;
        }
        if (rx <= l || lx >= r)
            return;
        int m = (rx + lx) / 2;
        modify(l, r, v, 2 * x + 1, lx, m);
        modify(l, r, v, 2 * x + 2, m, rx);
        tree[x].BAnd = (tree[2 * x + 1].BAnd & tree[2 * x + 2].BAnd) | tree[x].BOr;
    };
};

void solve()
{
    int n, m;
    cin >> n >> m;

    SegTree st(n);
    while (m--)
    {
        int t, l, r;
        cin >> t >> l >> r;
        if (t == 1)
        {
            ull v;
            cin >> v;
            st.modify(l, r, v);
        }
        else
            cout << st.get(l, r) << '\n';
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
