// B. Удалить и сконкатенировать
// ограничение по времени на тест1.5 секунд
// ограничение по памяти на тест256 мегабайт

// Дан массив a из n целых чисел. Ваш начальный счёт равен 0.

// Вы можете выполнять следующие два типа операций любое количество раз, пока массив
// не станет пустым:

// - Выберите один элемент. Прибавьте его значение к вашему счёту и удалите его
//   из массива.
// - Выберите два соседних элемента. Прибавьте максимум из их значений к вашему счёту
//   и удалите оба элемента из массива. (Для этой операции в массиве должно быть
//   как минимум 2 элемента.)

// После каждой операции оставшиеся части массива конкатенируются без изменения их
// относительного порядка.

// Также дано целое число c, которое обозначает стоимость выполнения одной операции.
// Каждый раз, когда вы выполняете операцию (независимо от её типа), c вычитается
// из вашего счёта.

// Найдите максимальный возможный итоговый счёт, которого вы можете добиться.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 10^4) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// Первая строка каждого набора входных данных содержит два целых числа n и c
// (1 ≤ n ≤ 2·10^5, 0 ≤ c ≤ 10^9), обозначающие длину a и стоимость выполнения
// одной операции соответственно.

// Вторая строка содержит n целых чисел a1, a2, …, a_n (−10^9 ≤ a_i ≤ 10^9),
// обозначающих элементы a.

// Гарантируется, что сумма значений n по всем наборам входных данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите целое число, обозначающее максимальный
// возможный счёт, которого вы можете добиться.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 1 0
// -1
// 3 0
// 1 3 1
// 3 2
// 1 3 1
// 6 6
// 3 1 4 1 5 9
// 4 1000000000
// -1000000000 -1000000000 -1000000000 -1000000000
// ======================================================================
// Выходные данные
// ======================================================================
// -1
// 5
// 0
// 0
// -4000000000
// ======================================================================

// Примечание
// В первом наборе входных данных ваш единственный возможный выбор — выполнить первую
// операцию один раз. Ваш счёт равен a1 − c = −1 − 0 = −1.

// Во втором наборе входных данных одна из оптимальных последовательностей операций такая:

// - Выберите 3. Ваш счёт становится 0 + 3 − 0 = 3, а массив становится [1, 1].
// - Выберите первую 1. Ваш счёт становится 3 + 1 − 0 = 4, а массив становится [1].
// - Выберите 1. Ваш счёт становится 4 + 1 − 0 = 5, а массив становится пустым.

// В третьем наборе входных данных одна из оптимальных последовательностей операций такая:

// - Выберите 3 и вторую 1. Ваш счёт становится 0 + max(3, 1) − 2 = 1, а массив становится [1].
// - Выберите 1. Ваш счёт становится 1 + 1 − 2 = 0, а массив становится пустым.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, c, res = 0;
    cin >> n >> c;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;

    // if (c == 0)
    // {
    //     int r = 0;
    //     for (auto i : a)
    //         r += i;
    //     cout << r << '\n';
    //     return;
    // }

    for (int i = 0; i < n; i++)
    {
        if (i < n - 1 && c && max(i, i + 1) > i)
        {
            res += max(a[i], a[i + 1]) - c;
            i++;
        }
        else
            res += a[i] - c;
    }
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }

    return 0;
}
