// A. Нулевая сумма
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Вам дан массив a длины n, состоящий только из −1 и 1.

// Вы можете выполнить следующую операцию над массивом a любое количество раз:

// - Выбрать индекс i, удовлетворяющий 1 ≤ i ≤ n − 1.
// - Присвоить a_i = −a_i и a_{i+1} = −a_{i+1}.

// Определите, возможно ли добиться того, чтобы сумма всех элементов массива a
// стала равна 0.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 200) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// В первой строке каждого набора входных данных дано одно целое число n (1 ≤ n ≤ 100) —
// длина массива a.

// Во второй строке каждого набора входных данных даны n целых чисел a1, a2, …, a_n
// (a_i ∈ {−1, 1}) — массив a.

// Выходные данные
// Для каждого набора входных данных выведите «YES», если возможно добиться того,
// чтобы сумма всех элементов массива a стала равна 0, и «NO» в противном случае.

// Вы можете выводить каждую букву в любом регистре (строчную или заглавную). Например,
// строки «yEs», «yes», «Yes» и «YES» будут приняты как положительный ответ.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 1
// -1
// 2
// 1 -1
// 2
// 1 1
// 5
// 1 -1 1 -1 1
// 6
// -1 1 -1 -1 -1 -1
// ======================================================================
// Выходные данные
// ======================================================================
// NO
// YES
// NO
// NO
// YES
// ======================================================================

// Примечание
// В первом наборе входных данных мы не можем выполнять операции, а сумма всех
// элементов массива a равна −1 ≠ 0, поэтому ответ — «NO».

// Во втором наборе входных данных сумма всех элементов массива a уже равна 0,
// поэтому ответ — «YES».

// В пятом наборе входных данных мы можем выполнить операцию с i = 3, после чего
// массив a изменится следующим образом:
// [−1, 1, −1, −1, −1, −1] → [−1, 1, 1, 1, −1, −1].
// Сумма элементов полученного массива равна 0, поэтому ответ — «YES».

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, pos = 0, neg = 0;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
    {
        cin >> i;
        if (i == 1)
            pos++;
        else
            neg++;
    }
    if (n % 2 != 0 || abs(pos - neg) % 4 != 0)
    {
        cout << "NO\n";
        return;
    }
    for (int i = 0; i < n - 1; i++)
    {
        if (pos == neg)
        {
            cout << "YES\n";
            return;
        }
        if (a[i] == a[i + 1])
        {
            if (a[i] == 1)
            {
                neg += 2;
                pos -= 2;
                a[i] = -1;
                a[i + 1] = -1;
            }
            else
            {
                neg -= 2;
                pos += 2;
                a[i] = 1;
                a[i + 1] = 1;
            }
        }
    }
    cout << "NO\n";
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
