// B. Еще один конструктив
// ограничение по времени на тест1.5 секунд
// ограничение по памяти на тест256 мегабайт

// Вам даны три целых числа n, k и m.

// Назовём массив a длины n, состоящий из положительных целых чисел, хорошим, если
// минимальная длина непустого подмассива* массива a, сумма элементов которого
// делится на m, равна k.

// Формально, массив a является хорошим, если выполняются следующие условия:

// - существуют такие целые числа l и r, что 1 ≤ l ≤ r ≤ n, r − l + 1 = k
//   и ∑_{i=l}^{r} a_i делится на m;
// - не существует таких целых чисел l и r, что 1 ≤ l ≤ r ≤ n, r − l + 1 < k
//   и ∑_{i=l}^{r} a_i делится на m.

// Найдите любой хороший массив a или определите, что такого массива не существует.

// * Массив a является подмассивом массива b, если a может быть получен из b удалением
// нескольких (возможно, ни одного или всех) элементов с начала и нескольких (возможно,
// ни одного или всех) элементов с конца.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 10^4) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// Каждая из следующих t строк содержит три целых числа n, k и m
// (1 ≤ k ≤ n ≤ 2·10^5, 1 ≤ m ≤ 10^9).

// Гарантируется, что сумма значений n по всем наборам входных данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора входных данных, если такой массив существует, выведите «YES»
// в первой строке. Во второй строке выведите n целых чисел a1, a2, …, a_n
// (1 ≤ a_i ≤ 10^18) — массив a, удовлетворяющий условиям задачи. Если существует
// несколько решений, выведите любое из них.

// Иначе выведите единственную строку, содержащую «NO».

// Вы можете выводить каждую букву в любом регистре (строчную или заглавную). Например,
// строки «yEs», «yes», «Yes» и «YES» будут распознаны как положительный ответ.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 1 1 1
// 5 3 5
// 2 2 1000000000
// 6 4 3
// ======================================================================
// Выходные данные
// ======================================================================
// YES
// 1
// YES
// 9 17 14 23 11
// YES
// 500000000 500000000
// NO
// ======================================================================

// Примечание
// В первом наборе входных данных одно из возможных решений — a = [1]. Единственный
// непустой подмассив имеет длину k = 1, и его сумма делится на m = 1.

// Во втором наборе входных данных одно из возможных решений — a = [9, 17, 14, 23, 11].
// Сумма элементов подмассива [9, 17, 14] равна 9 + 17 + 14 = 40, что делится на m = 5.
// Можно показать, что не существует непустого подмассива длины меньше k = 3, сумма
// элементов которого делится на 5, поэтому это решение корректно.

// В четвёртом наборе входных данных можно показать, что хорошего массива a не существует.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, k, m;
    cin >> n >> k >> m;
    vector<int> a(n, 1);

    if (m == 1)
    {
        if (k == 1)
        {
            cout << "YES\n";
            for (int i = 0; i < n; i++)
                cout << "1 ";
            cout << '\n';
        }
        else
        {
            cout << "NO\n";
        }
        return;
    }

    if (k > m)
    {
        cout << "NO\n";
        return;
    }

    a[k - 1] = m - k + 1;

    cout << "YES\n";
    for (auto &i : a)
        cout << i << ' ';
    cout << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
