// C. Инверсия подпоследовательности
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вам даны два массива a и b длины n, состоящие только из 0 и 1.

// Вы можете выполнить следующую операцию над массивом a любое количество раз:

// - Выбрать k индексов 1 ≤ i1 < i2 < … < ik ≤ n, где 1 ≤ k ≤ n
//   и ∑_{j=1}^{k} a_{i_j} нечётно. Другими словами, выбрать непустую
//   подпоследовательность* массива a с нечётной суммой.
// - Для каждого 1 ≤ j ≤ k присвоить a_{i_j} = 1 − a_{i_j}. Другими словами,
//   инвертировать все элементы выбранной подпоследовательности.

// Найдите минимальное количество операций, необходимое, чтобы превратить массив a
// в массив b, или определите, что это невозможно.

// * Последовательность c является подпоследовательностью d, если c может быть получена
// из d удалением нескольких (возможно, ни одного или всех) элементов на произвольных
// позициях.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 10^4) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// В первой строке каждого набора входных данных дано одно целое число n
// (1 ≤ n ≤ 2·10^5) — длина массивов a и b.

// Во второй строке каждого набора входных данных даны n целых чисел a1, a2, …, a_n
// (a_i ∈ {0, 1}) — массив a.

// В третьей строке каждого набора входных данных даны n целых чисел b1, b2, …, b_n
// (b_i ∈ {0, 1}) — массив b.

// Гарантируется, что сумма значений n по всем наборам входных данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — минимальное количество
// операций, необходимое, чтобы превратить массив a в массив b, или −1, если это
// невозможно.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 1
// 0
// 0
// 2
// 1 0
// 0 1
// 3
// 1 1 1
// 0 0 0
// 4
// 1 0 1 0
// 0 1 0 1
// 5
// 1 0 1 0 1
// 1 1 1 1 1
// ======================================================================
// Выходные данные
// ======================================================================
// 0
// 1
// 1
// 2
// -1
// ======================================================================

// Примечание
// В первом наборе входных данных a = b, поэтому не нужно выполнять операции,
// и ответ равен 0.

// Во втором наборе входных данных мы можем выполнить операцию с подпоследовательностью
// [a1, a2]. Сумма её элементов равна 1 + 0 = 1, то есть является нечётной. Эта операция
// изменяет a следующим образом: [1, 0] → [0, 1]. Полученный массив равен b, поэтому
// ответ равен 1.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;

    vector<int> a(n), b(n);
    int sumA = 0;

    for (int i = 0; i < n; i++)
    {
        cin >> a[i];
        sumA += a[i];
    }

    bool bAllOnes = true;
    for (int i = 0; i < n; i++)
    {
        cin >> b[i];
        if (b[i] == 0)
            bAllOnes = false;
    }

    if (a == b)
    {
        cout << 0 << '\n';
        return;
    }
    if (sumA == 0)
    {
        cout << -1 << '\n';
        return;
    }
    if (bAllOnes)
    {
        cout << -1 << '\n';
        return;
    }

    int needOne = 0;
    for (int i = 0; i < n; i++)
    {
        if (a[i] == 1 && b[i] == 0)
        {
            needOne ^= 1;
        }
    }

    if (needOne)
        cout << 1 << '\n';
    else
        cout << 2 << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
