// A. Неориентированный граф?
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Вам задано два числа n и m и список из m пар целых чисел (каждое число в паре
// от 1 до n). Проверьте, что заданный список пар является корректным набором рёбер
// некоторого неориентированного графа (в графе не должно быть петель и кратных рёбер).

// Входные данные
// В первой строке находится целое число t (1 ≤ t ≤ 10^5) — количество наборов
// входных данных в тесте. Далее следуют t наборов входных данных. Перед каждым
// набором входных данных записана пустая строка.

// В первой строке каждого набора тестовых данных записаны два целых числа n и m
// (1 ≤ n ≤ 10^5, 0 ≤ m ≤ 10^5) — ограничения на числа в парах и количество пар
// соответственно.

// В каждой из следующих m строк записана пара целых чисел u и v (1 ≤ u, v ≤ n).

// Суммы n и m по всем наборам тестовых данных не превосходят 10^5.

// Выходные данные
// Для каждого набора тестовых данных в отдельной строке выведите:

// - «YES» — если заданный список пар является корректным набором рёбер некоторого
//   неориентированного графа (полученный граф не имеет петель и кратных рёбер);
// - «NO» — в противном случае.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 3

// 3 3
// 1 2
// 1 3
// 3 2

// 2 2
// 1 2
// 2 2

// 2 2
// 1 2
// 2 1
// ======================================================================
// Выходные данные
// ======================================================================
// YES
// NO
// NO
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, m;
    cin >> n >> m;
    vector<set<int>> a(n);
    vector<pair<int, int>> vl(m);
    for (auto &i : vl)
        cin >> i.first >> i.second;

    for (int i = 0; i < m; i++)
    {
        int x = vl[i].first - 1, y = vl[i].second - 1;
        int mx = max(x, y), mn = min(x, y);
        if (a[mn].contains(mx) || mx == mn)
        {
            cout << "NO\n";
            return;
        }
        a[mn].insert(mx);
    }

    cout << "YES\n";
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
