// C. Тип последовательности вершин
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Вам заданы неориентированный граф и последовательность вершин. Граф задан списком
// его рёбер. Определите, является ли данная последовательность вершин:

// - простым циклом,
// - циклом,
// - простым путём,
// - путём
// или ничем из перечисленных.

// Если подходят несколько вариантов, выведите тот, который находится в списке раньше
// (то есть «simple cycle» > «cycle» > «simple path» > «path» > «none»).

// Входные данные
// В первой строке находится целое число t (1 ≤ t ≤ 10^5) — количество наборов
// входных данных в тесте. Далее следуют t наборов входных данных. Перед каждым
// набором входных данных записана пустая строка.

// В первой строке каждого набора содержатся три целых числа n, m и k
// (1 ≤ n ≤ 10^5, 0 ≤ m ≤ 10^5, 2 ≤ k ≤ 10^5), где n — количество вершин в графе,
// m — количество рёбер в графе, k — длина последовательности вершин.

// В следующей строке записана последовательность из k чисел a1, …, a_k (1 ≤ a_i ≤ n) —
// последовательность вершин.

// В следующих m строках записаны рёбра, по одному ребру в строке. Каждое ребро
// характеризуется двумя целыми числами u и v (1 ≤ u, v ≤ n), где u — начало ребра,
// а v — конец ребра.

// В графе отсутствуют петли и кратные рёбра.

// Суммы n, m и k по всем наборам входных данных в одном тесте не превосходят 10^5.

// Выходные данные
// Для каждого набора входных данных в отдельной строке выведите тип последовательности
// вершин:

// - «simple cycle» — если последовательность является простым циклом;
// - «cycle» — если последовательность является циклом;
// - «simple path» — если последовательность является простым путём;
// - «path» — если последовательность является путём;
// - «none» — в противном случае.

// Если подходят несколько вариантов, выведите тот, который находится в списке раньше.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5

// 4 4 5
// 3 2 1 3 2
// 1 2
// 1 3
// 2 3
// 3 4

// 4 4 5
// 1 2 3 2 1
// 1 2
// 2 3
// 1 3
// 3 4

// 5 6 5
// 2 1 4 3 5
// 1 2
// 2 3
// 1 3
// 1 4
// 3 4
// 3 5

// 4 5 5
// 2 1 4 3 2
// 1 2
// 1 3
// 1 4
// 2 3
// 3 4

// 6 6 4
// 1 3 2 4
// 1 3
// 3 5
// 1 5
// 2 4
// 2 6
// 4 6
// ======================================================================
// Выходные данные
// ======================================================================
// path
// cycle
// simple path
// simple cycle
// none
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

bool simple(vector<int> &a, int a_size, int start)
{
    set<int> st;
    for (int i = start; i < a_size; i++)
        st.insert(a[i]);
    return st.size() + start == a_size;
}

void solve()
{
    int n, m, k;
    cin >> n >> m >> k;
    vector<int> ak(k);
    for (auto &i : ak)
        cin >> i;
    vector<set<int>> g(n + 1);
    vector<pair<int, int>> ip(m);
    for (auto &i : ip)
    {
        cin >> i.first >> i.second;
        g[i.first].insert(i.second);
        g[i.second].insert(i.first);
    }

    for (int i = 0; i < k - 1; i++)
    {
        if (!g[ak[i]].contains(ak[i + 1]))
        {
            cout << "none\n";
            return;
        }
    }
    if (ak[0] == ak[k - 1])
    {
        if (simple(ak, k, 1))
        {
            cout << "simple cycle\n";
            return;
        }
        cout << "cycle\n";
        return;
    }
    if (simple(ak, k, 0))
    {
        cout << "simple path\n";
        return;
    }
    cout << "path\n";
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }

    return 0;
}