// D. Компоненты связности?
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вам заданы неориентированный граф списком его рёбер и множество вершин. Проверьте,
// что заданные вершины образуют в точности одну или более компонент связности
// заданного графа.

// Иными словами, необходимо проверить, можно ли выбрать подмножество компонент
// связности так, что заданные вершины являются всеми вершинами этого подмножества
// компонент (и только ими).

// Входные данные
// В первой строке находится целое число t (1 ≤ t ≤ 10^5) — количество наборов
// входных данных в тесте. Далее следуют t наборов входных данных. Перед каждым
// набором входных данных записана пустая строка.

// В первой строке каждого набора содержатся три целых числа n, m и k
// (1 ≤ n ≤ 10^5, 0 ≤ m ≤ 10^5, 1 ≤ k ≤ 10^5), где n — количество вершин в графе,
// m — количество рёбер в графе, k — количество вершин в множестве.

// В следующей строке находится k целых чисел a1, a2, …, a_k (1 ≤ a_i ≤ n) —
// заданное множество вершин.

// В следующих m строках записаны рёбра, по одному ребру в строке. Каждое ребро
// характеризуется двумя целыми числами u и v (1 ≤ u, v ≤ n), где u — начало ребра,
// а v — конец ребра.

// В графе отсутствуют петли и кратные рёбра.

// Суммы n, m и k по всем наборам входных данных в одном тесте не превосходят 10^5.

// Выходные данные
// Для каждого набора входных данных в отдельной строке выведите:

// - «YES» — заданные вершины образуют в точности одну или более компоненту связности
//   заданного графа;
// - «NO» — в противном случае.

// ======================================================================
// Примеры
// ======================================================================
// Пример 1
// Входные данные
// ======================================================================
// 2

// 4 3 3
// 1 2 3
// 1 2
// 2 3
// 1 3

// 4 2 3
// 1 2 3
// 1 2
// 3 4
// ======================================================================
// Выходные данные
// ======================================================================
// YES
// NO

// ======================================================================
// Пример 2
// Входные данные
// ======================================================================
// 5

// 3 0 3
// 2 3 1

// 5 1 5
// 2 3 5 1 4
// 2 3

// 1 0 1
// 1

// 5 0 3
// 5 1 4

// 2 1 2
// 2 1
// 2 1
// ======================================================================
// Выходные данные
// ======================================================================
// YES
// YES
// YES
// YES
// YES

// ======================================================================
// Пример 3
// Входные данные
// ======================================================================
// 5

// 1 0 1
// 1

// 2 1 2
// 1 2
// 2 1

// 4 1 4
// 4 2 3 1
// 1 4

// 2 1 1
// 1
// 1 2

// 5 5 4
// 5 4 1 3
// 5 4
// 5 1
// 1 3
// 3 2
// 1 4
// ======================================================================
// Выходные данные
// ======================================================================
// YES
// YES
// YES
// NO
// NO
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, m, k;
    cin >> n >> m >> k;
    set<int> a;
    for (int i = 0; i < k; i++)
    {
        int x;
        cin >> x;
        a.insert(x);
    }
    bool ok = true;
    for (int i = 0; i < m; i++)
    {
        int u, v;
        cin >> u >> v;
        bool au = a.contains(u), av = a.contains(v);
        if ((!au && av) || (au && !av))
            ok = false;
    }
    if (!ok)
        cout << "NO\n";
    else
        cout << "YES\n";
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
