// E. Степени дерева
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Вам задан массив d, состоящий из n элементов. Проверьте, существует ли дерево,
// у которого массив степеней совпадает с массивом d.

// Массив степеней — такой массив d, где для каждой вершины u значение d_u равно
// степени вершины u.

// Входные данные
// В первой строке находится целое число t (1 ≤ t ≤ 10^5) — количество наборов
// входных данных в тесте. Далее следуют t наборов входных данных. Перед каждым
// набором входных данных записана пустая строка.

// В первой строке каждого набора находится одно целое число n (1 ≤ n ≤ 10^5) —
// количество элементов в массиве d.

// В следующей строке записаны n чисел d1, d2, …, d_n (0 ≤ d_i ≤ 10^9) — массив d.

// Сумма n по всем наборам входных данных в одном тесте не превосходит 10^5.

// Выходные данные
// Для каждого набора входных данных в отдельной строке выведите:

// - «YES» — если существует дерево, у которого массив степеней совпадает с массивом d;
// - «NO» — в противном случае.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 3

// 7
// 2 1 3 1 1 1 3

// 2
// 2 2

// 1
// 0
// ======================================================================
// Выходные данные
// ======================================================================
// YES
// NO
// YES
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, s = 0;
    cin >> n;
    bool ok = true;
    set<int> a;
    for (int i = 0; i < n; i++)
    {
        int x;
        cin >> x;
        if (x >= n)
            ok = false;
        a.insert(x);
        s += x;
    }
    if (ok && s == 2 * (n - 1) && !(n > 1 && a.contains(0)))

        cout
            << "YES\n";
    else
        cout << "NO\n";
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
