// F. Граф по массиву степеней
// ограничение по времени на тест3 секунды
// ограничение по памяти на тест256 мегабайт

// Вам дан массив степеней некоторого неориентированного графа. Постройте по заданному
// массиву любой неориентированный граф.

// В графе не могут быть петли или кратные рёбра.

// Вершины графа нумеруются с 1.

// Входные данные
// В первой строке находится целое число t (1 ≤ t ≤ 1000) — количество наборов
// входных данных в тесте. Далее следуют t наборов входных данных. Перед каждым
// набором входных данных записана пустая строка.

// В первой строке каждого набора содержится одно целое число n (1 ≤ n ≤ 1000) —
// размер массива степеней.

// В следующей строке записан массив из n чисел a1, a2, …, a_n (0 ≤ a_i ≤ n − 1) —
// степени вершин.

// Сумма n по всем наборам входных данных в одном тесте не превосходит 1000.
// Гарантируется, что по заданному массиву степеней можно построить граф.

// Выходные данные
// Для каждого набора входных данных выведите в отдельной строке количество рёбер
// в графе и сам граф в виде множества рёбер.

// Каждое ребро должно быть выведено в отдельной строке, как пара из двух чисел,
// записанных через пробел — номера вершин на концах ребра. В построенном графе
// массив степеней должен поэлементно совпадать с заданным массивом степеней.

// Если существует несколько решений, выведите любое.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6

// 3
// 2 2 2

// 4
// 3 2 3 2

// 3
// 1 2 1

// 3
// 0 1 1

// 4
// 2 2 2 0

// 1
// 0
// ======================================================================
// Выходные данные
// ======================================================================
// 3
// 3 2
// 3 1
// 2 1
// 5
// 3 1
// 3 4
// 3 2
// 1 4
// 1 2
// 2
// 2 3
// 2 1
// 1
// 3 2
// 3
// 3 2
// 3 1
// 2 1
// 0
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, s = 0;
    cin >> n;
    vector<pair<int, int>> a(n);
    for (int i = 0; i < n; i++)
    {
        cin >> a[i].first;   // value
        a[i].second = i + 1; // index
        s += a[i].first;
    }

    int m = s / 2;
    cout << m << '\n';
    for (int i = 0; i < n; i++)
    {
        int mx_vl_inx = 0;
        for (int k = 0; k < n; k++)
            if (a[k] > a[mx_vl_inx])
                mx_vl_inx = k;
        if (a[mx_vl_inx].first == 0)
            break;

        pair<int, int> d = a[mx_vl_inx];
        a[mx_vl_inx].first = 0;

        sort(a.rbegin(), a.rend());

        for (int j = 0; j < d.first; j++)
        {
            a[j].first--;
            cout << d.second << ' ' << a[j].second << '\n';
        }
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
