// G. Граф по множеству степеней
// ограничение по времени на тест5 секунд
// ограничение по памяти на тест256 мегабайт

// Вам дано множество степеней некоторого неориентированного графа. Постройте по
// заданному множеству неориентированный граф с минимальным количеством вершин.

// В графе не могут быть петли или кратные рёбра.

// Вершины графа нумеруются с единицы.

// Входные данные
// В первой строке находится целое число t (1 ≤ t ≤ 100) — количество наборов
// входных данных в тесте. Далее следуют t наборов входных данных. Перед каждым
// набором входных данных записана пустая строка.

// В первой строке каждого набора содержится одно целое число n (1 ≤ n ≤ 100) —
// размер множества степеней.

// В следующей строке записано множество из n различных чисел a1, a2, …, a_n
// (1 ≤ a_i ≤ 100) — степени вершин.

// Гарантируется, что по заданному множеству степеней можно построить граф.

// Выходные данные
// Для каждого набора входных данных выведите в отдельной строке количество вершин
// и количество рёбер в графе и сам граф в виде множества рёбер.

// Каждое ребро должно быть выведено в отдельной строке, как пара из двух чисел,
// записанных через пробел — номера вершин на концах ребра. В построенном графе
// множество степеней должно совпадать с заданным множеством степеней.

// Если существует несколько решений, выведите любое.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5

// 1
// 2

// 2
// 3 2

// 2
// 1 2

// 3
// 2 1 3

// 1
// 1
// ======================================================================
// Выходные данные
// ======================================================================
// 3 3
// 3 2
// 3 1
// 2 1
// 4 5
// 2 1
// 2 4
// 2 3
// 1 4
// 1 3
// 3 2
// 1 3
// 1 2
// 4 4
// 1 3
// 1 2
// 1 4
// 3 2
// 2 1
// 2 1
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, mx = 0;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
    {
        cin >> i;
        mx = max(mx, i);
    }

    sort(a.begin(), a.end());

    int mxpw = mx + 1;
    string s = "";
    int l = 0, r = a.size() - 1, offset = 0;
    while (l <= r)
    {
        int dcnt, icnt;
        if (l < r)
        {
            dcnt = a[l] - offset;
            icnt = a[r] - a[r - 1];
        }
        else
        {
            dcnt = a[l] - offset;
            icnt = 1;
        }
        string tmp = "";
        for (int j = 0; j < icnt; j++)
            tmp.push_back('I');
        for (int j = 0; j < dcnt; j++)
            tmp.push_back('D');

        s = tmp + s;
        offset = a[l];
        l++;
        r--;
    }
    while (s.length() < mxpw)
        s = 'I' + s;

    list<pair<int, int>> res;
    for (int i = 0; i < mxpw; i++)
    {
        if (s[i] == 'D')
        {
            for (int j = 0; j < i; j++)
            {
                res.push_back({i + 1, j + 1});
            }
        }
    }
    cout << mxpw << ' ' << res.size() << '\n';
    for (auto i : res)
        cout << i.first << ' ' << i.second << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}

// 3 2

// 1 2 3 4
// 3 2 3 3

// 1 2
// 1 3
// 1 4

// 1 2 3 4
// 0 1 2 2

// 4 3 2 1
// 2 2 1 0

// 4 3
// 4 2

// 4 3 2 1
// 0 1 0 0
