// Неориентированные графы — основные определения
// ограничение по времени на тест - (теоретический материал)
// ограничение по памяти на тест - (теоретический материал)

// Посмотрим на два рисунка. Это изображения двух неориентированных простых графов
// (ниже просто графов).

// Это диаграммы специального вида, которые состоят из объектов двух видов:

// - из кружочков (далее «вершин»);
// - отрезков или линий, которые соединяют пары вершин (далее «рёбра») — рёбра
//   неориентированы, соединяют 2 различные вершины, между парой вершин не более 1 ребра.

// Иными словами, ребро — это неупорядоченная пара двух вершин или подмножество
// вершин мощности ровно 2.

// Таким образом:

// - граф на 1-м рисунке содержит 5 вершин, пронумерованных от 1 до 5, и 4 ребра;
// - граф на 2-м рисунке содержит 4 вершины, пронумерованных от a до d, и 4 ребра —
//   вершины соединены по циклу.

// Вообще, графы — это инструмент для формализации систем реального мира, чтобы для них
// можно было применять математический аппарат дискретной математики (теории графов).
// То есть сложная система рассматривается лишь как множество некоторых объектов
// (вершин) и взаимосвязей между ними (рёбер).

// ======================================================================
// Определения
// ======================================================================

// Опр. 1. Неориентированным графом называется упорядоченная пара двух множеств
// G = (V, E), где 0 < |V| < ∞, а E — подмножество всевозможных неупорядоченных пар
// различных двух вершин из V.

// Таким образом, в формальном виде:

// - для графа на 1-м рисунке: V = {1, 2, 3, 4, 5}, E = {(1, 3), (2, 1), (3, 2), (2, 4)};
// - для графа на 2-м рисунке: V = {a, b, c, d}, E = {(a, b), (c, b), (c, d), (d, a)}.

// Ребро вида (u, v) можно записывать и как (v, u), так как ребро неориентированно
// (и соответствующая пара неупорядочена).

// Обратите внимание, что рисунки — это лишь изображения (портреты) графов. Сами же
// графы — это формальные понятия, выраженные на языке теории множеств выше.

// Опр. 2. Две вершины u и v смежны тогда и только тогда, когда (u, v) ∈ E.

// Например, в 1-м графе вершины 1 и 3 — смежны, а вершины 1 и 5 — нет. Говорить
// о смежности вершины и ребра неправильно, для этого есть термин инцидентность.

// Опр. 3. Вершина u и ребро (a, b) инцидентны тогда и только тогда, когда u = a
// или u = b.

// То есть вершина и ребро инцидентны, если вершина является одним из концов этого ребра.

// Опр. 4. Степень вершины u (обозначается как d(u) или deg(u)) — это число рёбер,
// инцидентных u:

// d(u) = |{(u, v) | (u, v) ∈ E}|.

// Например, для 1-го графа степени вершин: d(1) = 2, d(2) = 3, d(3) = 2, d(4) = 1,
// d(5) = 0. Вершина 5 называется изолированной.

// У 2-го графа все степени равны 2 — такие графы называются регулярными.

// Найдём сумму степеней вершин графа. Очевидно, что так мы посчитаем все рёбра
// и каждое ровно два раза (с каждого из двух концов). Следовательно,

// ∑_{u ∈ V} d(u) = 2m,

// где m — количество рёбер графа. Этот факт называется леммой о рукопожатиях.

// Следствие из этой леммы: в любом графе количество вершин нечётной степени — чётно.
// Часто вершины нечётной степени называются просто нечётными вершинами.

// Для доказательства этого факта достаточно в лемме о рукопожатиях рассмотреть обе
// части равенства по модулю 2 (то есть в виде остатков при делении на 2). Тогда слева
// все нечётные вершины примут вид 1 (остаток равен 1), чётные вершины примут вид 0
// (и не будут вносить вклад в равенство), а сумма справа равна 0 по модулю 2.
// Следовательно, количество единиц слева — чётно.

// Ещё один небольшой факт о степенях вершин: в произвольном графе обязательно
// найдутся две вершины одинаковой степени.

// В самом деле, допустим все степени различны. Тогда отсортированная последовательность
// степеней вершин имеет вид [0, 1, …, n − 1]. Заметим, что в графе не могут
// существовать одновременно изолированная вершина (степени 0) и вершина, которая
// смежна всем остальным вершинам (степени n − 1).

// ======================================================================
// Пути, циклы, связность
// ======================================================================

// Опр. 5. Путь — это последовательность вершин p = (u0, u1, …, u_k), где для всех i
// (0 ≤ i < k) верно (u_i, u_{i+1}) ∈ E.

// Например, для 1-го графа следующие последовательности вершин — пути:
// () (пустой путь, не всегда считается путём), любая последовательность из одной
// вершины (например, (4)) или (2, 1, 3, 2, 4).

// Длина пути — количество рёбер, входящих в путь (на 1 меньше количества вершин в пути).

// Опр. 6. Простой путь — это путь, в котором все вершины различны.

// Например, для 1-го графа путь (1, 3, 2, 4) — простой.

// Опр. 7. Цикл — такой путь, длина которого не менее 1 и который начинается
// и заканчивается в одной и той же вершине (то есть u0 = u_k).

// Например, для 1-го графа (1, 3, 1, 3, 1, 3, 1) — цикл.

// Опр. 8. Простой цикл — это цикл, в котором все вершины различны (кроме u0 = u_k).

// Например, для 1-го графа (1, 3, 1, 3, 1, 3, 1) простым циклом не является. Однако
// цикл (1, 3, 2, 1) — простой.

// Опр. 9. Вершина v достижима из вершины u тогда и только тогда, когда существует
// путь из u в v.

// Опр. 10. Компонента связности — максимальный по включению связный подграф графа.

// Опр. 11. Связный граф — такой, что из любой вершины достижима любая другая.

// Например, в 1-м графе всего две компоненты связности, а во 2-м — одна.

// ======================================================================
// Деревья и лес
// ======================================================================

// Опр. 12. Дерево — связный ациклический (то есть без простых циклов) граф.

// Ниже приведены изображения нескольких деревьев (в оригинале — рисунки). Здесь
// изображены три дерева. У левого дерева 1 вершина, у среднего — 4 вершины,
// у правого — 7 вершин.

// Хорошо видно, что количество вершин n у произвольного дерева равно m + 1, где m —
// количество рёбер. Этот факт несложно показать с помощью математической индукции.

// Более того, верна следующая теорема.

// Теорема 1. Пусть G — неориентированный граф, тогда из любой пары трёх утверждений
// следует третье (и истинность любой пары фактов — критерий того, что G является деревом):

// - n = m + 1 (n — количество вершин, m — количество рёбер);
// - G — связный граф;
// - G — ациклический (не содержит простых циклов).

// Таким образом, если необходимо проверить заданный граф на то, является ли он деревом,
// то вы сами можете выбрать любые два требования из трёх для проверки. Обычно проще
// всего проверить первые два требования.

// Вершины, степени которых не превосходят 1, называются листьями. В каждом дереве
// найдётся не менее одного листа (а если в дереве n > 1, то не менее двух листьев).
// Это можно легко показать от противного, подставив допущение в лемму о рукопожатиях.

// Для дерева ∑_{u ∈ V} d(u) = 2n − 2.

// Опр. 13. Лес — это такой граф, каждая компонента связности которого является деревом.
// Количество компонент связности леса равно n − m.