// C. Калькулятор дедушки Довлета
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Однажды в сундуке своего дедушки Довлета Макс нашёл электронный калькулятор.
// Цифры на нём отображались с помощью семисегментных индикаторов
// (https://ru.wikipedia.org/wiki/Семисегментный_индикатор).

// Макс стал по очереди набирать на калькуляторе все числа от a до b. После набора
// каждого числа Макс нажимал кнопку сброса. Определите общее количество сегментов,
// отображённых на калькуляторе.

// Например, если a = 1 и b = 3, то на калькуляторе сначала отобразится 2 сегмента,
// затем — 5 и снова отобразится 5 сегментов. Таким образом, общее количество
// отображённых сегментов будет равно 12.

// Входные данные
// В единственной строке находится пара целых чисел a, b (1 ≤ a ≤ b ≤ 10^6) —
// первое и последнее число, набранное Максом.

// Выходные данные
// Выведите одно целое число — общее количество отображённых сегментов.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 1 3
// ======================================================================
// Выходные данные
// ======================================================================
// 12

// ======================================================================
// Входные данные
// ======================================================================
// 10 15
// ======================================================================
// Выходные данные
// ======================================================================
// 39
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int data[10]{6, 2, 5, 5, 4, 5, 6, 3, 7, 6};
    int a, b, res = 0;
    cin >> a >> b;
    for (int i = a; i < b + 1; i++)
    {
        res += data[i % 10];
        int t = i / 10;
        while (t > 0)
        {
            res += data[t % 10];
            t /= 10;
        }
    }
    cout << res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
