// A. Обход в ширину
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Дан неориентированный граф. В нём необходимо найти кратчайшее расстояние от одной
// заданной вершины до другой.

// Входные данные
// В первой строке задано четыре числа N, E, S, F.

// - N (1 ≤ N ≤ 100) — количество вершин в графе,
// - E (0 ≤ E ≤ N·(N−1)/2) — количество рёбер в графе,
// - S (1 ≤ S ≤ N) — начальная вершина,
// - F (1 ≤ F ≤ N) — конечная вершина.

// Далее E строк задают рёбра графа, строка вида u v соответствует ребру между
// вершинами u и v.

// Выходные данные
// Выведите единственное число — длину кратчайшего пути в рёбрах от вершины S
// до вершины F. Если пути не существует, выведите 0.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4 4 4 3
// 1 2
// 1 3
// 1 4
// 2 3
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, e, s, f;
    cin >> n >> e >> s >> f;
    s--;
    f--;
    vector<vector<int>> graph(n);
    for (int i = 0; i < e; i++)
    {
        int v, u;
        cin >> v >> u;
        v--;
        u--;
        graph[v].push_back(u);
        graph[u].push_back(v);
    }
    vector<int> dist(n, -1);
    queue<int> q;

    dist[s] = 0;
    q.push(s);
    while (!q.empty())
    {
        int cur = q.front();
        q.pop();

        for (auto &v : graph[cur])
        {
            if (dist[v] == -1)
            {
                dist[v] = dist[cur] + 1;
                if (v == f)
                {
                    cout << dist[f] << '\n';
                    return;
                }
                q.push(v);
            }
        }
    }
    cout << "0\n";
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
