// B. Предок
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Напишите программу, которая для двух вершин дерева определяет, является ли одна из них
// предком другой.

// Входные данные
// Первая строка содержит натуральное число n (1 ≤ n ≤ 10^5) – количество вершин в дереве.
// Во второй строке содержится n чисел, i-е из которых определяет номер непосредственного
// родителя вершины с номером i. Если это число равно нулю, то вершина является корнем
// дерева.

// В третьей строке находится число m (1 ≤ m ≤ 10^5) – количество запросов.
// Каждая из следующих m строк содержит два различных числа a и b (1 ≤ a, b ≤ n).

// Выходные данные
// Для каждого из m запросов выведите на отдельной строке число 1, если вершина a
// является одним из предков вершины b, и 0 в противном случае.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 0 1 1 2 3 3
// 5
// 4 1
// 1 4
// 3 6
// 2 6
// 6 5
// ======================================================================
// Выходные данные
// ======================================================================
// 0
// 1
// 1
// 0
// 0
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

vector<vector<int>> graph;
vector<int> timein, timeout;
int tim = 1;

void dfs(int v)
{
    timein[v] = tim++;
    for (auto &u : graph[v])
        dfs(u);
    timeout[v] = tim++;
}

void solve()
{
    int n;
    cin >> n;
    graph.resize(n + 1);
    timein.resize(n + 1);
    timeout.resize(n + 1);

    int k = 0;
    for (int i = 1; i <= n; i++)
    {
        int j;
        cin >> j;
        if (j != 0)
            graph[j].push_back(i);
        else
            k = i;
    }
    dfs(k);
    int q;
    cin >> q;
    while (q--)
    {
        int a, b;
        cin >> a >> b;
        cout << (timein[a] < timein[b] && timeout[b] < timeout[a] ? "1\n" : "0\n");
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
