// C. Ацикличность неориентированного графа
// ограничение по времени на тест1.5 секунд
// ограничение по памяти на тест256 мегабайт

// Дан неориентированный граф, не содержащий петель и кратных рёбер. Определите,
// существует ли в таком графе хотя бы один цикл.

// Входные данные
// В первой строке заданы числа n и m (1 ≤ n ≤ 10^3, 0 ≤ m ≤ n·(n−1)/2) —
// количество вершин и количество рёбер в графе.

// Далее m строк вида u v (1 ≤ u, v ≤ n), где u и v соответствуют вершинам,
// связанным рёбрами. Гарантируется, что для каждой пары вершин графа будет задано
// не более одной такой пары.

// Выходные данные
// Если в графе существует цикл, выведите "YES" (без кавычек), иначе – "NO".

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 3 3
// 1 2
// 1 3
// 3 2
// ======================================================================
// Выходные данные
// ======================================================================
// YES

// ======================================================================
// Входные данные
// ======================================================================
// 4 3
// 1 2
// 2 3
// 3 4
// ======================================================================
// Выходные данные
// ======================================================================
// NO
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

bool dfs(vector<vector<int>> &graph, vector<bool> &visited, int v, int parent)
{
    visited[v] = 1;
    for (auto &u : graph[v])
    {
        if (!visited[u])
        {
            if (dfs(graph, visited, u, v))
                return 1;
        }
        else if (u != parent)
            return 1;
    }
    return 0;
}

void solve()
{
    int n, m;
    cin >> n >> m;
    vector<vector<int>> graph(n);
    vector<bool> visited(n, 0);
    while (m--)
    {
        int u, v;
        cin >> u >> v;
        u--;
        v--;
        graph[u].push_back(v);
        graph[v].push_back(u);
    }

    bool ok = false;
    for (int i = 0; i < n; i++)
    {
        if (!visited[i] && dfs(graph, visited, i, -1))
        {
            ok = 1;
            break;
        }
    }
    cout << (ok ? "YES\n" : "NO\n");
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
