// D. Распространение новостей
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// В некоторой социальной сети зарегистрированы n пользователей. Они общаются между собой
// в m группах. Давайте рассмотрим процесс распространения новостей между пользователями.

// Изначально какой-нибудь пользователь x узнаёт новость из какого-то внешнего источника.
// Затем этот пользователь отправляет новость всем своим друзьям (два пользователя
// считаются друзьями, если они оба принадлежат к какой-нибудь группе). Друзья продолжают
// отправлять новость своим друзьям, и так далее. Процесс заканчивается, когда не останется
// ни одной пары друзей, в которой один пользователь знает новость, а другой — нет.

// Для каждого пользователя x определите, сколько пользователей в конечном итоге узнает
// новость, если x начнёт её распространять.

// Входные данные
// В первой строке записаны два целых числа n и m (1 ≤ n, m ≤ 5·10^5) — количество
// пользователей и групп соответственно.

// Затем следуют m строк, каждая из которых описывает группу. i-я строка начинается
// целым числом k_i (0 ≤ k_i ≤ n) — количество пользователей в i-й группе. Затем следуют
// k_i различных чисел, обозначающих пользователей, принадлежащих к i-й группе.

// Гарантируется, что ∑_{i=1}^{m} k_i ≤ 5·10^5.

// Выходные данные
// Выведите n целых чисел. i-е из них должно быть равно количеству пользователей, которые
// узнают новость, если пользователь i начнёт её распространять.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 7 5
// 3 2 5 4
// 0
// 2 1 2
// 1 1
// 2 6 7
// ======================================================================
// Выходные данные
// ======================================================================
// 4 4 1 4 4 2 2
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, m;
    cin >> n >> m;
    vector<vector<int>> graph(n + m);
    for (int i = 0; i < m; i++)
    {
        int k;
        cin >> k;

        for (int j = 0; j < k; j++)
        {
            int x;
            cin >> x;
            x--;

            graph[x].push_back(n + i);
            graph[n + i].push_back(x);
        }
    }

    vector<int> vis(n + m, false);
    vector<int> result(n, 1);

    for (int i = 0; i < n; i++)
    {
        if (!vis[i])
        {
            vector<int> comp;
            queue<int> q;

            q.push(i);
            vis[i] = 1;

            int count = 0;
            while (!q.empty())
            {
                int cur = q.front();
                q.pop();

                if (cur < n)
                {
                    count++;
                    comp.push_back(cur);
                }

                for (int neighbor : graph[cur])
                {
                    if (!vis[neighbor])
                    {
                        vis[neighbor] = true;
                        q.push(neighbor);
                    }
                }
            }
            for (auto &c : comp)
                result[c] = count;
        }
    }

    for (auto &i : result)
        cout << i << ' ';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
