// E. Компоненты-циклы
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вам задан неориентированный граф, состоящий из n вершин и m рёбер. Ваша задача —
// найти количество компонент связности, которые являются циклами.

// Вот несколько определений из теории графов.

// Неориентированный граф состоит из двух множеств: множества узлов (называемых
// вершинами) и множества рёбер. Каждое ребро соединяет пару вершин. Все рёбра
// двунаправленные (то есть если вершина a соединена с вершиной b, вершина b тоже
// соединена с вершиной a). Ребро не может соединять вершину саму с собой, также
// не может существовать более одного ребра между парой вершин.

// Две вершины u и v принадлежат одной компоненте связности тогда и только тогда,
// когда существует хотя бы один путь по рёбрам, соединяющий u и v.

// Компонента связности является циклом тогда и только тогда, когда все её вершины
// могут быть переупорядочены следующим образом:

// - первая вершина соединена ребром со второй вершиной,
// - вторая вершина соединена ребром с третьей вершиной,
// - ...
// - последняя вершина соединена ребром с первой вершиной,
// - все описанные выше рёбра цикла — различны.

// Цикл содержит только вершины и рёбра, описанные выше. По определению цикл содержит
// не менее трёх вершин.

// Граф на рисунке содержит 6 компонент связности, 2 из них являются циклами:
// [7, 10, 16] и [5, 11, 9, 15].

// Входные данные
// В первой строке входных данных задано два целых числа n и m (1 ≤ n ≤ 2·10^5,
// 0 ≤ m ≤ 2·10^5) — количество вершин и рёбер в графе.

// В следующих m строках заданы рёбра: i-е ребро задаётся парой вершин v_i, u_i
// (1 ≤ v_i, u_i ≤ n, u_i ≠ v_i). Гарантируется, что граф не содержит кратных рёбер
// (то есть для любой пары (v_i, u_i) не существует других пар (v_i, u_i) и (u_i, v_i)
// среди заданных рёбер).

// Выходные данные
// Выведите одно целое число — количество компонент связности, которые являются циклами.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5 4
// 1 2
// 3 4
// 5 4
// 3 5
// ======================================================================
// Выходные данные
// ======================================================================
// 1

// ======================================================================
// Входные данные
// ======================================================================
// 17 15
// 1 8
// 1 12
// 5 11
// 11 9
// 9 15
// 15 5
// 4 13
// 3 13
// 4 3
// 10 16
// 7 10
// 16 7
// 14 3
// 14 4
// 17 6
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// ======================================================================

// Примечание
// В первом тестовом примере только компонента [3, 4, 5] является циклом.

// Второй пример соответствует рисунку из условия.

#include <bits/stdc++.h>
using namespace std;

#define int long long

bool DFS(vector<vector<int>> &graph, vector<bool> &visited, int v)
{
    bool res = 1;
    visited[v] = 1;
    if (graph[v].size() != 2)
        res = 0;
    for (auto &u : graph[v])
        if (!visited[u])
        {
            bool t = DFS(graph, visited, u);
            res = res && t;
        }
    return res;
}

void solve()
{
    int n, m;
    cin >> n >> m;
    vector<vector<int>> graph(n);
    for (int i = 0; i < m; i++)
    {
        int u, v;
        cin >> u >> v;
        u--;
        v--;
        graph[u].push_back(v);
        graph[v].push_back(u);
    }
    int res = 0;
    vector<bool> visited(n, 0);
    for (int i = 0; i < n; i++)
    {
        if (!visited[i] && DFS(graph, visited, i))
            res++;
    }
    cout << res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
