// F. Новая реформа
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// В Берляндии есть n городов, соединённых m двусторонними дорогами. Дороги не могут
// соединять город с самим собой, и каждая пара городов соединяется не более чем
// одной дорогой. Не гарантируется, что из любого города можно доехать до любого
// другого, используя только имеющиеся дороги.

// Президент Берляндии решил внести изменения в систему дорожных путей и дал указание
// министерству транспорта заняться данной реформой. Теперь каждая дорога должна стать
// односторонней (вести только из одного города в другой).

// Чтобы не вызвать большого недовольства у жителей, необходимо провести реформу так,
// чтобы оставалось как можно меньше обособленных городов. Город считается обособленным,
// если в него не входит ни одна дорога, при этом выходящие из этого города дороги
// допустимы.

// Помогите министерству транспорта найти минимальное количество обособленных городов
// после проведения реформы.

// Входные данные
// В первой строке входных данных следуют два целых положительных числа n и m —
// количество городов и дорог в Берляндии (2 ≤ n ≤ 100 000, 1 ≤ m ≤ 100 000).

// В следующих m строках содержатся описания дорог: i-я дорога задаётся двумя
// различными целыми числами x_i, y_i (1 ≤ x_i, y_i ≤ n, x_i ≠ y_i), где x_i и y_i
// равны номерам городов, которые соединяет i-я дорога.

// Гарантируется, что между каждой парой городов не может быть более одной дороги,
// но не гарантируется, что из любого города можно доехать до любого другого,
// используя только дороги.

// Выходные данные
// Выведите единственное число — минимальное количество обособленных городов после
// проведения реформы.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 4 3
// 2 1
// 1 3
// 4 3
// ======================================================================
// Выходные данные
// ======================================================================
// 1

// ======================================================================
// Входные данные
// ======================================================================
// 5 5
// 2 1
// 1 3
// 2 3
// 2 5
// 4 3
// ======================================================================
// Выходные данные
// ======================================================================
// 0

// ======================================================================
// Входные данные
// ======================================================================
// 6 5
// 1 2
// 2 3
// 4 5
// 4 6
// 5 6
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// ======================================================================

// Примечание
// В первом примере допустима следующая ориентация дорог: 1 → 2, 1 → 3, 4 → 3.

// Во втором примере: 1 → 2, 1 → 3, 2 → 3, 2 → 5, 3 → 4.

// В третьем примере: 1 → 2, 2 → 3, 4 → 5, 4 → 6, 5 → 6.

#include <bits/stdc++.h>
using namespace std;

#define int long long

bool bdsm(vector<bool> &visited, vector<vector<int>> &a, int start)
{
    bool result = 1;
    queue<pair<int, int>> q; // v, parent
    q.push({start, -1});
    visited[start] = 1;

    while (!q.empty())
    {
        pair<int, int> cur = q.front();
        q.pop();

        for (auto &u : a[cur.first])
        {
            if (!visited[u])
            {
                visited[u] = 1;
                q.push({u, cur.first});
            }
            else if (u != cur.second)
                result = 0;
        }
    }
    return result;
}

void solve()
{
    int v, e;
    cin >> v >> e;
    vector<vector<int>> a(v);
    for (int i = 0; i < e; i++)
    {
        int x, y;
        cin >> x >> y;
        x--;
        y--;
        a[x].push_back(y);
        a[y].push_back(x);
    }
    vector<bool> visited(v, 0);
    int res = 0;
    for (int i = 0; i < v; i++)
        if (!visited[i])
            res += bdsm(visited, a, i);
    cout << res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
