// G. Построение дорог
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// В Мемляндии есть n городов и m двусторонних дорог между ними. Необходимо достроить
// некоторые дороги так, что от любого города можно будет добраться до любого другого.

// Ваша задача — найти минимальное количество дорог для выполнения условия, а также
// определить, какие именно дороги необходимо достроить.

// Входные данные
// Первая строка содержит два целых числа n (1 ≤ n ≤ 10^5) и m (0 ≤ m ≤ 2·10^5) —
// количество городов и дорог. Города пронумерованы от 1 до n.

// Следующие m строк задают дороги. Каждая строка содержит два целых числа a и b
// (1 ≤ a, b ≤ n), это означает, что между городами a и b существует дорога.

// Гарантируется, что все дороги соединяют различные города (a ≠ b). Также гарантируется,
// что между каждой парой городов может быть не более одной дороги.

// Выходные данные
// В первой строке выведите одно целое число k — количество необходимых новых дорог.

// После выведите k строк, описывающих эти дороги в том же формате, что и во входных
// данных. Если существует несколько решений, выведите любое.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4 2
// 1 2
// 3 4
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 1 3
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int v, e;
    cin >> v >> e;
    vector<vector<int>> gr(v);
    for (int i = 0; i < e; i++)
    {
        int x, y;
        cin >> x >> y;
        x--;
        y--;
        gr[x].push_back(y);
        gr[y].push_back(x);
    }

    vector<bool> visited(v, 0);
    vector<int> res;
    queue<int> q;
    for (int i = 0; i < v; i++)
    {
        if (!visited[i])
        {
            q.push(i);
            visited[i] = 1;
            res.push_back(i);
            while (!q.empty())
            {
                int cur = q.front();
                q.pop();

                for (auto &u : gr[cur])
                    if (!visited[u])
                    {
                        visited[u] = 1;
                        q.push(u);
                    }
            }
        }
    }
    cout << res.size() - 1 << '\n';
    for (int i = 0; i < res.size() - 1; i++)
        cout << res[i] + 1 << ' ' << res[i + 1] + 1 << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
