// H. Ближайшая противоположная четность
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вам задан массив a, состоящий из n целых чисел. За один ход вы можете прыгнуть
// с позиции i в позицию i − a_i (если 1 ≤ i − a_i) или в позицию i + a_i
// (если i + a_i ≤ n).

// Для каждой позиции i от 1 до n вы хотите узнать минимальное количество ходов,
// необходимое, чтобы достичь любой позиции j такой, что a_j имеет четность,
// отличающуюся от чётности a_i (то есть если a_i нечётно, то a_j должно быть чётным,
// и наоборот).

// Входные данные
// Первая строка входных данных содержит одно целое число n (1 ≤ n ≤ 2·10^5) —
// количество элементов в a.

// Вторая строка входных данных содержит n целых чисел a1, a2, …, a_n (1 ≤ a_i ≤ n),
// где a_i равно i-му элементу a.

// Выходные данные
// Выведите n целых чисел d1, d2, …, d_n, где d_i равно минимальному количеству ходов,
// необходимому, чтобы достичь любой позиции j такой, что a_j имеет чётность,
// отличающуюся от чётности a_i (то есть если a_i нечётно, то a_j должно быть чётным,
// и наоборот), или -1, если такой позиции достичь невозможно.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 10
// 4 5 7 6 7 5 4 4 6 4
// ======================================================================
// Выходные данные
// ======================================================================
// 1 1 1 2 -1 1 1 3 1 1
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n), result(n, -1);
    queue<int> q;
    vector<vector<int>> gra(n);
    vector<int> dist(n, -1);
    for (int i = 0; i < n; i++)
    {
        cin >> a[i];
        if (i + a[i] < n)
            gra[i + a[i]].push_back(i);
        if (i - a[i] >= 0)
            gra[i - a[i]].push_back(i);
        if (a[i] % 2 != 0)
        {
            q.push(i);
            dist[i] = 0;
        }
    }

    while (!q.empty())
    {
        int cur = q.front();
        q.pop();

        for (auto &u : gra[cur])
        {
            if (dist[u] == -1)
            {
                dist[u] = dist[cur] + 1;
                q.push(u);
            }
        }
    }

    for (int i = 0; i < n; i++)
    {
        if (a[i] % 2 == 0 && dist[i] != -1)
            result[i] = dist[i];
    }
    dist.assign(n, -1);
    for (int i = 0; i < n; i++)
    {
        if (a[i] % 2 == 0)
        {
            q.push(i);
            dist[i] = 0;
        }
    }

    while (!q.empty())
    {
        int cur = q.front();
        q.pop();

        for (auto &u : gra[cur])
        {
            if (dist[u] == -1)
            {
                dist[u] = dist[cur] + 1;
                q.push(u);
            }
        }
    }
    for (int i = 0; i < n; i++)
    {
        if (a[i] % 2 != 0 && dist[i] != -1)
            result[i] = dist[i];
    }
    for (auto &i : result)
        cout << i << ' ';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
