// J. Лабиринт
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест512 мегабайт

// В одном из уровней компьютерной игры вы попали в лабиринт, состоящий из n строк,
// каждая из которых содержит m клеток. Каждая клетка либо свободна, либо занята
// препятствием. Стартовая клетка находится в строке r и столбце c. За один шаг вы
// можете переместиться на одну клетку вверх, влево, вниз или вправо, если она не занята
// препятствием. Вы не можете перемещаться за границы лабиринта.

// К сожалению, ваша клавиатура крайне близка к поломке, поэтому вы можете переместиться
// влево не более x раз и вправо не более y раз. При этом ограничений на перемещения
// вверх и вниз нет, поскольку клавиши, используемые для движения вверх и вниз, всё ещё
// в идеальном состоянии.

// Теперь вы для каждой клетки поля решили установить, можно ли выбрать такую
// последовательность нажатий, которая приведёт вас из стартовой в эту клетку. Посчитайте,
// сколько клеток поля обладают таким свойством.

// Входные данные
// Первая строка содержит два целых числа n, m (1 ≤ n, m ≤ 2000) — количество строк
// и столбцов в лабиринте соответственно.

// Вторая строка содержит два целых числа r, c (1 ≤ r ≤ n, 1 ≤ c ≤ m) — номер строки
// и столбца, на пересечении которых расположена стартовая клетка.

// Третья строка содержит два целых числа x, y (0 ≤ x, y ≤ 10^9) — максимальное
// количество перемещений влево и вправо соответственно.

// Следующие n строк содержат описание лабиринта. Каждая из этих строк имеет длину m
// и состоит только из символов '.' и '*'. В i-й строке j-й символ соответствует клетке
// лабиринта с номерами строки и столбца i и j соответственно. Символ '.' соответствует
// свободной клетке лабиринта, а символ '*' — клетке с препятствием.

// Гарантируется, что стартовая клетка не занята препятствием.

// Выходные данные
// Выведите одно число — количество клеток лабиринта, достижимых из стартовой, включая
// её саму.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 4 5
// 3 2
// 1 2
// .....
// .***.
// ...**
// *....
// ======================================================================
// Выходные данные
// ======================================================================
// 10

// ======================================================================
// Входные данные
// ======================================================================
// 4 4
// 2 2
// 0 1
// ....
// ..*.
// ....
// ....
// ======================================================================
// Выходные данные
// ======================================================================
// 7
// ======================================================================

// Примечание
// Клетки, достижимые в соответствующем примере, отмечены '+'.

// Первый пример:
// +++..
// +***.
// +++**
// *+++.

// Второй пример:
// .++.
// .+*.
// .++.
// .++.

#include <bits/stdc++.h>
using namespace std;

#define int long long

int n, m, start_y, start_x, x, y;

const int moveX[] = {-1, 1, 0, 0};
const int moveY[] = {0, 0, -1, 1};
// 0 1 2 3
// L R U D

bool cM(int nex, int ney)
{
    return nex >= 0 && nex < m && ney >= 0 && ney < n;
}

const int INF = 1e18;

void solve()
{
    cin >> n >> m >> start_y >> start_x >> x >> y;
    start_x--;
    start_y--;
    vector<vector<int>> a(n, vector<int>(m, INF)); //, dist(n, vector<int>(m, -1));
    for (auto &i : a)
        for (auto &j : i)
        {
            char ch;
            cin >> ch;
            if (ch != '.')
                j = -1;
        }

    deque<pair<int, int>> q;
    q.push_back({start_y, start_x});
    a[start_y][start_x] = 0;

    while (!q.empty())
    {
        auto cur = q.front();
        q.pop_front();

        for (int i = 0; i < 4; i++)
        {
            int new_x = cur.second + moveX[i], new_y = cur.first + moveY[i];
            if (cM(new_x, new_y) && a[new_y][new_x] != -1)
            {
                if (i == 1 && a[new_y][new_x] > a[cur.first][cur.second] + 1)
                {
                    a[new_y][new_x] = a[cur.first][cur.second] + 1;
                    q.push_back({new_y, new_x});
                }
                else if (i != 1 && a[new_y][new_x] > a[cur.first][cur.second])
                {
                    a[new_y][new_x] = a[cur.first][cur.second];
                    q.push_front({new_y, new_x});
                }
            }
        }
    }

    // for (auto &i : a)
    // {
    //     for (auto &j : i)
    //         cout << j << ' ';
    //     cout << '\n';
    // }
    int res = 0;
    for (int yi = 0; yi < n; yi++)
        for (int xi = 0; xi < m; xi++)
            if (start_x + a[yi][xi] - xi <= x && a[yi][xi] <= y && a[yi][xi] != -1)
                res++;
    cout << res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
