// K. Лиса и имена
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Лиса Ciel собирается опубликовать статью по ЛИС (Лисооперируемым Интеллектуальным
// Системам). Она слышала, что список авторов научной статьи всегда сортируется
// в лексикографическом порядке.

// После изучения примеров оформления лиса обнаружила, что иногда это утверждение
// не верно. В некоторых статьях имена авторов не сортируются в лексикографическом
// порядке в обычном понимании. Но, оказывается, верно то, что после некоторого
// изменения порядка букв в алфавите порядок авторов становится лексикографическим!

// Лиса хочет знать, существует ли такой порядок букв латинского алфавита, что имена
// авторов предлагаемой ею статьи следуют в лексикографическом порядке. Если да,
// то требуется также найти любой такой порядок.

// Лексикографический порядок определяется следующим образом. Мы сравниваем s и t,
// сперва находя крайнюю левую позицию с различающимися символами: s_i ≠ t_i.
// Если такой позиции нет (то есть s — это префикс t или наоборот), то более короткая
// строка меньше. В противном случае мы сравниваем символы s_i и t_i согласно их
// порядку в алфавите.

// Входные данные
// В первой строке записано целое число n (1 ≤ n ≤ 100) — количество имён.

// В каждой из следующих n строк записано по одному слову name_i (1 ≤ |name_i| ≤ 100),
// обозначающему i-е имя. Каждое имя содержит только строчные буквы латинского алфавита.
// Все имена различны.

// Выходные данные
// Если существует такой порядок букв, при котором имена в данном списке следуют
// в лексикографическом порядке, выведите любой такой порядок в виде перестановки
// символов 'a'–'z' (иными словами, выведите сначала первую букву модифицированного
// алфавита, затем вторую, и так далее).

// В противном случае выведите единственное слово «Impossible» (без кавычек).

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 3
// rivest
// shamir
// adleman
// ======================================================================
// Выходные данные
// ======================================================================
// bcdefghijklmnopqrsatuvwxyz

// ======================================================================
// Входные данные
// ======================================================================
// 10
// tourist
// petr
// wjmzbmr
// yeputons
// vepifanov
// scottwu
// oooooooooooooooo
// subscriber
// rowdark
// tankengineer
// ======================================================================
// Выходные данные
// ======================================================================
// Impossible

// ======================================================================
// Входные данные
// ======================================================================
// 10
// petr
// egor
// endagorion
// feferivan
// ilovetanyaromanova
// kostka
// dmitriyh
// maratsnowbear
// bredorjaguarturnik
// cgyforever
// ======================================================================
// Выходные данные
// ======================================================================
// aghjlnopefikdmbcqrstuvwxyz

// ======================================================================
// Входные данные
// ======================================================================
// 7
// car
// care
// careful
// carefully
// becarefuldontforgetsomething
// otherwiseyouwillbehacked
// goodluck
// ======================================================================
// Выходные данные
// ======================================================================
// acbdefhijklmnogpqrstuvwxyz
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<string> a(n);
    for (auto &i : a)
        cin >> i;
    vector<vector<int>> gra(26);
    vector<int> p(26, 0);
    for (int i = 0; i < n - 1; i++)
    {
        int j = 0;
        while (j < a[i].size() && j < a[i + 1].size() && a[i][j] == a[i + 1][j])
            j++;

        if (j == min(a[i].size(), a[i + 1].size()))
        {
            if (a[i].size() > a[i + 1].size())
            {
                cout << "Impossible";
                return;
            }
            continue;
        }

        gra[a[i][j] - 'a'].push_back(a[i + 1][j] - 'a');
        p[a[i + 1][j] - 'a']++;
    }

    queue<int> q;
    vector<int> res;
    for (int i = 0; i < 26; i++)
        if (!p[i])
        {
            q.push(i);
            res.push_back(i);
        }

    while (!q.empty())
    {
        int cur = q.front();
        q.pop();

        for (auto &i : gra[cur])
        {
            p[i]--;
            if (!p[i])
            {
                res.push_back(i);
                q.push(i);
            }
        }
    }
    if (res.size() != 26)
    {
        cout << "Impossible";
        return;
    }
    for (auto &i : res)
        cout << char('a' + i);
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
