// Алгоритм Краскала
// ограничение по времени на тест - (не указано)
// ограничение по памяти на тест - (не указано)

// Напишите программу, которая будет либо находить вес ОДМВ (остовного дерева
// минимального веса) неориентированного взвешенного графа без петель с положительными
// длинами рёбер, либо устанавливать, что введённый граф несвязный.

// Входные данные
// Первая строка входных данных содержит два числа N и M, разделённые пробелом —
// количество вершин и количество рёбер графа. Далее следуют M строк, каждая из которых
// содержит по три целых числа, разделённые пробелами. Первые два из них разные,
// в пределах от 0 до N–1 каждое, и обозначают концы соответствующего ребра, третье —
// в пределах от 1 до 1000000000 и обозначает длину этого ребра. Гарантировано, что все
// рёбра имеют различные длины. Количество вершин графа не превышает 80000,
// количество рёбер — 100000.

// Выходные данные
// Выведите на стандартный выход (экран) либо единственное число — сумму длин рёбер
// остовного дерева минимального веса (если граф связный), либо единственную фразу
// «NON-CONNECTED» (без кавычек, через дефис), если граф не связный.

// ======================================================================
// Примечание
// ======================================================================
// При указанных ограничениях на длины и количество рёбер возможно переполнение типа
// int, используйте long long.

// Указания.

// Алгоритму Краскала, в отличие от предыдущих графовых задач, совершенно не нужно,
// чтобы граф был представлен списками смежности. Зато нужно сортировать рёбра по длине.
// Разрешается самому написать сортировки (со сложностью O(N logN), иначе программа
// окажется недостаточно эффективной). Но рекомендуется заставить работать стандартный
// алгоритм sort. Для него нужно подключить заголовочный файл algorithm и указать,
// каким образом сравнивать структуры, представляющие рёбра. Для этого можно перегрузить
// (overload) операцию сравнения operator < для типа, представляющего ребро (подробнее
// см. в книгах, help-е, а также в указаниях к задаче «Алгоритм Дейкстры за M logN»).

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5 7
// 1 2 5
// 1 3 2
// 2 3 4
// 2 4 3
// 3 4 6
// 0 3 20
// 0 4 10
// ======================================================================
// Выходные данные
// ======================================================================
// 19
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

struct DSU
{
    vector<int> p, r;
    DSU(int n)
    {
        p.resize(n);
        r.assign(n, 1);
        for (int i = 0; i < n; i++)
            p[i] = i;
    }

    int get(int x) { return p[x] = (x == p[x] ? x : get(p[x])); }

    bool united(int a, int b)
    {
        a = get(a), b = get(b);
        if (a != b)
        {
            if (r[a] > r[b])
                swap(a, b);
            p[a] = b;
            if (r[a] == r[b])
                r[b]++;
            return 1;
        }
        return 0;
    }
};

void solve()
{
    int n, m;
    cin >> n >> m;
    DSU d(n);
    vector<pair<int, pair<int, int>>> a(m);
    for (auto &i : a)
        cin >> i.second.first >> i.second.second >> i.first;
    sort(a.begin(), a.end());
    int res = 0, ecnt = 0;
    for (auto &i : a)
    {
        if (d.united(i.second.first, i.second.second))
        {
            res += i.first;
            ecnt++;
        }
    }
    if (ecnt != n - 1)
    {
        cout << "NON-CONNECTED\n";
        return;
    }

    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
