// A. Поединок волшебников
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Гарри Поттер и Тот-Кого-Нельзя-Называть снова сошлись в смертельном поединке.
// На этот раз они стоят в противоположных концах коридора длины l метров и одновременно
// пускают в противника свои смертельные заклинания. Известно, что магический импульс
// заклинания Гарри распространялся со скоростью p метров в секунду, а магический
// импульс заклинания Сами-Знаете-Кого — со скоростью q метров в секунду.

// Импульсы движутся по коридору навстречу друг другу, и в момент столкновения
// разворачиваются и летят обратно к тем, кто их выпустил, не меняя своих изначальных
// скоростей. Затем каждый из волшебников отражает вернувшийся импульс, и тот снова
// летит в сторону врага, опять же не меняя своей скорости.

// Так как Гарри отлично освоил основы магии, то он знает, что после второго
// столкновения импульсы исчезнут, а в месте их встречи произойдёт сильный взрыв.
// Но вот с математикой у юного волшебника проблемы, поэтому он просит вас вычислить
// расстояние от его позиции до места второй встречи импульсов заклинаний, при условии,
// что противники стоят на месте в течение всего боя.

// Входные данные
// В первой строке ввода записано единственное целое число l (1 ≤ l ≤ 1000) —
// длина коридора, в котором происходит поединок.

// Во второй строке находится целое число p, в третьей — целое число q
// (1 ≤ p, q ≤ 500) — скорости магических импульсов Гарри Поттера и Того-Кого-Нельзя-Называть
// соответственно.

// Выходные данные
// Выведите единственное число — расстояние от конца коридора, в котором стоит Гарри,
// до места второй встречи импульсов заклинаний. Ваш ответ будет считаться правильным,
// если его абсолютная или относительная ошибка не будет превосходить 10^{-4}.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 100
// 50
// 50
// ======================================================================
// Выходные данные
// ======================================================================
// 50

// ======================================================================
// Входные данные
// ======================================================================
// 199
// 60
// 40
// ======================================================================
// Выходные данные
// ======================================================================
// 119.4
// ======================================================================

// Примечание
// В первом тесте из условия скорости импульсов равны, поэтому обе их встречи
// произойдут ровно посередине между Гарри и Тем-Кого-Нельзя-Называть.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    double l, p, q;
    cin >> l >> p >> q;
    double lx = 0, rx = 2;

    cout << setprecision(20) << l / (p + q) * p << ' ';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
