// B. Задача на равенство
// ограничение по времени на тест2 seconds
// ограничение по памяти на тест256 megabytes

// Компания из n весёлых программистов отмечает день рождения Роберта Флойда.
// Поликарпу досталась почётная обязанность — разливать Бер-Колу. Очень важно разлить
// Бер-Колу поровну, то есть так, чтобы объём напитка в каждой из n кружек оказался
// одинаков.

// Поликарп уже начал процесс, частично опустошив бутылку Бер-Колы. Сейчас в первой
// кружке a1 миллилитров напитка, во второй — a2 миллилитра и т.д. В бутылке осталось
// b миллилитров, которые Поликарп собирается распределить между кружками так, чтобы
// выполнялось заветное равенство.

// Напишите программу, которая определит объём напитка, который надо долить в каждую
// из кружек, чтобы следующие два условия выполнялись одновременно:

// - суммарно было разлито b миллилитров, то есть чтобы бутылка была опустошена;
// - после окончания процесса объёмы напитка в кружках должны быть равны.

// Входные данные
// В первой строке записана пара целых чисел n, b (2 ≤ n ≤ 100, 1 ≤ b ≤ 100),
// где n — общее число друзей в компании, а b — текущий объём напитка в бутылке.
// Вторая строка содержит последовательность целых чисел a1, a2, …, a_n (0 ≤ a_i ≤ 100),
// где a_i — текущий объём напитка в i-й кружке.

// Выходные данные
// Выведите единственное число «-1» (без кавычек), если решения не существует.
// В противном случае выведите n вещественных чисел c1, c2, …, c_n, где c_i — объём
// напитка, который надо долить в i-ю кружку. Числа выводите не менее чем с 6 знаками
// после десятичной точки, каждое c_i выводите на отдельной строке. Поликарп доказал,
// что если решение существует, то оно единственно.

// На тестирующем компьютере по умолчанию установлена русская локаль. Убедитесь,
// что ваше решение выводит точку для отделения целой части вещественного числа
// от дробной, а не запятую.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5 50
// 1 2 3 4 5
// ======================================================================
// Выходные данные
// ======================================================================
// 12.000000
// 11.000000
// 10.000000
// 9.000000
// 8.000000

// ======================================================================
// Входные данные
// ======================================================================
// 2 2
// 1 100
// ======================================================================
// Выходные данные
// ======================================================================
// -1
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    double n, b;
    cin >> n >> b;
    int s = 0;
    vector<double> a(n), res(n);
    for (auto &i : a)
    {
        cin >> i;
        s += i;
    }
    double target = (s + b) / n, f = 0;
    for (int i = 0; i < n; i++)
    {
        res[i] = target - a[i];
        if (res[i] < 0)
        {
            cout << "-1";
            return;
        }
    }

    for (auto &i : res)
        cout << setprecision(20) << i << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
