// D. Добавление цифр
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// У Васи есть два числа: a и b. Однако число a кажется Васе слишком коротким.
// По этой причине он решил n раз повторить операцию удлинения числа a.

// Одна операция удлинения числа состоит в дописывании к числу ровно одной цифры
// (в десятичной системе счисления) справа таким образом, чтобы полученное число
// делилось на Васино число b. Если невозможно получить число, которое делится на b,
// то операцию удлинения применять нельзя.

// Ваша задача состоит в том, чтобы помочь Васе и вывести число, которое может
// получиться у Васи при применении к числу a операции удлинения n раз.

// Входные данные
// В первой строке входных данных содержится три целых числа: a, b, n (1 ≤ a, b, n ≤ 10^5).

// Выходные данные
// В единственной строке выведите целое число без лидирующих нулей, которое может
// получиться у Васи при применении к числу a операции удлинения n раз. Если такого
// числа не существует, то выведите число -1. Если возможных ответов несколько,
// выведите любой.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5 4 5
// ======================================================================
// Выходные данные
// ======================================================================
// 524848

// ======================================================================
// Входные данные
// ======================================================================
// 12 11 1
// ======================================================================
// Выходные данные
// ======================================================================
// 121

// ======================================================================
// Входные данные
// ======================================================================
// 260 150 10
// ======================================================================
// Выходные данные
// ======================================================================
// -1
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int a, b, n;
    cin >> a >> b >> n;
    for (int i = 0; i < 10; i++)
    {
        if ((a * 10 + i) % b == 0)
        {
            cout << a * 10 + i;
            for (int j = 0; j < n - 1; j++)
                cout << '0';
            return;
        }
    }

    cout << "-1";
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
