// E. Компьютерная игра
// ограничение по времени на тест1 second
// ограничение по памяти на тест256 megabytes

// Петя, старший брат Васи, очень любит играть в компьютерные игры. В одной из своих
// любимых игр Петя дошел до последнего уровня, на котором происходит битва с боссом.

// Во время прохождения игры Петя находил свитки с заклинаниями, и теперь ему предстоит
// их использовать. Опишем, как происходит бой на этом уровне:

// 1) У босса есть два параметра: max — начальное количество здоровья, и reg —
//    ежесекундная регенерация.

// 2) У каждого свитка также есть два параметра: pow_i — сила заклинания, измеряемая
//    в процентах — максимальное количество здоровья босса, отсчитываемое от исходного,
//    при котором можно использовать данный свиток (т. е. если у босса больше pow_i
//    процентов здоровья, свиток применять нельзя); и dmg_i — урон в секунду, который
//    получает босс, если использовать этот свиток. Как только какой-то свиток использован,
//    он пропадает, и на босса накладывается ещё одно заклинание, которое будет наносить
//    ему dmg_i урона каждую секунду до конца игры.

// Действия в бою в течение одной секунды происходят в следующем порядке: сначала босс
// получает урон от всех заклинаний, наложенных на него, затем восстанавливает reg
// здоровья (при этом больше чем max здоровья получиться не может), а затем игрок
// может использовать очередной свиток (не больше одного в секунду).

// Босс считается поверженным, если в конце какой-то секунды количество здоровья стало
// неположительным (≤ 0).

// Помогите Пете определить, может ли он выиграть с имеющимся набором свитков, и если
// может, то за какое минимальное количество секунд он сможет это сделать.

// Входные данные
// В первой строке записаны три целых числа N, max и reg (1 ≤ N, max, reg ≤ 1000) —
// количество свитков и параметры босса. В следующих N строках записаны по два целых
// числа pow_i и dmg_i — параметры i-го свитка (0 ≤ pow_i ≤ 100, 1 ≤ dmg_i ≤ 2000).

// Выходные данные
// В случае, если Петя не сможет пройти этот уровень, в единственной строке выведите NO.

// Иначе в первой строке выведите YES. Во второй строке выведите минимальное время,
// через которое босс может быть повержен, и количество использованных свитков.
// В следующих строках для каждого использованного свитка выведите через пробел
// количество секунд, прошедших с начала боя до его использования, и номер
// использованного свитка. Свитки нумеруются с 1 в том порядке, в котором они заданы
// во входных данных. Считается, что первый свиток можно использовать через 0 секунд.

// Свитки выводите в том порядке, в котором их нужно использовать. Запрещается
// использовать свитки после того, как босс повержен.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 2 10 3
// 100 3
// 99 1
// ======================================================================
// Выходные данные
// ======================================================================
// NO

// ======================================================================
// Входные данные
// ======================================================================
// 2 100 10
// 100 11
// 90 9
// ======================================================================
// Выходные данные
// ======================================================================
// YES
// 19 2
// 0 1
// 10 2
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, mx_health, regen;
    cin >> n >> mx_health >> regen;
    vector<vector<int>> a(n, vector<int>(3));

    for (int i = 0; i < n; i++)
    {
        cin >> a[i][0] >> a[i][1];
        a[i][2] = i + 1;
    }

    int hp = mx_health, cur_dmg = 0;
    vector<bool> used(n, false);
    vector<vector<int>> used_scrolls;
    for (int t = 0; t < 4 * mx_health + 1000; t++)
    {
        if (t > 0)
        {
            hp -= cur_dmg;
            hp = min(mx_health, hp + regen);

            if (hp <= 0)
            {
                cout << "YES\n";
                cout << t << ' ' << used_scrolls.size() << '\n';
                for (int i = 0; i < used_scrolls.size(); i++)
                    cout << used_scrolls[i][0] << ' ' << used_scrolls[i][1] << '\n';
                return;
            }
        }
        int best_inx = -1, best_dmg = -1;
        for (int i = 0; i < n; i++)
        {
            if (!used[i])
            {
                if (hp * 100 <= a[i][0] * mx_health && a[i][1] > best_dmg)
                {
                    best_inx = i;
                    best_dmg = a[i][1];
                }
            }
        }
        if (best_inx != -1)
        {
            used[best_inx] = true;
            cur_dmg += best_dmg;
            used_scrolls.push_back({t, a[best_inx][2]});
        }
        else if (cur_dmg <= regen)
        {
            cout << "NO\n";
            return;
        }
    }
    cout << "NO\n";
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
