// F. Почти разница
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Определим функцию d(x, y) = x − y, если x > y, иначе 0.

// Задан массив a, состоящий из n целых чисел. Посчитайте сумму d(a_i, a_j) по всем
// парам (i, j) таким, что 1 ≤ i ≤ j ≤ n.

// Входные данные
// В первой строке записано одно целое число n (1 ≤ n ≤ 200000) — количество элементов
// в a.

// Во второй строке записаны n целых чисел a1, a2, …, a_n (1 ≤ a_i ≤ 10^9) —
// элементы массива.

// Выходные данные
// Выведите одно целое число — сумму d(a_i, a_j) по всем парам (i, j) таким, что
// 1 ≤ i ≤ j ≤ n.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 1 2 3 1 3
// ======================================================================
// Выходные данные
// ======================================================================
// 4

// ======================================================================
// Входные данные
// ======================================================================
// 4
// 6 6 5 5
// ======================================================================
// Выходные данные
// ======================================================================
// 0

// ======================================================================
// Входные данные
// ======================================================================
// 4
// 6 6 4 4
// ======================================================================
// Выходные данные
// ======================================================================
// -8
// ======================================================================

// Примечание
// В первом примере:

// d(a1, a2) = 0;
// d(a1, a3) = 2;
// d(a1, a4) = 0;
// d(a1, a5) = 2;
// d(a2, a3) = 0;
// d(a2, a4) = 0;
// d(a2, a5) = 0;
// d(a3, a4) = −2;
// d(a3, a5) = 0;
// d(a4, a5) = 2.

#include <bits/stdc++.h>
using namespace std;

#define int long double

int f(int x, int y)
{
    if (abs(x - y) > 1)
        return y - x;
    return 0;
}

void solve()
{
    int n, res = 0, prev_s = 0;
    cin >> n;
    map<int, int> m;
    for (int i = 0; i < n; i++)
    {
        int x;
        cin >> x;
        res += (i * x - prev_s);
        if (m.count(x - 1))
            res -= m[x - 1];
        if (m.count(x + 1))
            res -= m[x + 1] * (-1);
        prev_s += x;
        m[x]++;
    }
    cout << setprecision(20) << res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
