// B01. Игра
// ограничение по времени на тест0.5 секунд
// ограничение по памяти на тест64 мегабайта

// В вузе ИТ-града существует такая легенда. Студенту, не ответившему ни на один вопрос
// на экзамене по теории игр, преподаватель даёт последний шанс. Студенту нужно сыграть
// с преподавателем в игру.

// Игра происходит на квадратном клетчатом поле n × n. Изначально все клетки поля пусты.
// На каждом ходу игрок выбирает пустую клетку, не имеющую общих сторон с закрашенными
// клетками, и закрашивает её. Касание закрашенных клеток углами допускается. На следующем
// ходу то же самое делает второй игрок, после него первый и так далее. Тот, кому некуда
// сделать ход, проигрывает.

// Преподаватель уже выбрал размер поля n и предоставил студенту выбор ходить первым
// или вторым. Что должен выбрать студент, чтобы выиграть в игре? Будем считать, что оба
// игрока играют оптимально.

// Входные данные
// Единственная строка входных данных содержит одно целое число n (1 ≤ n ≤ 10^18) —
// размер поля.

// Выходные данные
// Выведите число 1, если при оптимальной игре обоих игроков выиграет игрок, делающий
// первый ход, иначе число 2.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 1
// ======================================================================
// Выходные данные
// ======================================================================
// 1

// ======================================================================
// Входные данные
// ======================================================================
// 2
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    cout << (n % 2 ? 1 : 2);
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
