// A. Искандер и рисунки
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// На уроке геометрии Искандеру было очень скучно, поэтому он решил разрисовать
// тетрадь Юры. Для этого он брал очередную строку и рисовал на ней горизонтальные
// линии. Где-то линии длинные, где-то короткие, а где-то страница осталась чистой.

// Страница представлена строкой s, где символ '*' — чистый участок бумаги, а символ
// '#' — сантиметр нарисованной линии. Непрерывная последовательность символов '#'
// образует одну линию.

// Юра решил стереть все линии и заставил Искандера ему помочь: они будут стирать
// одну из линий с двух концов одновременно.

// Каждую секунду Искандер стирает 1 сантиметр справа линии, а Юра — 1 сантиметр слева.
// Если текущая длина линии составляет 1 или 2 сантиметра, то в следующую секунду
// она стирается полностью, и игра заканчивается.

// Юра хочет выбрать линию так, чтобы вместе с Искандером стирать её как можно дольше.
// Помогите ему определить это максимальное время. Если линии на странице нет,
// стирание длится 0 секунд.

// Входные данные
// Первая строка содержит единственное целое число t (1 ≤ t ≤ 2500) — количество
// наборов входных данных.

// Первая строка каждого набора входных данных содержит целое число n (1 ≤ n ≤ 10) —
// длина строки s.

// Вторая строка каждого набора входных данных содержит строку s длины n из символов
// '#' и '*'.

// Выходные данные
// Для каждого набора входных данных выведите одно число — максимальную длительность
// стирания среди всех линий.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 7
// #*##*##
// 8
// ########
// 8
// ********
// 8
// #*****##
// 6
// *#####
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 4
// 0
// 1
// 3
// ======================================================================
#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, mx_l = 0, loc_l = 0;
    cin >> n;
    for (int i = 0; i < n; i++)
    {
        char c;
        cin >> c;
        if (c == '#')
        {
            loc_l++;
            mx_l = max(loc_l, mx_l);
        }
        else
            loc_l = 0;
    }
    cout << (mx_l + 1) / 2 << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
