// B. Никита и книги
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Никита, как известно, очень любит читать. Сегодня он устроил беспорядок в своей
// комнате и сложил книги в n башен в ряд, пронумерованных от 1 до n слева направо.
// В i-й башне a_i книг. Такое расположение книг будет аккуратным, если во всех башнях,
// кроме самой правой, количество книг строго меньше, чем количество книг в башне
// справа от неё, то есть массив a является строго возрастающим.

// Юра хочет сделать расположение книг аккуратным, проделывая следующее действие
// любое количество раз:

// - Выбрать башню i такую, что 1 ≤ i < n и a_i > 1.
// - Взять 1 книгу сверху башни i, a_i при этом уменьшится на 1.
// - Положить книгу наверх башни i+1, a_{i+1} при этом увеличится на 1.

// Определите, получится ли у Юры сделать расположение книг аккуратным?

// Входные данные
// Первая строка содержит единственное число t (1 ≤ t ≤ 10^4) — количество наборов
// входных данных.

// Первая строка каждого набора входных данных содержит одно целое число n
// (1 ≤ n ≤ 2·10^5) — количество башен.

// Вторая строка каждого набора входных данных содержит n целых чисел a_i
// (1 ≤ a_i ≤ 10^9) — изначальное количество книг в каждой башне.

// Гарантируется, что сумма n по всем наборам входных данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите «YES», если Юра сможет сделать
// расположение аккуратным, и «NO» иначе.

// Вы можете выводить каждую букву в любом регистре (строчную или заглавную). Например,
// строки «yEs», «yes», «Yes» и «YES» будут приняты как положительный ответ.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 7
// 3
// 1 2 3
// 3
// 1 1 2
// 3
// 10 1 1
// 3
// 2 2 2
// 4
// 1 4 2 2
// 5
// 8 2 8 1 8
// 4
// 1 1 3 5
// ======================================================================
// Выходные данные
// ======================================================================
// YES
// NO
// YES
// YES
// NO
// YES
// NO
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, need = 0;
    cin >> n;
    vector<int> a(n), pref(n + 2, 0);
    for (auto &i : a)
        cin >> i;

    for (int i = 0; i < n; i++)
    {
        need += a[i] - (i + 1);
        if (need < 0)
        {
            cout << "NO\n";
            return;
        }
    }

    cout << "YES\n";
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
