// C. Стёпа и перестановка
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Стёпа нашёл перестановку p длины n. Стёпа, конечно же, решил её отсортировать.
// Чтобы процесс был интереснее, он выбрал два положительных целых числа x и y
// (x + y ≤ n) и установил правило для обмена элементов.

// За один ход Стёпа может выбрать два индекса i и j (1 ≤ i, j ≤ n) и поменять
// местами элементы p_i и p_j, если выполняется хотя бы одно из следующих условий:

// - |i − j| = x
// - |i − j| = y

// Стёпа хочет узнать, можно ли отсортировать перестановку в порядке возрастания,
// совершив любое количество таких операций. Помогите ему ответить на этот вопрос.

// Входные данные
// Первая строка содержит одно целое число t (1 ≤ t ≤ 10^4) — количество наборов
// входных данных.

// Первая строка каждого набора входных данных содержит три целых числа n, x и y
// (1 ≤ x, y ≤ n ≤ 2·10^5, x + y ≤ n) — длина массива и числа, выбранные Стёпой.

// Вторая строка каждого набора входных данных содержит n целых чисел p_i (1 ≤ p_i ≤ n) —
// массив p; гарантируется, что p является перестановкой.

// Гарантируется, что сумма n по всем наборам входных данных не превышает 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите «YES», если при данных x и y можно
// отсортировать перестановку, и «NO» иначе.

// Вы можете выводить каждую букву в любом регистре (строчную или заглавную). Например,
// строки «yEs», «yes», «Yes» и «YES» будут приняты как положительный ответ.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 5 2 3
// 5 4 3 2 1
// 6 2 4
// 2 1 4 3 6 5
// 4 2 2
// 1 2 3 4
// 5 2 3
// 1 2 3 5 4
// ======================================================================
// Выходные данные
// ======================================================================
// YES
// NO
// YES
// YES
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

int foo(int a, int b)
{
    while (a != 0 && b != 0)
    {
        if (a > b)
            a %= b;
        else
            b %= a;
    }
    return a + b;
}

void solve()
{
    int n, x, y, d;
    cin >> n >> x >> y;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;
    d = foo(x, y);

    for (int i = 0; i < n; i++)
    {
        if ((a[i] - 1) % d != i % d)
        {
            cout << "NO\n";
            return;
        }
    }

    cout << "YES\n";
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
