// A. Люди уходят
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Люди стоят в шеренге на позициях с 1 до n. Нужно выполнить набор запросов
// следующих двух типов:

// - «- x» — человек с позиции x ушёл;
// - «? x» — найти ближайшего человека справа, который ещё стоит.

// Входные данные
// Первая строка входного файла содержит два числа n и m (1 ≤ n, m ≤ 10^6) —
// число людей и число запросов. Далее идут m строк запросов, по одному на строке.
// Для запросов на уход человека строка выглядит как «- x» (1 ≤ x ≤ n).
// Для запросов на ближайшего человека справа строка выглядит как «? x» (1 ≤ x ≤ n).
// Известно, что все позиции, с которых уходят люди, различны.

// Выходные данные
// Выведите результат каждой операции «?» по одной на строке в соответствующем порядке.
// Если справа человека нет — выведите «-1».

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5 10
// ? 1
// - 3
// ? 3
// - 2
// ? 1
// ? 2
// - 4
// ? 3
// - 5
// ? 3
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 4
// 1
// 4
// 5
// -1
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

struct DSU
{
    vector<int> p;
    bool last_good = 1;
    int size;

    DSU(int n)
    {
        size = n;
        p.resize(n);
        for (int i = 0; i < n; i++)
            p[i] = i;
    }

    int get(int x)
    {
        if (x == p[x])
            return x;
        return p[x] = get(p[x]);
    }

    void united(int a)
    {
        if (a + 1 == size)
        {
            last_good = 0;
            return;
        }
        a = get(a);
        int ra = get(a + 1);
        p[a] = ra;
    }
};

void solve()
{
    int n, m;
    cin >> n >> m;
    DSU d(n);
    while (m--)
    {
        char type;
        int x;
        cin >> type >> x;
        x--;
        if (type == '?')
        {
            int q = d.p[d.get(x)];
            q++;
            cout << (q == n && !d.last_good ? -1 : q) << '\n';
        }
        else
            d.united(x);
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
