// B. Парковка
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// На кольцевой парковке есть n мест, пронумерованных от 1 до n. Всего на парковку
// приезжает n машин в порядке нумерации. У i-й машины известно место p_i, которое
// она хочет занять. Если машина приезжает на парковку, а её место занято, то она едет
// далее по кругу и встаёт на первое свободное место.

// Входные данные
// В первой строке входного файла находится число n (1 ≤ n ≤ 300000) — размер парковки
// и число машин. Во второй строке записаны n чисел, i-е из которых p_i (1 ≤ p_i ≤ n) —
// место, которое хочет занять машина с номером i.

// Выходные данные
// Выведите n чисел: i-е число — номер парковочного места, которое было занято машиной
// с номером i.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 3
// 2 2 2
// ======================================================================
// Выходные данные
// ======================================================================
// 2 3 1
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

struct DSU
{
    vector<int> p;
    int size;
    vector<bool> z;
    DSU(int n)
    {
        p.resize(n);
        z.assign(n, 0);
        size = n;
        for (int i = 0; i < n; i++)
            p[i] = i;
    }

    int get(int x) { return p[x] = (x == p[x] ? x : get(p[x])); }

    int united(int x)
    {
        int c = get(x);
        int nxt_x = get((c + 1) % size);
        p[c] = nxt_x;

        return c + 1;
    }
};

void solve()
{
    int n;
    cin >> n;
    DSU d(n);
    for (int i = 0; i < n; i++)
    {
        int v;
        cin >> v;
        cout << d.united(v - 1) << ' ';
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
