// C. Реструктуризация компании
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// В жизни даже самой успешной компании может наступить кризисный период, когда
// приходится принимать тяжёлое решение о реструктуризации, распускать и объединять
// отделы, увольнять работников и заниматься прочими неприятными делами. Рассмотрим
// следующую модель компании.

// В Большой Софтверной Компании работают n человек. Каждый человек принадлежит
// какому-то отделу. Исходно каждый человек работает над своим проектом в своём
// собственном отделе (таким образом, в начале компания состоит из n отделов
// по одному человеку).

// Однако в жизни компании наступили тяжёлые времена, и руководство было вынуждено
// нанять кризисного менеджера, который начал переустраивать рабочий процесс для
// повышения эффективности производства. Обозначим за team(person) команду, в которой
// работает человек person. Кризисный менеджер может принимать решения двух типов:

// 1. Объединить отделы team(x) и team(y), сформировав из них один большой отдел,
//    содержащий всех сотрудников team(x) и team(y), где x и y (1 ≤ x, y ≤ n) —
//    номера каких-то двух сотрудников компании. Если team(x) совпадает с team(y),
//    ничего делать не требуется.
// 2. Объединить отделы team(x), team(x + 1), …, team(y), где x и y (1 ≤ x ≤ y ≤ n) —
//    номера каких-то двух сотрудников компании.

// При этом кризисный менеджер иногда может интересоваться, работают ли в одном отделе
// сотрудники x и y (1 ≤ x, y ≤ n).

// Помогите кризисному менеджеру, ответив на все его запросы.

// Входные данные
// Первая строка входных данных содержит два целых числа n и q
// (1 ≤ n ≤ 200 000, 1 ≤ q ≤ 500 000) — число сотрудников компании и число запросов
// кризисного менеджера соответственно.

// В последующих q строках находятся запросы кризисного менеджера. Каждый запрос имеет
// вид type x y, где 1 ≤ type ≤ 3. Если type = 1 или type = 2, то запрос представляет
// собой решение кризисного менеджера об объединении отделов соответственно первого
// или второго вида. Если type = 3, то требуется определить, работают ли в одном отделе
// сотрудники x и y. Обратите внимание, что x может равняться y в запросе любого типа.

// Выходные данные
// На каждый запрос типа 3 выведите «YES» или «NO» (без кавычек), в зависимости
// от того, работают ли в одном отделе соответствующие люди.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 8 6
// 3 2 5
// 1 2 5
// 3 2 5
// 2 4 7
// 2 1 2
// 3 1 7
// ======================================================================
// Выходные данные
// ======================================================================
// NO
// YES
// YES
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

struct DSU
{
    vector<int> p;
    DSU(int n)
    {
        p.resize(n);
        for (int i = 0; i < n; i++)
            p[i] = i;
    }

    int get(int x) { return p[x] = (x == p[x] ? x : get(p[x])); }

    void united(int a, int b)
    {
        a = get(a), b = get(b);
        if (a != b)
            p[a] = b;
    };
};

void solve()
{
    int n, q, t, x, y;
    cin >> n >> q;
    DSU d(n), dn(n + 1);
    while (q--)
    {
        cin >> t >> x >> y;
        x--;
        y--;
        if (t == 1)
            d.united(x, y);
        else if (t == 2)
        {
            int z = dn.get(x);
            while (z < y)
            {
                d.united(z, z + 1);
                dn.united(z, z + 1);
                z = dn.get(z + 1);
            }
        }
        else
            cout << (d.get(x) == d.get(y) ? "YES\n" : "NO\n");
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
