// B. Построение строки
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Даны два целых числа n и k.

// Постройте бинарную строку* s длины n такую, что выполняются оба следующих условия:

// - Модуль разности между количеством символов 0 и количеством символов 1 в s
//   не превосходит 1.
// - В s ровно k пар равных соседних символов. Формально, существует ровно k индексов i
//   (1 ≤ i ≤ n − 1), для которых s_i = s_{i+1}.

// Или определите, что такой строки не существует.

// * Бинарная строка — это строка, в которой каждый символ равен либо 0, либо 1.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 1000) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// В единственной строке каждого набора входных данных содержатся два целых числа n и k
// (2 ≤ n ≤ 2·10^5, 0 ≤ k ≤ n − 1).

// Гарантируется, что сумма значений n по всем наборам входных данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите бинарную строку s длины n —
// построенную вами строку. Если такой строки не существует, выведите −1.

// Если ответов несколько, вы можете вывести любой из них.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 8
// 5 2
// 4 3
// 6 1
// 5 0
// 7 3
// 4 2
// 3 2
// 7 4
// ======================================================================
// Выходные данные
// ======================================================================
// 01110
// -1
// 101001
// 01010
// 0100011
// 0011
// -1
// 0111000
// ======================================================================

// Примечание
// В первом наборе входных данных один из возможных ответов — s = 01110. В ней три
// символа 1 и два символа 0, а также в s ровно 2 пары соседних равных символов:
// (s2, s3) и (s3, s4).

// Во втором наборе входных данных k = n − 1. Все символы в s должны быть одинаковыми,
// поэтому количество символов 0 и 1 не может отличаться не более чем на 1.
// Следовательно, ответ — −1.

// В третьем наборе входных данных обратите внимание, что 010110 также является
// возможным ответом.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, k;
    cin >> n >> k;
    if (k >= n - 1)
    {
        cout << "-1\n";
        return;
    }
    int c0 = (n + 1) / 2, c1 = n / 2;
    string s = "";
    int T = n - 1 - k, L = T + 1;
    int z = (L + 1) / 2, o = L / 2, need_zeros = c0 - z, need_ones = c1 - o;
    bool added_zeros = false, added_ones = false;

    for (int i = 0; i < L; i++)
    {
        char cur = i % 2 == 0 ? '0' : '1';
        s.push_back(cur);
        if (cur == '0' && !added_zeros)
        {
            s.append(need_zeros, '0');
            added_zeros = true;
        }
        else if (cur == '1' && !added_ones)
        {
            s.append(need_ones, '1');
            added_ones = true;
        }
    }
    cout << s << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
