// B. Различные строки
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// По заданной строке s выведите все строки, которые могут быть получены из данной
// путём перестановки символов в ней.

// Входные данные
// Единственная строка содержит s (1 ≤ |s| ≤ 8).

// Выходные данные
// В первой строке выведите количество различных строк. Далее выведите сами строки
// в лексикографическом порядке.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// aabac
// ======================================================================
// Выходные данные
// ======================================================================
// 20
// aaabc
// aaacb
// aabac
// aabca
// aacab
// aacba
// abaac
// abaca
// abcaa
// acaab
// acaba
// acbaa
// baaac
// baaca
// bacaa
// bcaaa
// caaab
// caaba
// cabaa
// cbaaa
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    string s;
    cin >> s;
    sort(s.begin(), s.end());
    vector<string> res;
    do
    {
        res.push_back(s);
    } while (next_permutation(s.begin(), s.end()));

    cout << res.size() << '\n';
    for (auto &i : res)
        cout << i << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
