// C. Снова шахматы
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Ваша задача расставить 8 ферзей на шахматной доске так, чтобы никакая пара ферзей
// не атаковала друг друга. Также в некоторые клетки нельзя ставить ферзей, но при
// этом такие клетки не защищают ферзей от атаки (то есть ферзи могут атаковать
// через них).

// Ваша задача посчитать количество способов, как можно расставить 8 ферзей
// вышеописанным способом.

// Входные данные
// Во входном файле содержится 8 строк по 8 символов, задающих типы клеток на доске.
// Если символ равен '*', то в эту клетку нельзя ставить ферзя.

// Выходные данные
// Одно целое число – количество способов расстановки.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// ........
// ........
// ..*.....
// ........
// ........
// .....**.
// ...*....
// ........
// ======================================================================
// Выходные данные
// ======================================================================
// 65
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    vector<int> a(8);
    iota(a.begin(), a.end(), 0);
    vector<vector<bool>> m(8, vector<bool>(8, true));
    for (int i = 0; i < 8; i++)
    {
        string s;
        cin >> s;
        for (int j = 0; j < 8; j++)
        {
            m[i][j] = s[j] == '.';
        }
    }

    int res = 0;
    do
    {
        bool ok = true;
        for (int i = 0; i < 8 && ok; i++)
        {
            if (!m[i][a[i]])
                ok = false;
            for (int k = 0; k < 8 && ok; k++)
            {
                if (i != k && abs(i - k) == abs(a[i] - a[k]))
                    ok = false;
            }
        }
        res += ok;
    } while (next_permutation(a.begin(), a.end()));
    cout << res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
