// B. Турнир
// ограничение по времени на тест2 seconds
// ограничение по памяти на тест256 megabytes

// Совсем недавно в Берляндии завершился турнир по скоростному засыпанию «Соня-2010».
// В турнире приняло участие n сильнейших участников со всей страны. Турнир состоит
// из игр, каждая из которых является противостоянием двух участников. Таким образом,
// в процессе турнира было проведено n·(n − 1) / 2 игр, то есть каждый из участников
// встретился с каждым.

// Правила игры очень просты — кто первый засыпает, тот и победил. Ответственный
// секретарь должен был записать каждую игру в виде пары чисел «x_i y_i», где x_i и y_i —
// это порядковые номера участников игры, причём тот, кто записан первым, является
// победителем игры (т.е. x_i — победитель, а y_i — проигравший). Ничьих в этой игре
// не бывает.

// Совсем недавно «Институт Изучения Сна» выяснил, что на самом деле каждый человек
// характеризуется величиной p_j — скоростью засыпания в экстремальных условиях.
// Таким образом, при игре двух игроков побеждает тот, у кого эта величина меньше.
// Величина p_j у каждого человека своя и не изменяется в течение жизни.

// Известно, что у всех участников турнира их p_j различны. Также известно, что
// секретарь сделал записи результатов всех игр, кроме одной.

// Ваша задача написать программу, которая по заданным записям результатов игр
// определяет недостающую.

// Входные данные
// В первой строке записано целое число n (3 ≤ n ≤ 50) — количество участников.
// Следующие n·(n − 1) / 2 − 1 строк содержат результаты всех игр. Каждая игра
// записана в отдельной строке в виде пары чисел x_i, y_i (1 ≤ x_i, y_i ≤ n, x_i ≠ y_i),
// где x_i и y_i — номера участников встречи. Известно, что в процессе турнира каждый
// из n участников принял участие в n − 1 игре, встретившись со всеми соперниками.

// Выходные данные
// Выведите пару чисел x y — недостающую запись. Если решений несколько, то выведите
// любое.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 4 2
// 4 1
// 2 3
// 2 1
// 3 1
// ======================================================================
// Выходные данные
// ======================================================================
// 4 3
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, l, r, x;
    cin >> n >> l >> r >> x;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;

    int res = 0;
    for (unsigned int i = 0; i < 1 << n; i++)
    {
        if (popcount(i) >= 2)
        {
            int s = 0, mn = 1e10, mx = 0;
            for (int j = 0; j < n; j++)
            {
                if (i & (1 << j))
                {
                    s += a[j];
                    mn = min(mn, a[j]);
                    mx = max(mx, a[j]);
                }
            }
            if (mx - mn >= x && s >= l && s <= r)
                res++;
        }
    }
    cout << res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
