// B. ezraft и массив
// ограничение по времени на тест1.5 секунд
// ограничение по памяти на тест256 мегабайт

// Вам дано одно целое число n. Постройте массив из n различных целых положительных
// чисел a1, a2, …, a_n такой, что для всех i (1 ≤ i ≤ n) сумма a1 + a2 + … + a_n
// делится на a_i, либо определите, что такого массива не существует.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 50) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// В первой и единственной строке каждого набора входных данных содержится одно целое
// число n (1 ≤ n ≤ 50).

// Выходные данные
// Для каждого набора входных данных, если решения не существует, выведите одно целое
// число −1.

// Иначе выведите n целых чисел a1, a2, …, a_n (1 ≤ a_i ≤ 10^17) — массив,
// удовлетворяющий условиям.

// Если решений несколько, выведите любое из них.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 3
// 1
// 4
// 5
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 1 9 2 6
// 12 3 10 20 15
// ======================================================================

// Примечание
// В первом наборе входных данных условие, очевидно, выполнено, поскольку 1 делится
// на само себя.

// Во втором наборе входных данных ответом является a = [1, 9, 2, 6]. Для него
// a1 + a2 + a3 + a4 = 18, что делится на все a_i.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    if (n == 1)
    {
        cout << "1\n";
        return;
    }
    if (n == 2)
    {
        cout << "-1\n";
        return;
    }
    int nex = 6;
    vector<int> res{1, 2, 3};

    if (n > 3)
    {
        for (int i = 3; i < n; i++)
        {
            res.push_back(nex);
            nex *= 2;
        }
    }
    for (auto &i : res)
        cout << i << ' ';
    cout << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;

    while (t--)
    {
        solve();
    }
    return 0;
}
