// E. Отрезки с небольшим множеством
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест1024 мегабайта

// Дан массив из n чисел a_i. Скажем, что отрезок этого массива a[l..r] (1 ≤ l ≤ r ≤ n)
// хороший, если на этом отрезке не больше k различных чисел. Ваша задача — найти число
// различных хороших отрезков.

// Входные данные
// Первая строка содержит целые числа n и k (1 ≤ n ≤ 10^5, 0 ≤ k ≤ n). Вторая строка
// содержит числа a_i (1 ≤ a_i ≤ 10^5).

// Выходные данные
// Выведите одно число — число хороших отрезков.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 7 3
// 2 6 4 3 6 8 3
// ======================================================================
// Выходные данные
// ======================================================================
// 20
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long // Защита от переполнения int

int cnt[100001];
int num = 0;

void solve()
{
    int n, k, l = 0, res = 0;
    cin >> n >> k;
    vector<int> a(n);
    for (int i = 0; i < n; i++)
        cin >> a[i];

    for (int r = 0; r < n; r++)
    {
        cnt[a[r]]++;
        if (cnt[a[r]] == 1)
            num++;
        while (num > k)
        {
            cnt[a[l]]--;
            if (cnt[a[l]] == 0)
                num--;
            l++;
        }
        res += r - l + 1;
    }
    cout << res;
}

int32_t main()
{
    // Включаем супер-быстрый ввод-вывод для C++
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
