// A. ЕхАб И нОд
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Вам дано целое положительное число x. Найдите любые два целых положительных числа a и b,
// для которых НОД(a, b) + НОК(a, b) = x.

// Напомним, что НОД(a, b) — это наибольшее целое число, на которое делятся и a, и b.
// Аналогично, НОК(a, b) — это наименьшее целое число, которое делится и на a, и на b.

// Гарантируется, что решение всегда существует. Если существует несколько таких пар (a, b),
// вы можете вывести любую из них.

// Входные данные
// Первая строка содержит одно целое число t (1 ≤ t ≤ 100) — количество наборов тестовых данных.

// Каждый набор тестовых данных состоит из одной строки, содержащей одно целое число x
// (2 ≤ x ≤ 10^9).

// Выходные данные
// Для каждого набора тестовых данных выведите пару целых положительных чисел a и b
// (1 ≤ a, b ≤ 10^9) таких, что НОД(a, b) + НОК(a, b) = x. Гарантируется, что решение
// всегда существует. Если существует несколько таких пар (a, b), вы можете вывести любую из них.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 2
// 2
// 14
// ======================================================================
// Выходные данные
// ======================================================================
// 1 1
// 6 4
// ======================================================================

// Примечание
// В первом наборе тестовых данных примера НОД(1, 1) + НОК(1, 1) = 1 + 1 = 2.

// Во втором наборе тестовых данных примера НОД(6, 4) + НОК(6, 4) = 2 + 12 = 14.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    // Код
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
