// B. Максимальный НОД
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Рассмотрим все целые числа в промежутке от 1 до n (включительно).

// По всем парам различных целых чисел из этого промежутка найдите максимальное
// возможное значение наибольшего общего делителя чисел в паре. Более формально,
// найдите максимальное значение gcd(a, b) по всем 1 ≤ a < b ≤ n.

// Наибольшим общим делителем gcd(a, b) пары положительных целых чисел a и b
// называется наибольшее целое число, являющееся делителем числа a и делителем числа b.

// Входные данные
// В первой строке находится единственное целое число t (1 ≤ t ≤ 100) — количество
// наборов входных данных. Описание наборов входных данных следует.

// В единственной строке описания каждого набора входных данных находится единственное
// целое число n (2 ≤ n ≤ 10^6).

// Выходные данные
// Для каждого набора входных данных выведите максимальное значение gcd(a, b)
// по всем 1 ≤ a < b ≤ n.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 2
// 3
// 5
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 2
// ======================================================================

// Примечание
// В первом наборе входных данных gcd(1, 2) = gcd(2, 3) = gcd(1, 3) = 1.

// Во втором наборе входных данных 2 является максимальным возможным значением,
// соответствующим gcd(2, 4).

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    cout << max(1LL, n / 2) << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}

// 1 2 3 4 5 6 7 8 9 10 11 12 13 14
// 1 1 1 2 2 3 3 4 4 5  5  6  6  7