// C. Проблема Нольдбаха
// ограничение по времени на тест2 seconds
// ограничение по памяти на тест64 megabytes

// Никита интересовался простыми числами, и однажды прочитал о проблеме Гольдбаха.
// Она гласит, что любое чётное число большее 2 можно представить в виде суммы двух
// простых чисел. Никита заинтересовался этим и решил придумать себе на голову
// проблему, и назвал он её проблемой Нольдбаха. Так как он интересовался исключительно
// простыми числами, проблема Нольдбаха гласила, что по крайней мере k простых чисел
// от 2 до n включительно представимо в виде суммы трёх чисел: двух соседних простых
// чисел и 1. Например, 19 = 7 + 11 + 1, или 13 = 5 + 7 + 1.

// Два простых числа называются соседними, если между ними не существует других
// простых чисел.

// Вам предстоит помочь Никите и сказать, прав он или ошибается.

// Входные данные
// В первой и единственной строке входных данных содержится два целых числа n (2 ≤ n ≤ 1000)
// и k (0 ≤ k ≤ 1000).

// Выходные данные
// В единственной строке выходных данных выведите слово YES, если не менее k простых
// чисел в промежутке от 2 до n представимы в виде, описанном выше. В противном случае
// выведите слово NO.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 27 2
// ======================================================================
// Выходные данные
// ======================================================================
// YES

// ======================================================================
// Входные данные
// ======================================================================
// 45 7
// ======================================================================
// Выходные данные
// ======================================================================
// NO
// ======================================================================

// Примечание
// В первом примере ответ YES, так как чисел, которые можно представить в описанном
// виде, не меньше двух (например, 13 и 19). Во втором примере ответ NO, так как
// нельзя представить в искомом виде 7 простых чисел от 2 до 45.

#include <bits/stdc++.h>
using namespace std;

#define int long long

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    int n, k;
    cin >> n >> k;

    vector<bool> prime(1001, true);
    list<int> res;
    list<int> p;

    for (int i = 2; i <= 1000; i++)
    {
        if (!p.empty() && p.back() + i + 1 > n)
            break;

        if (prime[i])
        {
            // cout << i << ' ';
            if (p.empty())
                p.push_back(i);
            else
            {
                res.push_back(p.back() + i + 1);
                p.push_back(i);
            }

            // res.push_back(i);
            for (int j = i * i; j <= 1000; j += i)
                prime[j] = false;
        }
    }
    // for (auto &i : res)
    //     cout << i << ' ';
    // cout << '\n';
    // for (auto &i : p)
    //     cout << i << ' ';
    int count = 0;
    for (auto &i : res)
    {
        if (prime[i])
            count++;
    }
    if (count >= k)
        cout << "YES";
    else
        cout << "NO";

    return 0;
}
