// E. Делимость
// ограничение по времени на тест0.5 секунд
// ограничение по памяти на тест64 мегабайта

// Компания ИТ-града, выпускающая компьютерные игры, придумала новый способ поощрения
// своих сотрудников. Когда случается выпуск новой игры, пользователи начинают активно
// её покупать, а компания отслеживает количество продаж с точностью до каждой
// транзакции. Каждый раз, когда очередное количество продаж делится нацело на все
// числа от 2 до 10, всем разработчикам начисляется небольшая премия.

// Гейм-дизайнер Петя знает, что компания вот-вот выпустит релиз новой игры,
// в разработке которой он участвовал. На основании прошлого опыта он прогнозирует,
// что в течение месяца игру купят n человек. Теперь Петя хочет определить, сколько
// раз ему будет начислена премия. Помогите ему это узнать.

// Входные данные
// Единственная строка входных данных содержит одно целое число n (1 ≤ n ≤ 10^18) —
// прогноз на количество человек, которые купят игру.

// Выходные данные
// Выведите одно целое число — количество чисел от 1 до n, делящихся на все числа
// от 2 до 10.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 3000
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    const int NUM = 5 * 7 * 8 * 9;
    int n;
    cin >> n;
    cout << n / NUM;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
