// I. Простые на отрезке
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Вы решили провести небольшое исследование в области теории простых чисел.
// Напомним, что простое число — это целое положительное число, имеющее ровно два
// различных целых положительных делителя.

// Рассмотрим целые положительные числа a, a + 1, …, b (a ≤ b). Вы хотите найти
// наименьшее целое число l (1 ≤ l ≤ b − a + 1) такое, что для любого целого x
// (a ≤ x ≤ b − l + 1) среди l целых чисел x, x + 1, …, x + l − 1 найдётся
// не менее k простых чисел.

// Найдите и выведите искомое наименьшее l. Если никакое значение l не подходит
// под описанные ограничения, выведите −1.

// Входные данные
// В единственной строке через пробел записаны три целых числа a, b, k
// (1 ≤ a, b, k ≤ 10^6; a ≤ b).

// Выходные данные
// В единственной строке выведите единственное целое число — искомое наименьшее l.
// Если решения не существует, выведите −1.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 2 4 2
// ======================================================================
// Выходные данные
// ======================================================================
// 3

// ======================================================================
// Входные данные
// ======================================================================
// 6 13 1
// ======================================================================
// Выходные данные
// ======================================================================
// 4

// ======================================================================
// Входные данные
// ======================================================================
// 1 4 3
// ======================================================================
// Выходные данные
// ======================================================================
// -1
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

bool check(vector<int> &pref, int l, int a, int b, int k)
{
    for (int i = a; i <= b - l + 1; i++)
    {
        if (pref[i + l - 1] - pref[i - 1] < k)
            return false;
    }
    return true;
}

void solve()
{
    const int primes_n = 1e6;
    int a, b, k;
    cin >> a >> b >> k;
    vector<bool> primes(primes_n + 1, true);
    vector<int> pref(primes_n + 1, 0);
    primes[0] = false;
    primes[1] = false;
    for (int i = 2; i * i <= primes_n; i++)
    {
        if (primes[i])
            for (int j = i * i; j <= primes_n; j += i)
                primes[j] = false;
    }

    for (int i = 1; i <= primes_n; i++)
        pref[i] = pref[i - 1] + (primes[i] ? 1 : 0);

    // for (int i = 1; i <= 10; i++)
    //     cout << pref[i] << ' ';

    // int res = -1, local_count = 0, step = 0;
    if (pref[b] - pref[a - 1] < k)
    {
        cout << "-1";
        return;
    }
    int l = 1, r = b - a + 1;

    while (r > l + 1)
    {
        int m = (l + r) / 2;
        if (check(pref, m, a, b, k))
            r = m;
        else
            l = m;
    }
    cout << r;

    // for (int i = a; i <= b; ++i)
    // {
    //     if (primes[i])
    //         local_count++;
    //     step++;
    //     if (local_count >= k)
    //     {
    //         res = max(res, step);
    //         step = 0;
    //         local_count = 0;
    //     }
    // }
    // cout << res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
