// C. K имеет значение
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Дан массив a, состоящий из n целых положительных чисел, а также целочисленный
// параметр k.

// Пока в массиве не менее k элементов, необходимо выполнять одну из следующих операций
// двух типов над a:

// - Удалить a_k и прибавить его значение к счёту, или
// - удалить a_{m−k+1} и прибавить его значение к счёту, где m — длина a до выполнения
//   этой операции.

// После удаления элемента оставшиеся элементы сохраняют свой относительный порядок.

// Определите максимально возможный счёт, который можно получить.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 10^4) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// Первая строка каждого набора входных данных содержит два целых числа n и k
// (1 ≤ k ≤ n ≤ 10^5) — длину a и параметр соответственно.

// Вторая строка содержит n целых чисел a_i (1 ≤ a_i ≤ 10^9) — элементы a.

// Гарантируется, что сумма значений n по всем наборам входных данных не превышает 10^5.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — максимальный счёт,
// который можно получить.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 4 2
// 1 2 3 4
// 4 4
// 3 4 1 2
// 1 1
// 1
// 6 3
// 1 4 8 2 6 3
// ======================================================================
// Выходные данные
// ======================================================================
// 9
// 3
// 1
// 19
// ======================================================================

// Примечание
// В первом наборе входных данных сначала можно удалить a3 = 3. Счёт становится равен 3,
// а массив принимает вид [1, 2, 4]. Затем удалим a2 = 2, после чего счёт станет равен 5,
// а массив примет вид [1, 4]. Наконец, удалим a2 = 4, и счёт станет равен 9. Теперь
// длина массива меньше k = 2, поэтому выполнить ещё одну операцию невозможно. Можно
// доказать, что максимальный счёт равен 9.

// Во втором наборе входных данных можно выполнить только одну операцию: удалить либо
// a1 = 3, либо a4 = 2. Очевидно, что лучше удалить a1 = 3 и получить счёт 3.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, k;
    cin >> n >> k;
    vector<int> a(n + 1);
    for (int i = 1; i <= n; i++)
        cin >> a[i];

    int K = k - 1;
    int q = n - k + 1; // = n - K
    int ans = 0;

    if (n > 2 * K)
    {
        for (int i = K + 1; i <= n - K; i++)
        {
            ans += a[i];
        }
        for (int i = 1; i <= K; i++)
        {
            int left = K - i + 1;
            int right = n - K + i;
            ans += max(a[left], a[right]);
        }
    }
    else
    {
        for (int i = 1; i <= q; i++)
        {
            int left = K + i;
            int right = q - i + 1;
            ans += max(a[left], a[right]);
        }
    }

    cout << ans << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}