// A. Три числа на доске
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// На улице идёт дождь, поэтому Ктолли, Нефрен и Итея проводят день, играя в игру
// в гостиной.

// Итея записывает на доске три целых неотрицательных числа a, b и c.

// Ктолли может выполнить следующую операцию произвольное количество раз (в том числе ноль):

// - Выбрать одно из трёх текущих чисел и заменить его суммой остальных двух текущих чисел.
//   Два других числа остаются неизменными.

// Например, начиная с (3, 5, 11), она может заменить 11 на 3 + 5, получив (3, 5, 8).

// Нефрен хочет узнать минимальный диапазон* трёх чисел, который может получить Ктолли.
// Помогите ей его найти!

// * Диапазон непустого конечного набора чисел определяется как его максимальное значение
// минус его минимальное значение. В частности, диапазон трёх чисел x, y и z равен
// max(x, y, z) − min(x, y, z).

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 100) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// Единственная строка каждого набора входных данных содержит три целых числа a, b и c
// (0 ≤ a, b, c ≤ 10^9) — числа, изначально написанные на доске.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — минимально возможный
// диапазон трёх итоговых чисел.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 5 5 5
// 4 6 9
// 2 3 10
// 0 0 7
// 2 3 5
// 20 4 5
// ======================================================================
// Выходные данные
// ======================================================================
// 0
// 5
// 3
// 0
// 3
// 5
// ======================================================================

// Примечание
// В первом наборе входных данных все три числа уже равны, поэтому их диапазон равен 0.

// Во втором наборе входных данных при отсутствии каких-либо операций диапазон равен
// 9 − 4 = 5. Можно показать, что никакая последовательность операций не может дать
// меньший диапазон.

// В третьем наборе входных данных Ктолли может заменить 10 на 2 + 3 = 5. Три числа
// становятся (2, 3, 5), их диапазон равен 5 − 2 = 3.

// В четвёртом наборе входных данных Ктолли может заменить 7 на 0 + 0 = 0. Тогда все
// три числа становятся равными 0.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    const int n = 3;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;
    sort(a.begin(), a.end());
    int res = a[2] - a[0];
    a[n - 1] = a[0] + a[1];
    sort(a.begin(), a.end());
    cout << min(a[2] - a[0], res) << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
