// B. Плитки домино
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Найгглато возвращается с рынка со старой коробкой плиток, надписи на которых уже
// начали стираться. Ктолли и молодые феи тут же разложили плитки по обеденному столу
// и превратили их в головоломку.

// Есть ряд из n плиток. Каждая плитка должна быть помечена либо знаком 0, либо знаком 1.
// Однако некоторые знаки стёрлись.

// Текущий ряд представлен строкой s длиной n. Каждый символ строки s — это 0, 1 или ?.
// Ктолли должна заменить каждый символ ? на 0 или 1.

// После замены для каждого 1 ≤ i < n две соседние плитки s_i и s_{i+1} образуют домино
// веса (s_i + s_{i+1}). Заметим, что два последовательных домино имеют ровно одну
// общую плитку. Завершённый ряд является допустимым, если каждые два подряд идущих
// домино имеют различный вес.

// Определите количество различных* способов замены всех символов ? таким образом,
// чтобы завершённая строка была допустимой. Выведите ответ по модулю 998244353.

// * Два способа замены считаются различными, если результирующие строки различаются.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 10^4) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// В первой строке каждого набора входных данных содержится одно целое число n
// (2 ≤ n ≤ 2·10^5) — количество плиток.

// Во второй строке содержится строка s длиной n, где s_i = 0, 1 или ?.

// Гарантируется, что сумма значений n по всем наборам входных данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — количество допустимых
// способов замены всех символов ?, по модулю 998244353.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 2
// ??
// 5
// 0?1??
// 5
// 0?0??
// 8
// 00110011
// ======================================================================
// Выходные данные
// ======================================================================
// 4
// 2
// 0
// 1
// ======================================================================

// Примечание
// В первом наборе входных данных имеется только одно домино, поэтому любое завершение
// является допустимым. Допустимые завершённые строки: 00, 01, 10 и 11.

// Во втором наборе входных данных допустимые завершённые строки: 00110 и 01100.

// В третьем наборе входных данных допустимых завершённых строк нет.

// В четвёртом наборе входных данных единственной допустимой завершённой строкой
// является 00110011.

#include <bits/stdc++.h>
using namespace std;

#define int long long

bool check(int c1, int c2, int c3)
{
    if (c1 == 0 && c2 == 0 && c3 == 0)
        return false;
    if (c1 == 1 && c2 == 1 && c3 == 1)
        return false;
    if (c1 == 0 && c2 == 1 && c3 == 0)
        return false;
    if (c1 == 1 && c2 == 0 && c3 == 1)
        return false;
    return true;
}

void solve()
{
    const int MOD = 998244353;
    int n;
    cin >> n;
    string s;
    cin >> s;
    vector<vector<vector<int>>> dp(n, vector<vector<int>>(2, vector<int>(2)));
    // dp - cur - last - prev last
    for (int c1 = 0; c1 < 2; c1++)
    {
        for (int c2 = 0; c2 < 2; c2++)
        {
            bool ok1 = (s[0] == '?' || (s[0] - '0') == c1);
            bool ok2 = (s[1] == '?' || (s[1] - '0') == c2);
            if (ok1 && ok2)
                dp[1][c2][c1] = 1;
        }
    }

    for (int i = 2; i < n; i++)
    {
        for (int c3 = 0; c3 < 2; c3++)
        {
            if (s[i] != '?' && (s[i] - '0') != c3)
                continue;
            for (int c1 = 0; c1 < 2; c1++)
                for (int c2 = 0; c2 < 2; c2++)
                    if (check(c1, c2, c3))
                        dp[i][c3][c2] = (dp[i][c3][c2] + dp[i - 1][c2][c1]) % MOD;
        }
    }
    int res = 0;
    for (int c1 = 0; c1 < 2; c1++)
        for (int c2 = 0; c2 < 2; c2++)
            res = (res + dp[n - 1][c2][c1]) % MOD;

    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
