// B. Общая длина
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест1024 мегабайта

// Дан массив из n чисел a_i. Скажем, что отрезок этого массива a[l..r] (1 ≤ l ≤ r ≤ n)
// хороший, если сумма чисел на этом отрезке не больше s. Ваша задача — найти сумму
// длин всех хороших отрезков.

// Входные данные
// Первая строка содержит целые числа n и s (1 ≤ n ≤ 10^5, 1 ≤ s ≤ 10^18). Вторая строка
// содержит числа a_i (1 ≤ a_i ≤ 10^9).

// Выходные данные
// Выведите одно число — сумму длин всех хороших отрезков.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 7 20
// 2 6 4 3 6 8 9
// ======================================================================
// Выходные данные
// ======================================================================
// 39
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long // Защита от переполнения int

void solve()
{
    int n, s;
    cin >> n >> s;
    vector<int> a(n);
    for (int i = 0; i < n; i++)
        cin >> a[i];

    int l = 0, res = 0, cur_sum = 0;
    for (int r = 0; r < n; r++)
    {
        cur_sum += a[r];
        while (cur_sum > s)
        {
            cur_sum -= a[l];
            l++;
        }
        int k = r - l + 1;
        res += (k * (k + 1)) / 2;
    }

    cout << res;
}

int32_t main()
{
    // Включаем супер-быстрый ввод-вывод для C++
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
