// G. Не очень грубая подстрока
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Дана строка s, состоящая из n строчных латинских букв.

// Грубостью строки t длины k назовём количество пар целых чисел (i, j), где 1 ≤ i < j ≤ k,
// для которых t_i = «a» и t_j = «b». Иными словами, грубость строки — это количество
// способов вычеркнуть все её символы, кроме двух, так, чтобы осталась строка «ab».

// Ваша задача — найти подстроку s_l s_{l+1} … s_r, грубость которой не превышает c,
// максимальной длины.

// Входные данные
// Первая строка входных данных содержит два целых числа n и c (1 ≤ n ≤ 10^6, 0 ≤ c ≤ 10^18).

// Вторая строка содержит строку s. Строка состоит из n строчных латинских букв.

// Выходные данные
// Выведите единственное число — максимальную длину подстроки строки, которая имеет
// грубость не более c.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 3 1
// aab
// ======================================================================
// Выходные данные
// ======================================================================
// 2

// ======================================================================
// Входные данные
// ======================================================================
// 6 2
// aabcbb
// ======================================================================
// Выходные данные
// ======================================================================
// 4
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long // Защита от переполнения int

void solve()
{
    int n, c;
    cin >> n >> c;
    string s;
    cin >> s;

    int l = 0, res = 0, cur_a = 0, cur_b = 0, cur_t = 0;
    for (int r = 0; r < n; r++)
    {
        cur_a += s[r] == 'a' ? 1 : 0;
        if (s[r] == 'b')
        {
            cur_b++;
            cur_t += cur_a;
        }

        while (cur_t > c)
        {
            cur_b -= s[l] == 'b' ? 1 : 0;
            if (s[l] == 'a')
            {
                cur_a--;
                cur_t -= cur_b;
            }
            l++;
        }
        res = max(res, r - l + 1);
    }
    std::cout << res;
}

int32_t main()
{
    // Включаем супер-быстрый ввод-вывод для C++
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
