// I. Отрезок с нужным подмножеством
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест1024 мегабайта

// Дан массив из n чисел a_i. Скажем, что отрезок этого массива a[l..r] (1 ≤ l ≤ r ≤ n)
// хороший, если на этом отрезке можно выбрать некоторый набор чисел, сумма которых
// равна s. Ваша задача — найти самый короткий хороший отрезок.

// Входные данные
// Первая строка содержит целые числа n и s (1 ≤ n ≤ 10^5, 1 ≤ s ≤ 1000). Вторая строка
// содержит числа a_i (1 ≤ a_i ≤ s).

// Выходные данные
// Выведите одно число — минимальную длину хорошего отрезка. Если хорошего отрезка
// не существует, выведите −1.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 10 100
// 14 33 22 21 11 5 13 28 61 2
// ======================================================================
// Выходные данные
// ======================================================================
// 5
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, s, res = 2e18;
    cin >> n >> s;
    vector<int> a(n), dp(s + 1, -1);
    for (int i = 0; i < n; i++)
        cin >> a[i];

    dp[0] = 0;
    for (int r = 0; r < n; r++)
    {
        for (int i = s; i >= a[r]; i--)
            if (dp[i - a[r]] != -1)
                dp[i] = max(dp[i], dp[i - a[r]]);

        dp[a[r]] = max(dp[a[r]], r);

        if (dp[s] != -1)
            res = min(res, r - dp[s] + 1);
    }

    if (res > n)
        cout << -1;
    else
        cout << res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
