// A. Игра минимумов и максимумов
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Бесси и Элси играют в игру на бинарном массиве a длины n.

// Игроки ходят по очереди, первой ходит Бесси. В свой ход Бесси выбирает два соседних
// элемента x и y и заменяет их одним значением max(x, y).

// В свой ход Элси выбирает два соседних элемента x и y и заменяет их одним значением
// min(x, y).

// После каждого хода длина массива уменьшается на 1. Игра заканчивается, когда
// остаётся только один элемент. Бесси побеждает, если последний элемент равен 1,
// а Элси побеждает, если последний элемент равен 0.

// Определите, кто победит, если оба игрока действуют оптимально.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 500) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// В первой строке каждого набора входных данных содержится одно целое число n
// (2 ≤ n ≤ 100).

// Во второй строке каждого набора входных данных содержатся n целых чисел
// a1, a2, …, a_n (0 ≤ a_i ≤ 1).

// Выходные данные
// Для каждого набора входных данных выведите в отдельной строке имя победителя.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 3
// 5
// 1 0 1 0 1
// 3
// 0 0 1
// 4
// 1 1 0 0
// ======================================================================
// Выходные данные
// ======================================================================
// Bessie
// Elsie
// Bessie
// ======================================================================

// Примечание
// В первом наборе входных данных Бесси может гарантировать себе победу. Один из
// возможных вариантов игры имеет следующий вид:
// [1, 0, 1, 0, 1] → [1, 1, 0, 1] → [1, 0, 1] → [1, 1] → [1].
// Последнее значение равно 1, поэтому Бесси побеждает (красным выделены два соседних
// элемента, выбранные на соответствующем ходу).

// Во втором наборе входных данных, какой бы ход ни сделала Бесси, Элси может сделать
// последнее значение равным 0. Поэтому побеждает Элси.

// В третьем наборе входных данных один из возможных выигрышных вариантов игры для
// Бесси имеет следующий вид:
// [1, 1, 0, 0] → [1, 1, 0] → [1, 0] → [1].
// Последнее значение равно 1, поэтому Бесси побеждает.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, cnt0 = 0, cnt1 = 0;
    cin >> n;
    for (int i = 0; i < n; i++)
    {
        int val;
        cin >> val;
        cnt1 += val;
        cnt0 += !val;
    }
    if (cnt1 >= cnt0)
        cout << "Bessie\n";
    else
        cout << "Elsie\n";
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
