// B. Минимумы матриц
// ограничение по времени на тест1.5 секунд
// ограничение по памяти на тест256 мегабайт

// Фермер Джон узнал от Элси, что любимое число Бесси — k, и поэтому хочет удивить её
// подарком, сделанным своими руками.

// Для двумерной матрицы B обозначим через f(B) множество минимумов всех строк и всех
// столбцов матрицы B.

// Фермер Джон просит вас предъявить квадратную матрицу размера n × n, обозначенную A,
// содержащую каждое число от 1 до n^2 ровно один раз, такую, что |f(A)| = k,
// либо сообщить, что это невозможно.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 1000) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// В первой строке каждого набора входных данных содержатся два целых числа n и k
// (1 ≤ n ≤ 1000, 0 ≤ k ≤ 2n) — размер матрицы и требуемое значение |f(A)|.

// Гарантируется, что сумма значений n по всем наборам входных данных не превышает 1000.

// Выходные данные
// Если такой матрицы не существует, выведите −1. В противном случае выведите n строк
// по n целых чисел в каждой — матрицу размера n × n, удовлетворяющую условиям задачи.

// Если существует несколько решений, можно вывести любое из них.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 3 0
// 3 5
// 5 5
// 4 3
// 1 1
// ======================================================================
// Выходные данные
// ======================================================================
// -1
// 8 5 9
// 6 3 7
// 2 1 4
// 16 14 17 15 3
// 25 22 5 23 24
// 8 1 9 6 7
// 4 18 21 19 20
// 12 10 13 2 11
// -1
// 1
// ======================================================================

// Примечание
// В первом наборе входных данных можно заметить, что невозможно построить такую
// матрицу размера 3 × 3, для которой f(A) пусто.

// В третьем наборе входных данных минимумы строк равны [5, 3, 1] соответственно,
// а минимумы столбцов равны [2, 1, 4] соответственно. Следовательно,
// f(A) = {1, 2, 3, 4, 5}, поэтому требуемое равенство |f(A)| = 5 выполняется.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, k;
    cin >> n >> k;
    vector<vector<int>> a(n, vector<int>(n, -1));

    if (k < n || k >= 2 * n)
    {
        cout << "-1\n";
        return;
    }

    int curnum = 1, rem = k - n;
    // a[0][0] = curnum++;
    for (int i = 0; i < n; i++)
    {
        int col = (i + rem) % n;
        a[i][col] = curnum++;
        rem = max(rem - 1, 0LL);
    }

    for (int i = 0; i < n; i++)
        for (int j = 0; j < n; j++)
            if (a[i][j] == -1)
                a[i][j] = curnum++;
    for (auto &i : a)
    {
        for (auto j : i)
            cout << j << ' ';
        cout << '\n';
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
