// D. Игра на выбывание
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Бесси снимает шоу под названием Мудзюцу Коусен. Для одного из выпусков она приглашает
// n волшебников и выстраивает их в ряд слева направо. Изначальный уровень мастерства
// i-го волшебника равен a_i.

// Волшебники участвуют в турнире по системе «царь горы». Самый левый из оставшихся
// волшебников становится первым чемпионом, а его текущий уровень мастерства равен
// изначальному.

// Затем чемпион по очереди встречается с каждым из оставшихся волшебников справа
// от него. Пусть текущий уровень мастерства чемпиона равен s, а уровень следующего
// волшебника — x.

// - Если s < x, чемпион отказывается от боя. Следующий волшебник становится новым
//   чемпионом с уровнем мастерства x.
// - В противном случае чемпион вступает в бой и побеждает (при s = x чемпион также
//   побеждает). В этом случае текущий уровень мастерства чемпиона становится равен s + x.

// Бесси считает отказы от боя скучными, поэтому перед началом турнира она может убрать
// нескольких волшебников из строя.

// Дана перестановка p1, p2, …, p_n целых чисел от 1 до n. Для каждого 0 ≤ i ≤ n − 1
// Бесси убирает из строя волшебников p1, p2, …, p_i. Если i = 0, ни один волшебник
// не убирается. Относительный порядок всех оставшихся волшебников не изменяется.

// Для каждого такого i определите, сколько отказов от боя произойдёт, если Бесси
// проведёт турнир только среди оставшихся волшебников.

// Входные данные
// Каждый тест состоит из нескольких наборов входных данных. В первой строке находится
// одно целое число t (1 ≤ t ≤ 10^4) — количество наборов входных данных. Далее следует
// описание наборов входных данных.

// В первой строке каждого набора входных данных содержится одно целое число n
// (1 ≤ n ≤ 2·10^5).

// Во второй строке каждого набора входных данных содержатся n целых чисел
// a1, a2, …, a_n (1 ≤ a_i ≤ 10^9).

// В третьей строке каждого набора входных данных содержится перестановка
// p1, p2, …, p_n целых чисел от 1 до n.

// Гарантируется, что сумма значений n по всем наборам входных данных не превосходит
// 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите n целых чисел.

// i-е число должно быть равно количеству отказов от боя после удаления волшебников
// p1, p2, …, p_{i−1}.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 3
// 4
// 1 2 4 3
// 1 2 3 4
// 5
// 3 1 7 2 6
// 3 1 5 2 4
// 6
// 10 1 2 20 3 4
// 4 1 2 3 5 6
// ======================================================================
// Выходные данные
// ======================================================================
// 2 1 0 0
// 1 0 2 1 0
// 1 0 3 2 1 0
// ======================================================================

// Примечание
// В первом наборе входных данных ответы равны 2, 1, 0, 0.

// До каких-либо удалений массив имеет вид [1, 2, 4, 3]. Чемпион с уровнем мастерства 1
// отказывается от боя с волшебником уровня 2, а затем чемпион с уровнем мастерства 2
// отказывается от боя с волшебником уровня 4. Чемпион с уровнем мастерства 4 побеждает
// волшебника уровня 3, поэтому происходит 2 отказа от боя.

// После удаления волшебника 1 остаётся массив [2, 4, 3]. Чемпион с уровнем мастерства 2
// отказывается от боя с волшебником уровня 4, а затем чемпион с уровнем мастерства 4
// побеждает волшебника уровня 3, поэтому происходит 1 отказ от боя.

// После удаления волшебников 1 и 2 остаётся массив [4, 3]. Чемпион побеждает
// единственного оставшегося волшебника, поэтому происходит 0 отказов от боя.
// После удаления волшебников 1, 2 и 3 остаётся только один волшебник, поэтому также
// происходит 0 отказов от боя.

// Во втором наборе входных данных ответы равны 1, 0, 2, 1, 0.

// До каких-либо удалений массив имеет вид [3, 1, 7, 2, 6]. Чемпион с уровнем мастерства 3
// побеждает волшебника уровня 1 и получает одно очко мастерства, а затем отказывается
// от боя с волшебником уровня 7. После этого чемпион побеждает волшебников уровней 2
// и 6, поэтому происходит 1 отказ от боя.

// После удаления волшебника 3, уровень мастерства которого равен 7, остаётся массив
// [3, 1, 2, 6]. Чемпион побеждает каждого оставшегося волшебника, поэтому происходит
// 0 отказов от боя.

// После удаления также волшебника 1 остаётся массив [1, 2, 6]. Чемпион с уровнем
// мастерства 1 отказывается от боя с волшебником уровня 2, а затем чемпион с уровнем
// мастерства 2 отказывается от боя с волшебником уровня 6, поэтому происходит 2 отказа
// от боя.

// После удаления также волшебника 5 остаётся массив [1, 2]. Происходит 1 отказ от боя.
// Наконец, после удаления также волшебника 2 остаётся только один волшебник, поэтому
// происходит 0 отказов от боя.

#include <bits/stdc++.h>
using namespace std;

#define int long long

struct Node
{
    int value;
};

struct SegTree
{
    int getlrS(int l, int r) { return getlrS(l, r, 0, 0, size).value; }

    void set(int v, int i) { set(v, i, 0, 0, size); }

    void build(vector<int> &a, int n)
    {
        init(n);
        build(a, 0, 0, size);
    }

private:
    vector<Node> tree;
    int size = 1;

    const Node NULLNODE = {0};

    Node combine(const Node &l, const Node &r)
    {
        Node res;
        res.value = l.value + r.value;
        return res;
    }

    Node setNodeVal(int x)
    {
        Node res;
        res.value = x;
        return res;
    }

    void init(int n_size)
    {
        size = 1;
        while (size < n_size)
            size *= 2;
        tree.assign(2 * size - 1, NULLNODE);
    }

    void build(vector<int> &a, int x, int lx, int rx)
    {
        if (rx - lx == 1)
        {
            if (lx < a.size())
                tree[x] = setNodeVal(a[lx]);
        }
        else
        {
            int m = (lx + rx) / 2;
            build(a, 2 * x + 1, lx, m);
            build(a, 2 * x + 2, m, rx);
            tree[x] = combine(tree[2 * x + 1], tree[2 * x + 2]);
        }
    }

    void set(int value, int index, int x, int lx, int rx)
    {
        if (rx - lx == 1)
        {
            tree[x] = setNodeVal(value);
            return;
        }
        int m = (lx + rx) / 2;
        if (index < m)
            set(value, index, 2 * x + 1, lx, m);
        else
            set(value, index, 2 * x + 2, m, rx);
        tree[x] = combine(tree[2 * x + 1], tree[2 * x + 2]);
    }

    Node getlrS(int l, int r, int x, int lx, int rx)
    {
        if (lx >= l && rx <= r)
            return tree[x];
        if (lx >= r || l >= rx)
            return NULLNODE;
        int m = (lx + rx) / 2;
        Node n1 = getlrS(l, r, 2 * x + 1, lx, m), n2 = getlrS(l, r, 2 * x + 2, m, rx);
        return combine(n1, n2);
    }
};

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n), p(n);
    for (auto &i : a)
        cin >> i;
    for (auto &i : p)
        cin >> i;

    vector<int> res(n);

    vector<int> zeros(n, 0);
    SegTree st;
    st.build(zeros, n);

    set<int> ali;
    set<int> starts;

    for (int i = n - 1; i >= 0; i--)
    {
        int newi = p[i] - 1;
        ali.insert(newi);
        st.set(a[newi], newi);

        int cur;

        auto it = ali.find(newi);
        if (it == ali.begin())
        {
            starts.insert(newi);
            cur = newi;
        }
        else
        {
            int left = *prev(it);
            auto itg = starts.upper_bound(left);
            --itg;
            int gs = *itg;

            int before = st.getlrS(gs, newi);

            if (a[newi] <= before)
            {
                cur = gs;
            }
            else
            {
                starts.insert(newi);
                cur = newi;
            }
        }

        while (1)
        {
            auto itn = starts.upper_bound(cur);
            if (itn == starts.end())
                break;
            int nxt = *itn;
            int curs = st.getlrS(cur, nxt);
            if (a[nxt] <= curs)
            {
                starts.erase(itn);
            }
            else
            {
                break;
            }
        }

        res[i] = (int)starts.size() - 1;
    }

    for (int i = 0; i < n; i++)
        cout << res[i] << ' ';
    cout << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}