// A. Среднее арифметическое цифр
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест64 мегабайта

// Дано четырёхзначное число n. Найдите среднее арифметическое его цифр.

// Входные данные
// Одно целое четырёхзначное число n (1000 ≤ n ≤ 9999).

// Выходные данные
// Одно действительное число — среднее арифметическое цифр числа n.
// Результат выведите с двумя знаками после запятой.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 1234
// ======================================================================
// Выходные данные
// ======================================================================
// 2.50

// ======================================================================
// Входные данные
// ======================================================================
// 3149
// ======================================================================
// Выходные данные
// ======================================================================
// 4.25
// ======================================================================

#include <bits/stdc++.h> // Подключает сразу все библиотеки C++
using namespace std;

#define int long long // Защита от переполнения int (из-за этого часто горят баллы)

void solve()
{
    string s;
    cin >> s;
    double res = 0;
    for (int i = 0; i < s.length(); i++)
    {
        res += s[i] - '0';
    }
    cout << fixed << setprecision(2) << res / s.length();
}

int32_t main()
{
    // Включаем супер-быстрый ввод-вывод для C++
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
