// A. Количество вершин
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Вам задано целое неотрицательное число m. Выведите минимальное количество вершин
// неориентированного графа, который может иметь ровно m рёбер.

// Входные данные
// В первой строке находится целое число t (1 ≤ t ≤ 10^5) — количество наборов
// входных данных в тесте. Далее следуют t наборов входных данных.

// Каждый набор входных данных состоит из одной строки, в которой записано целое
// число m (0 ≤ m ≤ 10^9).

// Выходные данные
// Для каждого набора входных данных в отдельной строке выведите минимальное
// количество вершин неориентированного графа, который может иметь ровно m рёбер.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 1
// 10
// 54
// 1241
// 914890921
// 1000000000
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// 5
// 11
// 51
// 42777
// 44722
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int m;
    cin >> m;
    int l = 0, r = m * 2 + 1;
    while (r > l + 1)
    {
        int n = (l + r) / 2;
        if (n * (n - 1) >= m * 2)
            r = n;
        else
            l = n;
    }
    cout << r << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
