// B. Регулярный граф
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Вам заданы два целых числа n и k. Постройте k-регулярный неориентированный граф
// из n вершин или укажите, что его не существует.

// Входные данные
// В первой строке находится целое число t (1 ≤ t ≤ 1000) — количество наборов
// тестовых данных в тесте. Далее следуют t наборов тестовых данных.

// Каждый набор тестовых данных состоит из одной строки, в которой записаны два
// целых числа n и k (1 ≤ n, k ≤ 200).

// Сумма n по всем наборам тестовых данных не превышает 1000.

// Выходные данные
// Для каждого набора тестовых данных выведите:

// - «YES» — если существует k-регулярный неориентированный граф из n вершин.
//   В следующей строке выведите количество рёбер в графе и в следующих m строках
//   сам граф в виде множества рёбер.
//   Каждое ребро должно быть выведено в отдельной строке, как пара из двух чисел,
//   записанных через пробел — номеров вершин на концах ребра.

// - «NO» — в противном случае.

// Вершины графа нумеруются с единицы.

// Если существует несколько решений, выведите любое.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 3
// 3 2
// 5 3
// 5 4
// ======================================================================
// Выходные данные
// ======================================================================
// YES
// 3
// 1 2
// 2 3
// 3 1
// NO
// YES
// 10
// 1 2
// 1 3
// 2 3
// 2 4
// 3 4
// 3 5
// 4 5
// 4 1
// 5 1
// 5 2
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, k;
    cin >> n >> k;
    if (k >= n)
    {
        cout << "NO\n";
        return;
    }
    vector<pair<int, int>> a(n);
    for (int i = 0; i < n; i++)
    {
        a[i].first = k;      // степень узла
        a[i].second = i + 1; // номер узла
    }
    vector<pair<int, int>> res;
    for (int i = 0; i < n; i++)
    {
        sort(a.begin(), a.end(), [](pair<int, int> a, pair<int, int> b)
             { return a.first > b.first; });

        int t1 = a[0].first;
        int t2 = a[0].second;
        a[0].first = 0;
        if (t1 == 0)
            break;
        for (int j = 1; j <= t1; j++)
        {
            if (a[j].first == 0)
            {
                cout << "NO\n";
                return;
            }
            a[j].first--;
            res.push_back({t2, a[j].second});
        }
    }
    cout << "YES\n";
    cout << res.size() << '\n';
    for (auto i : res)
        cout << i.first << ' ' << i.second << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
