// C. Пустой и полный
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Вам задан неориентированный граф списком его рёбер. Проверьте, что заданный граф
// является объединением не более одного пустого и не более одного полного графов.

// Входные данные
// В первой строке находится целое число t (1 ≤ t ≤ 10^5) — количество наборов
// входных данных в тесте. Далее следуют t наборов входных данных. Перед каждым
// набором входных данных записана пустая строка.

// В первой строке каждого набора содержатся два целых числа n и m (1 ≤ n ≤ 10^5,
// 0 ≤ m ≤ 10^5), где n — количество вершин в графе, m — количество рёбер в графе.

// В следующих m строках записаны рёбра, по одному ребру в строке. Каждое ребро
// характеризуется двумя целыми числами u и v (1 ≤ u, v ≤ n), где u — начало ребра,
// а v — конец ребра.

// В графе отсутствуют петли и кратные рёбра.

// Суммы n и m по всем наборам входных данных в одном тесте не превосходят 10^5.

// Выходные данные
// Для каждого набора входных данных в отдельной строке выведите:

// - «YES» — если заданный граф является объединением не более одного пустого
//   и не более одного полного графов;
// - «NO» — в противном случае.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 2

// 4 3
// 2 3
// 2 4
// 3 4

// 4 3
// 1 2
// 2 3
// 3 4
// ======================================================================
// Выходные данные
// ======================================================================
// YES
// NO
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, m;
    cin >> n >> m;
    vector<int> a(n, 0);
    for (int i = 0; i < m; i++)
    {
        int u, v;
        cin >> u >> v;
        a[u - 1]++;
        a[v - 1]++;
    }
    int zer = 0, ano = 0;
    for (auto i : a)
    {
        if (i == 0)
            zer++;
    }
    int k = n - zer;
    for (auto i : a)
        if (i == k - 1)
            ano++;
    if (k == ano)
        cout << "YES\n";
    else
        cout << "NO\n";
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
