// D. Полные компоненты
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вам дан неориентированный граф, состоящий из n вершин и m рёбер. Каждая компонента
// связности данного графа является полным подграфом. Найдите количество компонент
// связности в данном графе.

// Входные данные
// В первой строке находится целое число t (1 ≤ t ≤ 10^5) — количество наборов
// входных данных в тесте. Далее следуют t наборов входных данных. Перед каждым
// набором входных данных записана пустая строка.

// В первой строке каждого набора находятся два целых числа n и m (1 ≤ n ≤ 10^5,
// 0 ≤ m ≤ 10^5), где n — количество вершин в графе, m — количество рёбер в графе.

// В следующих m строках записаны рёбра, по одному ребру в строке. Каждое ребро
// характеризуется двумя целыми числами u и v (1 ≤ u, v ≤ n), где u — начало ребра,
// а v — конец ребра.

// В графе отсутствуют петли и кратные рёбра.

// Суммы n и m по всем наборам входных данных не превышают 10^5.

// Выходные данные
// Для каждого набора входных данных выведите количество компонент связности
// в соответствующем графе.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 3

// 1 0

// 3 1
// 1 3

// 4 2
// 1 2
// 3 4
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 2
// 2
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, m;
    cin >> n >> m;
    vector<int> a(n, 0);
    while (m--)
    {
        int u, v;
        cin >> u >> v;
        a[u - 1]++;
        a[v - 1]++;
    }
    double res = 0;
    for (auto i : a)
        res += 1.0 / (i + 1);
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
