// A01. Треугольник Паскаля
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Дано натуральное число N. Нужно вывести первые N + 1 строк треугольника Паскаля —
// то есть для каждого i (0 ≤ i ≤ N), для каждого j (0 ≤ j ≤ i) нужно вывести число
// сочетаний из i по j. Поскольку числа могут быть довольно большими, нужно выводить
// их по модулю 10^9 + 7.

// Входные данные
// В первой строке задано единственное число N (1 ≤ N ≤ 100).

// Выходные данные
// Вывести N + 1 строк треугольника Паскаля. Числа необходимо выводить по модулю 10^9 + 7.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 2
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 1 1
// 1 2 1

// ======================================================================
// Входные данные
// ======================================================================
// 4
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 1 1
// 1 2 1
// 1 3 3 1
// 1 4 6 4 1
// ======================================================================

#include <bits/stdc++.h>
using namespace std;

#define int long long

const int MOD = 1e9 + 7;

void solve()
{
    int n;
    cin >> n;
    vector<vector<int>> dp(n + 3, vector<int>(n + 3, 0));
    dp[0][0] = 1;
    for (int i = 0; i <= n; i++)
    {
        for (int j = 0; j <= n; j++)
        {
            if (i > 0)
                dp[i][j] = dp[i - 1][j];
            if (j > 0)
                dp[i][j] = max(dp[i][j], dp[i][j - 1]);
            if (j > 0 && i > 0)
                dp[i][j] = max(dp[i][j], dp[i][j - 1] + dp[i - 1][j]);
            dp[i][j] = dp[i][j] % MOD;
        }
    }
    cout << "1\n";
    for (int i = 1; i <= n; i++)
    {
        // if (i > 1)
        cout << "1 ";
        for (int x = 0; x < i; x++)
        {
            for (int y = 0; y < i; y++)
            {
                if (x + y == i)
                    cout << dp[x][y] << ' ';
            }
        }

        cout << "1\n";
    }

    // for (auto &i : dp)
    // {
    //     for (auto &j : i)
    //         cout << j << ' ';
    //     cout << '\n';
    // }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
