// A. Выиграть в лотерею
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// У Аллена много денег, а именно, на счету в банке у него n долларов. По соображениям
// безопасности он хочет снять всю сумму наличными, мы не будем здесь описывать эти
// соображения. Номиналы долларовых купюр равны 1, 5, 10, 20, 100. Какое минимальное
// число купюр должен получить Аллен после того, как снимет все деньги?

// Входные данные
// Первая и единственная строка содержит одно целое число n (1 ≤ n ≤ 10^9).

// Выходные данные
// Выведите минимальное число купюр, которые должен получить Аллен.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 125
// ======================================================================
// Выходные данные
// ======================================================================
// 3

// ======================================================================
// Входные данные
// ======================================================================
// 43
// ======================================================================
// Выходные данные
// ======================================================================
// 5

// ======================================================================
// Входные данные
// ======================================================================
// 1000000000
// ======================================================================
// Выходные данные
// ======================================================================
// 10000000
// ======================================================================

// Примечание
// В первом примере Аллен может получить одну 100-долларовую купюру, одну купюру в 20
// долларов и одну купюру в 5 долларов. Нельзя получить 125 долларов с помощью одной
// или двух купюр.

// Во втором примере Аллен может получить две 20-долларовые купюры и три купюры
// в 1 доллар.

// В третьем примере Аллен может снять 100000000 (десять миллионов!) 100-долларовых
// купюр.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, res = 0;
    cin >> n;
    res += n / 100;
    n -= n / 100 * 100;
    res += n / 20;
    n -= n / 20 * 20;
    res += n / 10;
    n -= n / 10 * 10;
    res += n / 5;
    n -= n / 5 * 5;
    res += n;
    n -= n;
    cout << res;
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
