// C. Лавочки
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// В берляндском парке есть n лавочек. Про каждую лавочку известно количество людей a_i,
// которые уже сидят на i-й лавочке. Известно, что в ближайшее время в парк придут ещё m
// человек, каждый из которых сядет на одну из n лавочек.

// Пусть k — это максимальное количество человек, которые будут сидеть на одной лавочке
// после прихода в парк ещё m человек. Определите минимально возможную величину k
// и максимально возможную величину k.

// Считайте, что никто из посетителей парка не будет вставать с лавочек.

// Входные данные
// В первой строке следует целое число n (1 ≤ n ≤ 100) — количество лавочек в парке.

// Во второй строке следует целое число m (1 ≤ m ≤ 10000) — количество людей, которые
// ещё придут в парк и сядут на лавочки.

// В следующих n строках следует по одному целому числу a_i (1 ≤ a_i ≤ 100) —
// количество людей, которые изначально сидят на i-й лавочке.

// Выходные данные
// Выведите минимально возможную величину k и максимально возможную величину k, где k —
// это максимальное количество человек, которые будут сидеть на одной лавочке после
// прихода в парк ещё m человек.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 4
// 6
// 1
// 1
// 1
// 1
// ======================================================================
// Выходные данные
// ======================================================================
// 3 7

// ======================================================================
// Входные данные
// ======================================================================
// 1
// 10
// 5
// ======================================================================
// Выходные данные
// ======================================================================
// 15 15

// ======================================================================
// Входные данные
// ======================================================================
// 3
// 6
// 1
// 6
// 5
// ======================================================================
// Выходные данные
// ======================================================================
// 6 12

// ======================================================================
// Входные данные
// ======================================================================
// 3
// 7
// 1
// 6
// 5
// ======================================================================
// Выходные данные
// ======================================================================
// 7 13
// ======================================================================

// Примечание
// В первом примере изначально на четырёх лавочках сидят по одному человеку.
// Минимальная величина k равна 3. Для этого нужно, например, чтобы два новых человека
// сели на первую лавочку, один новый человек сел на вторую лавочку, один новый человек
// сел на третью лавочку и два новых человека сели на четвёртую лавочку. Максимальная
// величина k равна 7. Для этого нужно, чтобы все шесть новых человек сели на одну
// и ту же лавочку.

// Во втором примере минимальная величина k равна 15 и максимальная величина k равна 15,
// так как в парке есть всего одна лавочка и все 10 новых человек сядут именно на неё.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, m, x;
    cin >> n >> m >> x;
    set<int> pls;
    pls.insert(x - 1);
    for (int i = 0; i < m; i++)
    {
        int r;
        char t;
        cin >> r >> t;
        set<int> npls;
        for (auto &i : pls)
        {
            if (t == '0' || t == '?')
                npls.insert((i + r) % n);

            if (t == '1' || t == '?')
                npls.insert((i - r + n) % n);
        }
        pls = npls;
    }
    cout << pls.size() << '\n';
    for (auto &i : pls)
        cout << i + 1 << ' ';
    cout << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
