// F. Рудольф и игра с мячом
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Рудольф и Бернард решили сыграть с друзьями в игру. В круг встают n человек
// и начинают бросать друг другу мяч. Они пронумерованы от 1 до n по часовой стрелке.

// Назовём переходом в игре перемещение мяча от некоторого игрока к его соседу.
// Переход может быть выполнен по часовой стрелке или против часовой стрелки.

// Назовём расстоянием по часовой стрелке (против часовой стрелки) от игрока y1
// до игрока y2 число переходов по часовой стрелке (против часовой стрелки),
// которые нужно выполнить, чтобы переместить мяч от игрока y1 к игроку y2.
// Например, если n = 7, тогда расстояние по часовой стрелке от 2 до 5 равно 3,
// а расстояние против часовой стрелки от 2 до 5 равно 4.

// Изначально мяч находится у игрока номер x (нумерация игроков осуществляется
// по часовой стрелке). Во время i-го хода тот, у кого мяч, бросает его на расстояние r_i
// (1 ≤ r_i ≤ n − 1) по или против часовой стрелки. Например, если играет 7 человек,
// и 2-й игрок, получив мяч, бросает его на расстояние 5, то мяч получит либо 7-й игрок
// (бросок по часовой стрелке), либо 4-й игрок (бросок против часовой стрелки).
// Иллюстрация этого примера приведена ниже.

// Игра прервалась после m бросков из-за неожиданного дождя. Когда дождь закончился,
// ребята вновь собрались, чтобы продолжить. Однако никто не мог вспомнить, у кого
// остался мяч. Как оказалось, Бернард запомнил расстояния каждого из бросков
// и направление для некоторых бросков (по часовой стрелке или против часовой стрелки).

// Рудольф просит вас помочь ему и на основе информации от Бернарда вычислить номера
// игроков, у которых мог оказаться мяч после m бросков.

// Входные данные
// Первая строка входных данных содержит одно целое число t (1 ≤ t ≤ 10^4) —
// количество наборов входных данных. Далее следуют описания наборов.

// Первая строка каждого набора содержит три целых числа n, m, x (2 ≤ n ≤ 1000,
// 1 ≤ m ≤ 1000, 1 ≤ x ≤ n) — количество игроков, число совершённых бросков
// и номер игрока, который бросил мяч первым, соответственно.

// Следующие m строк содержат информацию о каждом броске по порядку. Каждая из них
// содержит целое число r_i (1 ≤ r_i ≤ n − 1) — расстояние, на которое был совершён
// i-й бросок, и символ c_i, равный «0», «1» или «?»:

// - если c_i = '0', то i-й бросок был совершён по часовой стрелке,
// - если c_i = '1', то i-й бросок был совершён против часовой стрелки,
// - если c_i = '?', то Бернард не помнит направление, и i-й бросок мог быть совершён
//   как по часовой стрелке, так и против часовой стрелки.

// Гарантируется, что сумма n·m (n умноженное на m) по всем наборам входных данных
// не превосходит 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите по две строки.

// В первой строке выведите количество игроков k (1 ≤ k ≤ n), у которых в конце игры
// мог оказаться мяч.

// В следующей строке выведите k чисел b_i (1 ≤ b_i ≤ n) — номера игроков
// в возрастающем порядке. Все номера должны быть различными.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 6 3 2
// 2 ?
// 2 ?
// 2 ?
// 12 1 2
// 3 1
// 10 7 4
// 2 ?
// 9 1
// 4 ?
// 7 0
// 2 0
// 8 1
// 5 ?
// 5 3 1
// 4 0
// 4 ?
// 1 ?
// 4 1 1
// 2 ?
// ======================================================================
// Выходные данные
// ======================================================================
// 3
// 2 4 6
// 1
// 11
// 4
// 3 5 7 9
// 3
// 2 3 5
// 1
// 3
// ======================================================================

// Примечание
// Ниже приведена иллюстрация трёх бросков для первого набора входных данных примера.
// Стрелки обозначают возможные направления броска. Серым цветом обозначены игроки,
// у которых мог оказаться мяч после броска.

#include <bits/stdc++.h>
using namespace std;

#define int long long

// 26

void solve()
{
    int n, q;
    string a, b;
    cin >> n >> q >> a >> b;

    vector<vector<int>> pref_a(26, vector<int>(n + 1, 0)), pref_b(26, vector<int>(n + 1, 0));
    for (int i = 0; i < n; i++)
    {
        for (int j = 0; j < 26; j++)
        {
            pref_a[j][i + 1] = pref_a[j][i];
            pref_b[j][i + 1] = pref_b[j][i];
        }

        pref_a[a[i] - 'a'][i + 1]++;
        pref_b[b[i] - 'a'][i + 1]++;
    }
    while (q--)
    {
        int l, r;
        cin >> l >> r;
        int res = 0;
        for (int j = 0; j < 26; j++)
        {
            int tmp1 = pref_a[j][r] - pref_a[j][l - 1];
            int tmp2 = pref_b[j][r] - pref_b[j][l - 1];
            if (tmp1 < tmp2)
                res += tmp2 - tmp1;
        }
        cout << res << '\n';
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
    {
        solve();
    }
    return 0;
}
