// H. Хороший массив
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// Назовём массив хорошим, если в нём есть элемент, равный сумме всех остальных
// элементов. Например, массив a = [1, 3, 3, 7] — хороший, так как a4 = 7 равно 1 + 3 + 3.

// Вам дан массив a из n целых чисел. Ваше задание — найти все такие индексы j этого
// массива, что после удаления j-го элемента массив станет хорошим (назовём такие
// индексы красивыми).

// Например, если a = [8, 3, 5, 2], красивые индексы — 1 и 4:

// - при удалении a1 массив станет [3, 5, 2], и этот массив хороший;
// - при удалении a4 массив станет [8, 3, 5], и этот массив хороший.

// Все удаления надо рассматривать независимо, то есть для каждого индекса надо удалить
// элемент, проверить, что массив теперь хороший, и после этого вставить элемент обратно.

// Входные данные
// В первой строке записано одно целое число n (2 ≤ n ≤ 2·10^5) — количество элементов в a.

// Во второй строке записаны n целых чисел a1, a2, …, a_n (1 ≤ a_i ≤ 10^6) —
// элементы массива a.

// Выходные данные
// В первой строке выведите k — количество таких индексов j массива a, что после
// удаления j-го элемента массив станет хорошим (то есть, выведите количество
// красивых индексов).

// Во второй строке выведите k различных целых чисел j1, j2, …, j_k в любом порядке —
// красивые индексы a.

// Если таких индексов нет в массиве a, в первой строке выведите 0, а вторую строку
// оставьте пустой или не выводите вообще.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 2 5 1 2 2
// ======================================================================
// Выходные данные
// ======================================================================
// 3
// 4 1 5

// ======================================================================
// Входные данные
// ======================================================================
// 4
// 8 3 5 2
// ======================================================================
// Выходные данные
// ======================================================================
// 2
// 1 4

// ======================================================================
// Входные данные
// ======================================================================
// 5
// 2 1 2 4 3
// ======================================================================
// Выходные данные
// ======================================================================
// 0
// ======================================================================

// Примечание
// В первом примере можно удалить любой элемент со значением 2, и массив станет
// [5, 1, 2, 2]. Сумма массива равна 10, и есть элемент, равный сумме остальных
// (5 = 1 + 2 + 2).

// Во втором примере можно удалить 8, и массив станет [3, 5, 2]. Сумма равна 10,
// и есть элемент, равный сумме остальных элементов (5 = 3 + 2). Также можно удалить 2,
// и массив станет [8, 3, 5]. Сумма равна 16, и есть элемент, равный сумме остальных
// (8 = 3 + 5).

// В третьем примере нельзя удалением только одного элемента сделать массив хорошим.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    map<int, vector<int>> m;
    for (int i = 0; i < n; i++)
    {
        int x;
        cin >> x;
        for (auto i = m.rbegin(); i != m.rend(); i++)
        {
            // m[*i + x][0] = max(m[i + x][0], m[i][0] + 1);
        }
    }
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
