// I. Дима и лесенка
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// У Димы есть лесенка, которая состоит из n ступенек. Первая ступенька имеет высоту a1,
// вторая — a2, последняя — a_n (1 ≤ a1 ≤ a2 ≤ … ≤ a_n).

// Дима решил поиграться с лесенкой, поэтому он бросает сверху на лесенку прямоугольные
// коробки: i-я коробка имеет ширину w_i и высоту h_i. Каждую коробку Дима бросает
// вертикально вниз на первые w_i ступенек лесенки, то есть коробка покрывает ступеньки
// с номерами 1, 2, …, w_i. Каждая брошенная коробка летит вертикально вниз до тех пор,
// пока не случится хотя бы одно из двух следующих событий:

// - низ коробки коснётся верха одной из ступенек;
// - низ коробки коснётся верха одной из уже брошенных коробок.

// Учитывается только касание горизонтальных сторон ступенек и коробок, при этом касание
// углами не учитывается. В частности, из этого следует, что коробка шириной w_i не может
// коснуться ступеньки с номером w_i + 1.

// Вам задано описание лесенки и последовательность, в которой Дима кидал коробки на неё.
// Для каждой коробки определите, на какой высоте окажется низ этой коробки после
// приземления. Считайте, что очередная коробка бросается уже после приземления предыдущей.

// Входные данные
// В первой строке записано целое число n (1 ≤ n ≤ 10^5) — количество ступенек у лесенки.
// Во второй строке задана неубывающая последовательность, состоящая из n целых чисел,
// a1, a2, …, a_n (1 ≤ a_i ≤ 10^9; a_i ≤ a_{i+1}).

// В следующей строке задано целое число m (1 ≤ m ≤ 10^5) — количество коробок.
// В каждой из следующих m строк записана пара целых чисел w_i, h_i (1 ≤ w_i ≤ n; 1 ≤ h_i ≤ 10^9) —
// размер i-й брошенной коробки.

// Числа в строках разделяются пробелами.

// Выходные данные
// Выведите m целых чисел — для каждой коробки высоту, на которой окажется низ этой коробки
// после приземления. Ответы для коробок выводите в порядке, в котором коробки заданы
// во входных данных.

// Пожалуйста, не используйте спецификатор %lld для чтения или записи 64-битных чисел
// на C++. Рекомендуется использовать потоки cin, cout или спецификатор %I64d.

// ======================================================================
// Примеры
// ======================================================================
// Входные данные
// ======================================================================
// 5
// 1 2 3 6 6
// 4
// 1 1
// 3 1
// 1 1
// 4 3
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 3
// 4
// 6

// ======================================================================
// Входные данные
// ======================================================================
// 3
// 1 2 3
// 2
// 1 1
// 3 1
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 3

// ======================================================================
// Входные данные
// ======================================================================
// 1
// 1
// 5
// 1 2
// 1 10
// 1 10
// 1 10
// 1 10
// ======================================================================
// Выходные данные
// ======================================================================
// 1
// 3
// 13
// 23
// 33
// ======================================================================

// Примечание
// На картинке изображён первый тестовый пример (в оригинале).

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    vector<int> a(n);
    for (auto &i : a)
        cin >> i;

    int q;
    cin >> q;
    int last_t = 0;
    while (q--)
    {
        int w, h;
        cin >> w >> h;
        int ans = max(a[w - 1], last_t);
        cout << ans << '\n';
        last_t = ans + h;
    }

    // for (auto &i : pref)
    //     cout << i.first << ' ' << i.second << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);

    solve();
    return 0;
}
