// A. Хороший контест
// ограничение по времени на тест1 секунда
// ограничение по памяти на тест256 мегабайт

// В следующем программном контесте три задачи и n участников.

// Задача 1 — простая, задача 2 — средней сложности, а задача 3 — сложная.

// Участник называется слабым, если он не решил все три задачи.

// К сожалению, таблица результатов была утеряна. Единственная оставшаяся информация —
// это массив a длины 3, где a_i — количество участников, решивших задачу i.

// Среди всех таблиц результатов, согласующихся с этой информацией, найдите минимально
// возможное количество слабых участников.

// Входные данные
// В первой строке содержится целое число t (1 ≤ t ≤ 3000) — количество наборов
// входных данных.

// В первой строке каждого набора входных данных содержится целое число n (1 ≤ n ≤ 9) —
// количество участников.

// Во второй строке каждого набора входных данных содержатся три целых числа
// a1, a2, a3 (0 ≤ a_i ≤ n), где a_i — количество участников, решивших задачу i.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — минимально возможное
// количество слабых участников.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 3
// 3 3 3
// 4
// 4 4 3
// 1
// 1 1 1
// 9
// 9 8 9
// 5
// 0 5 5
// 6
// 4 3 2
// ======================================================================
// Выходные данные
// ======================================================================
// 0
// 1
// 0
// 1
// 5
// 4
// ======================================================================

// Примечание
// В первом наборе входных данных все 3 участника могли решить все три задачи,
// поэтому ответ равен 0.

// Во втором наборе входных данных участник 1 мог решить только задачи 1 и 2,
// а участники 2, 3 и 4 решили все три задачи. Поэтому участник 1 — единственный
// участник, который не является сильным, так что ответ равен 1. Можно показать,
// что это минимально.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n, a, b, c;
    cin >> n >> a >> b >> c;
    cout << n - min({a, b, c}) << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
