// C. И, ИЛИ, сортировка!
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Дана двоичная строка* s длины n.

// Вы можете выполнять следующую операцию любое количество раз (возможно, ни разу):

// - выбрать целое число i (1 ≤ i ≤ n) и заменить s_i либо на побитовое И, либо
//   на побитовое ИЛИ символов s1, s2, …, s_i.

// Обратите внимание, что побитовое И или побитовое ИЛИ одного элемента равно самому
// этому элементу.

// Ваша цель — сделать строку s отсортированной в неубывающем порядке†.

// Найдите минимальное количество операций, необходимое, чтобы отсортировать s
// в неубывающем порядке.

// * Двоичная строка содержит только символы 0 и 1.

// † Если строка s отсортирована в неубывающем порядке, то s1 ≤ s2 ≤ … ≤ s_n.

// Входные данные
// В первой строке дано одно целое число t (1 ≤ t ≤ 10^4) — количество наборов
// входных данных.

// В первой строке каждого набора входных данных дано одно целое число n
// (2 ≤ n ≤ 2·10^5) — длина двоичной строки s.

// Во второй строке каждого набора входных данных дана двоичная строка s длины n.
// Каждый символ строки s — это либо 0, либо 1.

// Гарантируется, что сумма n по всем наборам входных данных не превосходит 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число — минимальное
// количество операций, необходимое, чтобы отсортировать s в неубывающем порядке.

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 4
// 0011
// 4
// 1000
// 5
// 01000
// 8
// 01001101
// 7
// 0101010
// 7
// 0111101
// ======================================================================
// Выходные данные
// ======================================================================
// 0
// 3
// 1
// 2
// 3
// 1
// ======================================================================

// Примечание
// В первом наборе входных данных строка уже отсортирована, поэтому операции
// не требуются.

// Во втором наборе входных данных мы можем использовать побитовое OR, чтобы
// изменить последние три символа на 1, получив 1111 за 3 операции.

#include <bits/stdc++.h>
using namespace std;

#define int long long

void solve()
{
    int n;
    cin >> n;
    string s;
    cin >> s;
    int cnt1 = 0, cnt0 = 0;
    for (auto &i : s)
    {
        cnt1 += i == '1';
        cnt0 += i == '0';
    }
    if (cnt1 == 0 || cnt0 == 0 || is_sorted(s.begin(), s.end()))
    {
        cout << "0\n";
        return;
    }
    if (s[0] == '1')
    {
        cout << cnt0 << '\n';
        return;
    }
    int l0 = 0, l1 = 0, res = cnt0;
    for (int i = 0; i < n; i++)
    {
        if (s[i] == '1')
            l1++;
        else
            l0++;
        res = min(res, l1 + (cnt0 - l0));
    }
    cout << res << '\n';
}

int32_t
main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
