// E. Разрушение простых
// ограничение по времени на тест2 секунды
// ограничение по памяти на тест256 мегабайт

// Вам дано мультимножество a, состоящее из n положительных целых чисел.

// Вы можете выполнять следующую операцию любое количество раз (возможно, ноль):

// Выберите целое число x > 1 из мультимножества и простой делитель p числа x.
// Удалите одно вхождение x из мультимножества и добавьте p копий числа x/p.
// Также дано целое число k (1 ≤ k ≤ n). Пусть f(k) — это минимальное количество операций,
// необходимое, начиная с исходного мультимножества, чтобы каждое число в мультимножестве
// стало не больше k.

// Найдите f(k).

// Входные данные
// Каждый набор входных данных содержит несколько наборов входных данных. В первой строке
// задано количество наборов входных данных t (1 ≤ t ≤ 10^4). Далее следует описание
// наборов входных данных.

// Первая строка каждого набора входных данных содержит два целых числа n и k
// (1 ≤ k ≤ n ≤ 2·10^5) — начальный размер мультимножества и заданное целое число
// соответственно.

// Во второй строке каждого набора входных данных записаны n целых чисел
// a1, a2, …, an (1 ≤ ai ≤ n) — элементы мультимножества.

// Гарантируется, что сумма n по всем наборам входных данных не превышает 2·10^5.

// Выходные данные
// Для каждого набора входных данных выведите одно целое число f(k).

// ======================================================================
// Пример
// ======================================================================
// Входные данные
// ======================================================================
// 6
// 1 1
// 1
// 6 2
// 6 6 4 3 2 1
// 8 1
// 8 6 4 3 2 1 8 6
// 12 3
// 12 10 9 8 7 6 5 4 3 2 1 12
// 10 9
// 10 9 8 7 6 5 4 3 2 1
// 5 5
// 5 4 3 2 1
// ======================================================================
// Выходные данные
// ======================================================================
// 0
// 4
// 25
// 15
// 1
// 0
// ======================================================================

// Примечание
// В первом наборе входных данных единственный элемент уже не больше k, поэтому операций
// не требуется.

// Во втором наборе входных данных можно выполнить следующие операции:

// [6,6,4,3,2,1] → [2,2,2,6,4,3,2,1],

// [2,2,2,6,4,3,2,1] → [2,2,2,2,2,2,4,3,2,1],

// [2,2,2,2,2,2,4,3,2,1] → [2,2,2,2,2,2,2,2,3,2,1],

// [2,2,2,2,2,2,2,2,3,2,1] → [2,2,2,2,2,2,2,2,1,1,1,2,1].

// Таким образом, достаточно 4 операций. Можно показать, что последовательности
// с меньшим числом операций не существует.

#include <bits/stdc++.h>
using namespace std;

#define int long long

const int MAXS = 1e6 + 5;
int primes[MAXS];
int dp[MAXS];

void solve()
{
    int n, k, mx = 0;
    cin >> n >> k;
    vector<int> a(n);
    for (auto &i : a)
    {
        cin >> i;
        mx = max(mx, i);
    }

    for (int i = 0; i <= k; i++)
        dp[i] = 0;

    for (int i = k + 1; i <= mx; i++)
    {
        dp[i] = -1;
        int t = i;
        while (t > 1)
        {
            int p = primes[t], nx_p = 1 + p * dp[i / p];
            dp[i] = (dp[i] == -1 || nx_p < dp[i] ? nx_p : dp[i]);
            while (t % p == 0)
                t /= p;
        }
    }
    int res = 0;
    for (auto &i : a)
        res += dp[i];
    cout << res << '\n';
}

int32_t main()
{
    ios_base::sync_with_stdio(false);
    cin.tie(NULL);
    primes[0] = 1;
    primes[1] = 1;
    for (int i = 2; i < MAXS; i++)
    {
        primes[i] = i;
    }
    for (int i = 2; i * i < MAXS; i++)
    {
        if (primes[i] == i)
            for (int j = i * i; j < MAXS; j += i)
                if (primes[j] == j)
                    primes[j] = i;
    }
    int t;
    cin >> t;
    while (t--)
        solve();
    return 0;
}
